

#Область ОбработчикиСобытийФормы

#КонецОбласти


#Область ОбработчикиКомандФормы
	
#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДатуОкончанияИспытательногоСрокаСотрудника() Экспорт

	///+ГомзМА 01.06.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЭкзаменационныеЛисты.Ссылка КАК Ссылка,
		|	ЭкзаменационныеЛисты.ОкончаниеИспытательногоСрока КАК ОкончаниеИспытательногоСрока,
		|	ЭкзаменационныеЛисты.Учащийся КАК Учащийся
		|ИЗ
		|	Документ.ЭкзаменационныеЛисты КАК ЭкзаменационныеЛисты
		|ГДЕ
		|	НЕ ЭкзаменационныеЛисты.ПометкаУдаления";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ДатаНачалаРаботы = ПолучитьДатуНачалаРаботыСотрудника(РезультатЗапроса.Учащийся);
		Если ДатаНачалаРаботы <> '00010101' Тогда
			ДокОбъект.ОкончаниеИспытательногоСрока = ДатаНачалаРаботы + 86400 * 90;
			ДокОбъект.Записать();
		КонецЕсли;
	КонецЦикла;
	///-ГомзМА 01.06.2023

	
	
КонецПроцедуры

&НаСервере
Функция ПолучитьДатуНачалаРаботыСотрудника(Сотрудник) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь КАК СотрудникПользователь,
		|	ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь.Подразделение КАК СотрудникПользовательПодразделение,
		|	ДолжностиСотрудниковСрезПоследних.Регистратор.Город КАК РегистраторГород,
		|	ДолжностиСотрудниковСрезПоследних.Регистратор КАК Регистратор,
		|	ДолжностиСотрудниковСрезПоследних.Регистратор.Дата КАК РегистраторДата
		|ИЗ
		|	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
		|ГДЕ
		|	НЕ ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь.Недействителен
		|	И ДолжностиСотрудниковСрезПоследних.Регистратор ССЫЛКА Документ.КадровыйПриказ
		|	И ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь = &Пользователь
		|
		|УПОРЯДОЧИТЬ ПО
		|	ДолжностиСотрудниковСрезПоследних.Регистратор.Дата УБЫВ";
	
	Запрос.УстановитьПараметр("Пользователь", Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Возврат РезультатЗапроса.РегистраторДата;
	Иначе
		Возврат '00010101';	
	КонецЕсли;

КонецФункции // ПолучитьДатуНачалаРаботыСотрудника(Сотрудник)


#КонецОбласти
