#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтаФорма);
	СписокДолжостей.Параметры.УстановитьЗначениеПараметра("Отдел", Объект.Ссылка);
	СписокОбязанностей.Параметры.УстановитьЗначениеПараметра("Отдел", Объект.Ссылка);
	ОбновитьКоличествоОбязанностей();
КонецПроцедуры

&НаСервере
Процедура ОбновитьКоличествоОбязанностей()
Для каждого стр из объект.Должности Цикл
Запрос = новый Запрос();
Запрос.Текст = "ВЫБРАТЬ
|	КОЛИЧЕСТВО(ОбязанностиСписокДолжностей.Ссылка) КАК Ссылка,
|	ПодразделенияДолжности.Должность
|ИЗ
|	Справочник.Подразделения.Должности КАК ПодразделенияДолжности
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Обязанности.СписокДолжностей КАК ОбязанностиСписокДолжностей
|		ПО ПодразделенияДолжности.Должность = ОбязанностиСписокДолжностей.Должность
|ГДЕ
|	ПодразделенияДолжности.Должность = &Должность
|СГРУППИРОВАТЬ ПО
|	ПодразделенияДолжности.Должность";
запрос.УстановитьПараметр("Должность",стр.Должность );
//@skip-check query-in-loop
 Выборка = Запрос.Выполнить().Выбрать();
 Выборка.следующий();
 Стр.КоличествоОбязанностей = ВЫборка.Ссылка
КонецЦикла;

КонецПроцедуры

&НаКлиенте
Процедура ОБновитьОбязанности(Команда)
	ОбновитьКоличествоОбязанностей();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭтоЦФОПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



&НаКлиенте
Процедура УчастникиСотрудникОткрытие(Элемент, СтандартнаяОбработка)
	//УчастникиСотрудникОткрытиеНаСервере();
	ТекДанные = Элементы.Участники.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	СсылкаДляОткрытия=УчастникиСотрудникОткрытиеНаСервере(ТекДанные.сотрудник);
	ПараметрыФормы = Новый Структура("Ключ", СсылкаДляОткрытия);
	//Если ТипЗнч(СсылкаДляОткрытия)=тип("справочникСсылка.Обязанности") Тогда
		ИмяФормыДокумента="справочник.сотрудники.Форма.ФормаЭлемента";
	//Иначе
	//	Возврат;
	//КонецЕсли;
	ФормаДокумента = ПолучитьФорму(ИмяФормыДокумента, ПараметрыФормы);
	ФормаДокумента.Открыть();
КонецПроцедуры

&НаСервере
Функция УчастникиСотрудникОткрытиеНаСервере(Юзер)
	Возврат Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь",Юзер);
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.Город.Видимость = Объект.ЭтоЦФО;
	
КонецПроцедуры



#КонецОбласти

