&НаКлиенте
Процедура СписокОбязанностейВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	СсылкаДляОткрытия    = Элементы.СписокОбязанностей.ТекущиеДанные[СтрЗаменить(Поле.Имя,Элемент.имя,"")];
	ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
	Если ТипЗнч(СсылкаДляОткрытия)=тип("СправочникСсылка.Обязанности") Тогда
		ИмяФормыДокумента="Справочник.обязанности.Форма.Формаэлемента";
		//ИначеЕсли ТипЗнч(СсылкаДляОткрытия)=тип("ДокументСсылка.КадровыйПриказ") Тогда
		//ИмяФормыДокумента="Документ.КадровыйПриказ.Форма.ФормаДокумента";
		//Возврат;
	КонецЕсли;
	
	ФормаДокумента = ПолучитьФорму(ИмяФормыДокумента, ПараметрыФормы);
	ФормаДокумента.Открыть();
КонецПроцедуры

#Область ОбработчикиСобытийФормы

&НаСервере
Функция СсылкаОргструктура()
//++МазинЕС 22.05.24	
 Запрос = Новый Запрос;
 Запрос.Текст =
 	"ВЫБРАТЬ
 	|	Подразделения.Ссылка КАК Ссылка
 	|ИЗ
 	|	Справочник.Подразделения КАК Подразделения
 	|ГДЕ
 	|	Подразделения.Код = &Код";
 Запрос.УстановитьПараметр("Код","000000105");
 РезультатЗапроса = Запрос.Выполнить();
 
 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 
 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 	Возврат ВыборкаДетальныеЗаписи.Ссылка;
 КонецЦикла;
//++МазинЕС 22.05.24
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
//++МазинЕС 22.05.24	
 
Если объект.Родитель = СсылкаОргструктура() ИЛИ объект.Код="000000105" Тогда
	Элементы.СтраницаПремияДляУправления.Видимость = Истина; 
Иначе Элементы.СтраницаПремияДляУправления.Видимость = Ложь; 
КонецЕсли; 

Если объект.Код="000000105" Тогда
	Элементы.ПроценОтВыручкиОбщий.ТолькоПросмотр = ЛОжь; 
	Элементы.ПроценОтВыручки.ТолькоПросмотр = ЛОжь;
КонецЕсли; 

//++МазинЕС 22.05.24
КонецПроцедуры

&НаСервере
Функция ПолучитьДанныеКадровогоПриказа()
// ++ Мазин 15.05.24
  Запрос = Новый Запрос;
  Запрос.Текст =
  	"ВЫБРАТЬ
  	|	ДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
  	|	МАКСИМУМ(ДолжностиСотрудниковСрезПоследних.Регистратор.Дата) КАК РегистраторДата1
  	|ПОМЕСТИТЬ ВременнаяТаблица
  	|ИЗ
  	|	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
  	|СГРУППИРОВАТЬ ПО
  	|	ДолжностиСотрудниковСрезПоследних.Сотрудник
  	|;
  	|
  	|////////////////////////////////////////////////////////////////////////////////
  	|ВЫБРАТЬ
  	|	Сотрудники.Пользователь КАК Пользователь
  	|ИЗ
  	|	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
  	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВременнаяТаблица КАК ВременнаяТаблица
  	|		ПО (ВременнаяТаблица.РегистраторДата1 = ДолжностиСотрудниковСрезПоследних.Регистратор.Дата)
  	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
  	|		ПО (ДолжностиСотрудниковСрезПоследних.Сотрудник = Сотрудники.Ссылка)
  	|ГДЕ
  	|	ДолжностиСотрудниковСрезПоследних.Подразделение = &Подразделение";
  
  Запрос.УстановитьПараметр("Подразделение",Объект.Ссылка );
  
  РезультатЗапроса = Запрос.Выполнить();
  
  ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  ФИО = Новый Массив;
  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
  ФИО.Добавить(ВыборкаДетальныеЗаписи.Пользователь); 	
  КонецЦикла;
  Возврат ФИО; 
 // -- Мазин 15.05.24
КонецФункции
&НаКлиенте
Процедура СравнитьРезультатЗапроса() 
// ++ Мазин 15.05.24
    ФИО = ПолучитьДанныеКадровогоПриказа(); 
    Для каждого Элемент Из ФИО Цикл 
          ФлагСовпадения = Ложь;
        Для каждого ЭлементСправочника Из Объект.Участники Цикл
            Если ЭлементСправочника.Сотрудник = Элемент Тогда 
                ФлагСовпадения = Истина;
                Прервать; 
            КонецЕсли;   	
        КонецЦикла;
        Если ФлагСовпадения = Ложь Тогда
            НоваяСтрока =Объект.Участники.Добавить(); 
			НоваяСтрока.Сотрудник = Элемент; 
        КонецЕсли;
    КонецЦикла; 
// -- Мазин 15.05.24
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокСотрудников(Команда)
//++Мазин 15.05.24
	
	Индекс = Объект.Участники.Количество() - 1;
	Пока Индекс >= 0 Цикл
    Объект.Участники.Удалить(Индекс);
    Индекс = Индекс - 1;
	КонецЦикла;
	СравнитьРезультатЗапроса(); 
	// -- Мазин 15.05.24
КонецПроцедуры
&НаСервере
Функция ОкладсотрудниковПодразделения ()
	//++Мазин 17.05.24
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
		|	МАКСИМУМ(ДолжностиСотрудниковСрезПоследних.Регистратор.Дата) КАК РегистраторДата1
		|ПОМЕСТИТЬ ВременнаяТаблица
		|ИЗ
		|	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
		|СГРУППИРОВАТЬ ПО
		|	ДолжностиСотрудниковСрезПоследних.Сотрудник
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(КадровыйПриказ.Оклад) КАК Оклад,
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ КадровыйПриказ.Сотрудник) КАК Сотрудник
		|ИЗ
		|	ВременнаяТаблица КАК ВременнаяТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.КадровыйПриказ КАК КадровыйПриказ
		|		ПО (КадровыйПриказ.Дата = ВременнаяТаблица.РегистраторДата1)
		|ГДЕ
		|	КадровыйПриказ.Отдел = &Отдел";
	
	Запрос.УстановитьПараметр("Отдел", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Объект.Оклад = ВыборкаДетальныеЗаписи.Оклад; 
	Объект.КоличествоСотрудников= ВыборкаДетальныеЗаписи.Сотрудник;
	КонецЦикла;
	//--Мазин 17.05.24
КонецФункции
&НаСервере
Процедура РасчетОкладовИДоходовУправления()
// ++ Мазин 21.05.24

Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	СУММА(Подразделения.Оклад) КАК Оклад,
	|	СУММА(Подразделения.КоличествоСотрудников) КАК ВыборкаДетальныеЗаписи,
	|	СУММА(Подразделения.ДоходОбщий) КАК ДоходОбщий
	|ИЗ
	|	Справочник.Подразделения КАК Подразделения
	|ГДЕ
	|	Подразделения.Ссылка В ИЕРАРХИИ (&Ссылка)";

Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
  Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
  	Оклад= ВыборкаДетальныеЗаписи.Оклад; 
  	Сотрудники=ВыборкаДетальныеЗаписи.ВыборкаДетальныеЗаписи;
  	ДоходОбщий = ВыборкаДетальныеЗаписи.ДоходОбщий;
  КонецЦикла;

		Если объект.Родитель.Код = "000000105"  Тогда 
	Объект.ОкладСуммаУправлениеиОтдел=Оклад; 
	Объект.ДоходОбщий = (Константы.ПремиальныйФонд.Получить() * (Объект.ПроценОтВыручкиОбщий/100)) + Объект.ОкладСуммаУправлениеиОтдел;
	Объект.ПремияОбщая = (Константы.ПремиальныйФонд.Получить() * (Объект.ПроценОтВыручкиОбщий/100));	
	ОБъект.КоличествоСотрудниковОбщее = Сотрудники; 	
		Иначе 		Объект.ОкладСуммаУправлениеиОтдел = 0; 
					Объект.ДоходОбщий = 0; 
					Объект.ПремияОбщая =0;
					Объект.КоличествоСотрудниковОбщее = 0;
		КонецЕсли; 

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Подразделения.КоличествоСотрудниковОбщее) КАК КоличествоСотрудниковОбщее,
		|	СУММА(Подразделения.ОкладСуммаУправлениеиОтдел) КАК ОкладСуммаУправлениеиОтдел1,
		|	СУММА(Подразделения.ПроценОтВыручкиОбщий) КАК ПроценОтВыручкиОбщий1,
		|	СУММА(Подразделения.ПремияОбщая) КАК ПремияОбщая,
		|	СУММА(Подразделения.ДоходОбщий) КАК ДоходОбщий1
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	(Подразделения.Родитель.Код = ""000000105""
		|	ИЛИ Подразделения.Родитель.Родитель.Код = ""000000105"")";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если объект.Код="000000105" Тогда 
			
			Объект.ОкладСуммаУправлениеиОтдел=ВыборкаДетальныеЗаписи.ОкладСуммаУправлениеиОтдел1; 
			Объект.ДоходОбщий =ВыборкаДетальныеЗаписи.ДоходОбщий1;
			Объект.ПремияОбщая =ВыборкаДетальныеЗаписи.ПремияОбщая;
			Объект.ПроценОтВыручкиОбщий= ВыборкаДетальныеЗаписи.ПроценОтВыручкиОбщий1; 	
			Объект.КоличествоСотрудниковОбщее = ВыборкаДетальныеЗаписи.КоличествоСотрудниковОбщее; 	
	
			КонецЕсли; 	
		
	КонецЦикла;
	

	
		
// -- Мазин 21.05.24
КонецПроцедуры
&НаКлиенте
Процедура ПроценОтВыручкиОбщийПриИзменении(Элемент)
	// ++ Мазин 21.05.24
	ПроценОтВыручкиОбщийПриИзмененииСервер();
	// ++ Мазин 21.05.24
КонецПроцедуры
&НаСервере
Процедура ПроценОтВыручкиОбщийПриИзмененииСервер()
	// ++ Мазин 21.05.24
	Объект.ДоходОбщий = (Константы.ПремиальныйФонд.Получить() * (Объект.ПроценОтВыручкиОбщий/100)) + Объект.ОкладСуммаУправлениеиОтдел;
	Объект.ПремияОбщая = (Константы.ПремиальныйФонд.Получить()  * (Объект.ПроценОтВыручкиОбщий/100));	
	// ++ Мазин 21.05.24
КонецПроцедуры
&НаКлиенте
Процедура СписокСотрудниковПриИзменении(Элемент)
	// ++ Мазин 21.05.24
	ОкладсотрудниковПодразделения (); 
	РасчетОкладовИДоходовУправления();
	РассчётДохода();
	// -- Мазин 21.05.24
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтаФорма);
	ОбновитьСписки();
	ОбновитьКоличествоОбязанностей();
	Получитькомпоненту(); 
	Элементы.QRКод.РазмерКартинки = РазмерКартинки.АвтоРазмер;
	//++Мазин 17-05-24
	ОкладсотрудниковПодразделения (); 
	РасчетОкладовИДоходовУправления();
	РассчётДохода(); 
	//--Мазин 17-05-24
	
КонецПроцедуры

&НаСервере
Процедура Получитькомпоненту()
	ТекстОшибки = "";
	
	Штрихкод =  ГенераторШтрихКода.ПолучитьКомпонентуШтрихКодирования(ТекстОшибки); 
	Штрихкод.Ширина = 250; 
	Штрихкод.Высота = 250;
	Штрихкод.ТипКода = 16;
	Штрихкод.УголПоворота = 0;
	Штрихкод.ЗначениеКода = "{ ""id_doc"":"+ """" + Объект.Код + """" + ",""type"":" +" ""Отдел""}";
	Штрихкод.ПрозрачныйФон = Истина;
	Штрихкод.ОтображатьТекст = Ложь;
	
	ДвоичныйШтрихКод = штрихкод.ПолучитьШтрихКод();
	КартинкаШтрихКод = Новый Картинка(ДвоичныйШтрихКод,Истина);
	
	QRкод = ПоместитьВоВременноеХранилище(КартинкаШтрихКод,УникальныйИдентификатор);
	//возврат истина;
КонецПроцедуры

Процедура ОбновитьСписки()
	СписокДолжостей.Параметры.УстановитьЗначениеПараметра("Родитель", Объект.Ссылка);
	СписокОбязанностей.Параметры.УстановитьЗначениеПараметра("Отдел", Объект.Ссылка);
	СписокКадровыеПриказы.Параметры.УстановитьЗначениеПараметра("Отдел", Объект.Ссылка);
	СписокСотрудников.Параметры.УстановитьЗначениеПараметра("Родитель", Объект.Ссылка);
КонецПроцедуры
&НаСервере
Процедура ОбновитьКоличествоОбязанностей()
Для каждого стр из объект.Должности Цикл
Запрос = новый Запрос();
Запрос.Текст = "ВЫБРАТЬ
|	ПодразделенияДолжности.Должность,
|	КОЛИЧЕСТВО(ДолжностиПредприятияОбязанности.Обязанность) КАК Обязанность
|ИЗ
|	Справочник.ДолжностиПредприятия.Обязанности КАК ДолжностиПредприятияОбязанности
|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения.Должности КАК ПодразделенияДолжности
|		ПО ПодразделенияДолжности.должность = ДолжностиПредприятияОбязанности.ссылка
|ГДЕ
|	ПодразделенияДолжности.Должность = &Должность
|СГРУППИРОВАТЬ ПО
|	ПодразделенияДолжности.Должность";
запрос.УстановитьПараметр("Должность",стр.Должность );
//@skip-check query-in-loop
 Выборка = Запрос.Выполнить().Выбрать();
 Выборка.следующий();
 Стр.КоличествоОбязанностей = ВЫборка.Обязанность
КонецЦикла;

КонецПроцедуры


&НаКлиенте
Процедура ПоказатьСкрытьДолжности(Команда)
	Если ТумблерДолжностей Тогда
		Элементы.ПоказатьСкрытьДолжности.Заголовок = "Показать должности и сотрудников всех подотделов";
		Элементы.СписокДолжостей.Видимость = Ложь;
		Элементы.Должности1.Видимость = Истина;
		Элементы.Участники.Видимость = Истина;
		Элементы.СписокСотрудников.Видимость = Ложь;
		ТумблерДолжностей = Ложь;
	Иначе
		Элементы.ПоказатьСкрытьДолжности.Заголовок = "Показать должности и сотрудников этого отдела";
		Элементы.СписокДолжостей.Видимость = Истина;
		Элементы.Должности1.Видимость = Ложь;
		Элементы.Участники.Видимость = Ложь;
		Элементы.СписокСотрудников.Видимость = Истина;
		ТумблерДолжностей = Истина;
	КонецЕсли;	
ОбновитьСписки();
КонецПроцедуры

&НаКлиенте
Процедура ОБновитьОбязанности(Команда)
	ОбновитьКоличествоОбязанностей();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЭтоЦФОПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



&НаКлиенте
Процедура УчастникиСотрудникОткрытие(Элемент, СтандартнаяОбработка)
	//УчастникиСотрудникОткрытиеНаСервере();
	ТекДанные = Элементы.Участники.ТекущиеДанные;
	СтандартнаяОбработка = Ложь;
	СсылкаДляОткрытия=УчастникиСотрудникОткрытиеНаСервере(ТекДанные.сотрудник);
	ПараметрыФормы = Новый Структура("Ключ", СсылкаДляОткрытия);
	//Если ТипЗнч(СсылкаДляОткрытия)=тип("справочникСсылка.Обязанности") Тогда
		ИмяФормыДокумента="справочник.сотрудники.Форма.ФормаЭлемента";
	//Иначе
	//	Возврат;
	//КонецЕсли;
	ФормаДокумента = ПолучитьФорму(ИмяФормыДокумента, ПараметрыФормы);
	ФормаДокумента.Открыть();
КонецПроцедуры


&НаСервере
Функция УчастникиСотрудникОткрытиеНаСервере(Юзер)
	Возврат Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь",Юзер);
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	//Элементы.Город.Видимость = Объект.ЭтоЦФО;
	
КонецПроцедуры
&НаСервере
Функция ПремияУправления()
// ++ МазинЕС 23-05-24
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Подразделения.ПремияОбщая КАК ПремияОбщая
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Родитель);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
	БУф =  ВыборкаДетальныеЗаписи.ПремияОбщая;
	Возврат БУф;
	КонецЦикла;
	
// -- МазинЕС 23-05-24	
КонецФункции


&НаСервере
Процедура РассчётДохода()
	// ++ Мазин 20-05-24
	//ПолучитьСуммуОкладов(); 
	Объект.Доход = (Константы.ПремиальныйФонд.Получить() * (Объект.ПроценОтВыручки/100)* (Объект.ПроценОтВыручкиОбщий/100)) + Объект.Оклад;
	Объект.Премия = (Константы.ПремиальныйФонд.Получить() * (Объект.ПроценОтВыручки/100)* (Объект.ПроценОтВыручкиОбщий/100));
	Доход = (Константы.ПремиальныйФонд.Получить() * (Объект.ПроценОтВыручки/100)* (Объект.ПроценОтВыручкиОбщий/100)) + Объект.Оклад;   
	
	Если Объект.Родитель.Родитель.Код = "000000105"  Тогда 
		Объект.Доход = (ПремияУправления() * (Объект.ПроценОтВыручки/100)) + Объект.Оклад;
		Объект.Премия = (ПремияУправления() * (Объект.ПроценОтВыручки/100));
		Доход = (ПремияУправления() * (Объект.ПроценОтВыручки/100)) + Объект.Оклад;
	КонецЕсли; 
	
	// -- Мазин 20-05-24
КонецПроцедуры


Процедура ПолучитьСуммуОкладов()
Запрос = новый Запрос();
Запрос.Текст = "ВЫБРАТЬ
|
|	КадровыйПриказ.Сотрудник КАК Сотрудник,
|	МАКСИМУМ(КадровыйПриказ.Дата) КАК ДатаДоговора
|ПОМЕСТИТЬ ВТ_ДолжностиПериод
|ИЗ
|	Документ.КадровыйПриказ КАК КадровыйПриказ
|ГДЕ
|	КадровыйПриказ.Отдел = &Отдел
|СГРУППИРОВАТЬ ПО
|	КадровыйПриказ.Сотрудник
|;
|
|////////////////////////////////////////////////////////////////////////////////
|ВЫБРАТЬ
|	КадровыйПриказ.Отдел КАК Отдел,
|	СУММА(КадровыйПриказ.Оклад) КАК Оклад
|ИЗ
|	Документ.КадровыйПриказ КАК КадровыйПриказ
|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДолжностиПериод КАК ВТ_ДолжностиПериод
|		ПО КадровыйПриказ.Сотрудник = ВТ_ДолжностиПериод.Сотрудник
|		И (ВТ_ДолжностиПериод.ДатаДоговора = КадровыйПриказ.Дата)
|СГРУППИРОВАТЬ ПО
|	КадровыйПриказ.Отдел";
Запрос.УстановитьПараметр("Отдел",Объект.Ссылка );

Выборка = Запрос.Выполнить().Выбрать();

Выборка.Следующий();

Оклад = Выборка.Оклад;


КонецПроцедуры

&НаКлиенте
Процедура ПроценОтВыручкиПриИзменении(Элемент)
		
	РассчётДохода(); 
КонецПроцедуры
 
#КонецОбласти

