
#Область ОбработчикиСобытий

Функция ПолучитьСписокВсехРуководителейgetalldirectorslist(Запрос)
	
	///+ТатарМА 08.11.2024
	ЗапросРуководителей = Новый Запрос;
	ЗапросРуководителей.Текст = "ВЫБРАТЬ
	|	ДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ДолжностиСотрудниковСрезПоследних.Организация КАК Организация,
	|	ДолжностиСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	|	ДолжностиСотрудниковСрезПоследних.Должность КАК Должность,
	|	ДолжностиСотрудниковСрезПоследних.ТипДоговора КАК ТипДоговора,
	|	ДолжностиСотрудниковСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ втДолжности
	|ИЗ
	|	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
	|ГДЕ
	|	НЕ ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь.Недействителен
	|	И НЕ ДолжностиСотрудниковСрезПоследних.Сотрудник.ПометкаУдаления
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Организация,
	|	Подразделение,
	|	Должность,
	|	ТипДоговора,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДолжности.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(втДолжности.Период) КАК Период
	|ПОМЕСТИТЬ втДолжностиПериоды
	|ИЗ
	|	втДолжности КАК втДолжности
	|СГРУППИРОВАТЬ ПО
	|	втДолжности.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник,
	|	Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	втДолжности.Сотрудник КАК Сотрудник,
	|	МИНИМУМ(втДолжности.Организация) КАК Организация,
	|	МИНИМУМ(втДолжности.Подразделение) КАК Подразделение,
	|	МИНИМУМ(втДолжности.Должность) КАК Должность,
	|	МИНИМУМ(втДолжности.ТипДоговора) КАК ТипДоговора,
	|	МИНИМУМ(втДолжности.Подразделение.Код) КАК ПодразделениеКод,
	|	МИНИМУМ(втДолжности.Должность.Код) КАК ДолжностьКод
	|ПОМЕСТИТЬ втДолжностиСотрудников
	|ИЗ
	|	втДолжности КАК втДолжности
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ втДолжностиПериоды КАК втДолжностиПериоды
	|		ПО втДолжности.Сотрудник = втДолжностиПериоды.Сотрудник
	|		И (втДолжностиПериоды.Период = втДолжности.Период)
	|СГРУППИРОВАТЬ ПО
	|	втДолжности.Сотрудник
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КадровыйПриказ.Должность) КАК Должность,
	|	МАКСИМУМ(КадровыйПриказ.Отдел) КАК Отдел,
	|	КадровыйПриказ.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(КадровыйПриказ.Дата) КАК ДатаДоговора
	|ПОМЕСТИТЬ ВТ_ДолжностиНовые
	|ИЗ
	|	Документ.КадровыйПриказ КАК КадровыйПриказ
	|СГРУППИРОВАТЬ ПО
	|	КадровыйПриказ.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	СотрудникиКонтактнаяИнформация.Представление КАК Представление,
	|	СотрудникиКонтактнаяИнформация.Представление КАК ТелефонЛичный
	|ПОМЕСТИТЬ ТелефоныЛичные
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудникаЛичный)
	|	И НЕ СотрудникиКонтактнаяИнформация.Ссылка.Пользователь.Недействителен
	|	И НЕ СотрудникиКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	СотрудникиКонтактнаяИнформация.Представление КАК Представление,
	|	СотрудникиКонтактнаяИнформация.Представление КАК ТелефонСлужебный
	|ПОМЕСТИТЬ ТелефоныСлужебные
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудникаСлужебный)
	|	И НЕ СотрудникиКонтактнаяИнформация.Ссылка.Пользователь.Недействителен
	|	И НЕ СотрудникиКонтактнаяИнформация.Ссылка.ПометкаУдаления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТелефоныЛичные.ТелефонЛичный КАК ТелефонЛичный,
	|	ТелефоныСлужебные.ТелефонСлужебный КАК ТелефонСлужебный,
	|	Сотрудники.Наименование КАК Наименование,
	|	Сотрудники.Код КАК Код,
	|	втДолжностиСотрудников.Организация КАК Организация,
	|	втДолжностиСотрудников.ПодразделениеКод КАК ПодразделениеКод,
	|	втДолжностиСотрудников.Подразделение КАК Подразделение,
	|	втДолжностиСотрудников.ДолжностьКод КАК ДолжностьКод,
	|	втДолжностиСотрудников.Должность КАК Должность,
	|	Сотрудники.ДатаРождения КАК ДатаРождения,
	|	ЕСТЬNULL(втДолжностиСотрудников.Должность,
	|		ЗНАЧЕНИЕ(Справочник.ДолжностиПредприятия.ПустаяСсылка)) <> ЗНАЧЕНИЕ(Справочник.ДолжностиПредприятия.ПустаяСсылка) КАК
	|		Действующий,
	|	Сотрудники.Руководитель КАК Руководитель,
	|	Сотрудники.МестоРаботы КАК МестоРаботы,
	|	Сотрудники.ПарольДляУК КАК ПарольДляУК,
	|	Сотрудники.РолиWT10.(
	|		НомерСтроки КАК НомерСтроки,
	|		Роль КАК Роль) КАК РолиWT10,
	|	Сотрудники.Тележка КАК Тележка,
	|	Сотрудники.Тележка.Код КАК ТележкаКод,
	|	ПодразделенияУчастники.Ссылка.Код КАК КодПодразделения,
	|	Сотрудники.ПарольДляУК КАК ПарольДляУК1
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДолжностиНовые КАК ВТ_ДолжностиНовые
	|		ПО (ВТ_ДолжностиНовые.Сотрудник = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДолжностиСотрудников КАК втДолжностиСотрудников
	|		ПО (втДолжностиСотрудников.Сотрудник = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефоныЛичные КАК ТелефоныЛичные
	|		ПО (ТелефоныЛичные.Ссылка = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефоныСлужебные КАК ТелефоныСлужебные
	|		ПО (ТелефоныСлужебные.Ссылка = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения.Участники КАК ПодразделенияУчастники
	|		ПО (ПодразделенияУчастники.Сотрудник = Сотрудники.Пользователь)
	|ГДЕ
	|	НЕ Сотрудники.Пользователь.Недействителен
	|	И НЕ Сотрудники.ПометкаУдаления
	|	И Сотрудники.РолиWT10.Роль.Код = ""000000007""";
	ВыборкаРуководителей = ЗапросРуководителей.Выполнить().Выбрать();

	МассивРуководителей = Новый массив;

	Пока ВыборкаРуководителей.Следующий() Цикл
		СтруктураРуководителей = Новый Структура;

		СтруктураРуководителей.Вставить("name", Строка(ВыборкаРуководителей.Наименование));
		СтруктураРуководителей.Вставить("code", Строка(ВыборкаРуководителей.Код));

		МассивРуководителей.Добавить(СтруктураРуководителей);
	КонецЦикла;
	СтруктураОтвета = Новый Структура;
	СтруктураОтвета.Вставить("data", МассивРуководителей);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, МассивРуководителей);

	СтрокаДляОтвета = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Возврат Ответ;
	///-ТатарМА 08.11.2024
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти


Функция GetSubDepartamentsGetSubDepartaments(Запрос)
	Попытка
		ОтделКод = Запрос.ПараметрыURL.Получить("id");

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	Подразделения.Родитель.Код КАК ОтделКод,
		|	Подразделения.Родитель.Ссылка КАК Отдел,
		|	Подразделения.Ссылка КАК ПодОтдел,
		|	Подразделения.Код КАК ПодОтделКод
		|ИЗ
		|	Справочник.Подразделения КАК Подразделения
		|ГДЕ
		|	Подразделения.Родитель.Код = &Код
		|	И НЕ Подразделения.ПометкаУдаления";

		Запрос.УстановитьПараметр("Код", Строка(ОтделКод));

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		СтруктураОтделов = Новый Структура;
		МассивПодОтделов = Новый Массив;
		Пока Выборка.Следующий() Цикл
			СтруктураОтделов.Вставить("departament", Строка(Выборка.Отдел));
			СтруктураОтделов.Вставить("id", Строка(Выборка.ОтделКод));
			СтруктураПодОтдела = Новый Структура;
			СтруктураПодОтдела.Вставить("name", Строка(Выборка.ПодОтдел));
			СтруктураПодОтдела.Вставить("id", Строка(Выборка.ПодОтделКод));
			МассивПодОтделов.Добавить(СтруктураПодОтдела);
			СтруктураОтделов.Вставить("sub_departaments", МассивПодОтделов);
		КонецЦикла;

		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();

		ЗаписатьJSON(ЗаписьJSON, СтруктураОтделов);

		СтрокаДляОтвета = ЗаписьJSON.Закрыть();

		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	Исключение
		Инфо = ИнформацияОбОшибке();
		Ответ = Новый HTTPСервисОтвет(500);
		СтрокаОшибки = "" + Инфо.Описание + ?(Инфо.Причина <> Неопределено, Инфо.Причина.Описание, "");
		Ответ.УстановитьТелоИзСтроки("" + СтрокаОшибки);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Возврат Ответ;
	КонецПопытки;
КонецФункции

Функция ПолучитьСотрудниковПодОтделаgetWorkersSubdepartament(Запрос)
	Попытка
		ПодОтделКод = Запрос.ПараметрыURL.Получить("id");

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ПодразделенияУчастники.Сотрудник.Наименование КАК СотрудникНаименование,
		|	Сотрудники.Код КАК КодСотрудника,
		|	ПодразделенияУчастники.Ссылка.Наименование КАК ПодОтдел,
		|	ПодразделенияУчастники.Ссылка.Код КАК ПодОтделКод
		|ИЗ
		|	Справочник.Подразделения.Участники КАК ПодразделенияУчастники
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
		|		ПО (ПодразделенияУчастники.Сотрудник = Сотрудники.Пользователь)
		|ГДЕ
		|	ПодразделенияУчастники.Ссылка.Код = &Код";

		Запрос.УстановитьПараметр("Код", Строка(ПодОтделКод));

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		СтруктураПодОтдела = Новый Структура;
		МассивСотрудников = Новый Массив;
		Пока Выборка.Следующий() Цикл
			СтруктураПодОтдела.Вставить("sub_departament", Строка(Выборка.ПодОтдел));
			СтруктураПодОтдела.Вставить("id", Строка(Выборка.ПодОтделКод));
			Сотрудник = Новый Структура;
			Сотрудник.Вставить("name", Строка(Выборка.СотрудникНаименование));
			Сотрудник.Вставить("id", Строка(Выборка.КодСотрудника));
			МассивСотрудников.Добавить(Сотрудник);
			СтруктураПодОтдела.Вставить("workers", МассивСотрудников);
		КонецЦикла;
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();

		ЗаписатьJSON(ЗаписьJSON, СтруктураПодОтдела);

		СтрокаДляОтвета = ЗаписьJSON.Закрыть();

		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	Исключение
		Инфо = ИнформацияОбОшибке();
		Ответ = Новый HTTPСервисОтвет(500);
		СтрокаОшибки = "" + Инфо.Описание + ?(Инфо.Причина <> Неопределено, Инфо.Причина.Описание, "");
		Ответ.УстановитьТелоИзСтроки("" + СтрокаОшибки);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Возврат Ответ;
	КонецПопытки;
КонецФункции

Функция ПолучитьСписокОтделовПолучитьСписокОтделов(Запрос)
	ЗапросОтделов = Новый Запрос;
	///+ГомзМА 26.03.2024
	ЗапросОтделов.Текст = "     
						  |ВЫБРАТЬ 
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ докЗадача.Номер) КАК Номер,
						  |	докЗадача.Отдел КАК Отдел
						  |ПОМЕСТИТЬ Вт_КолвоЗадач
						  |ИЗ
						  |	Документ.Задача КАК докЗадача
						  |ГДЕ
						  |	докЗадача.Статус В(&Статус)
						  |	И докЗадача.Дата >= ДАТАВРЕМЯ(2024, 1, 1)
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	докЗадача.Отдел
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПодразделенияУчастники.Сотрудник) КАК Сотрудник,
						  |	ПодразделенияУчастники.Ссылка.Родитель КАК Родитель
						  |ПОМЕСТИТЬ ВТ_КолвоСотрудников
						  |ИЗ
						  |	Справочник.Подразделения.Участники КАК ПодразделенияУчастники
						  |
						  |СГРУППИРОВАТЬ ПО
						  |	ПодразделенияУчастники.Ссылка.Родитель
						  |;
						  |
						  |////////////////////////////////////////////////////////////////////////////////
						  |ВЫБРАТЬ
						  |	Подразделения.Ссылка КАК Подразделение,
						  |	Подразделения.Наименование КАК Наименование,
						  |	Подразделения.Код КАК Код,
						  |	ВТ_КолвоСотрудников.Сотрудник КАК КоличествоСотрудников,
						  |	Вт_КолвоЗадач.Номер КАК КоличествоЗадач
						  |ИЗ
						  |	Справочник.Подразделения КАК Подразделения
						  |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолвоСотрудников КАК ВТ_КолвоСотрудников
						  |		ПО Подразделения.Ссылка = ВТ_КолвоСотрудников.Родитель
						  |		ЛЕВОЕ СОЕДИНЕНИЕ Вт_КолвоЗадач КАК Вт_КолвоЗадач
						  |		ПО Подразделения.Ссылка = Вт_КолвоЗадач.Отдел
						  |ГДЕ
						  |	Подразделения.Родитель.Код = ""000000105""";
	///-ГомзМА 26.03.2024

	Статус = Новый массив;
	Статус.Добавить(Перечисления.СтатусыЗадач.ВРаботе);
	Статус.Добавить(Перечисления.СтатусыЗадач.Создана);
	Статус.Добавить(Перечисления.СтатусыЗадач.Отложена);
	ЗапросОтделов.УстановитьПараметр("Статус", Статус);

	Выборка = ЗапросОтделов.Выполнить().Выбрать();
	МассивОтделов = Новый Массив;
	Пока выборка.Следующий() Цикл

		СтруктураОтдела = Новый Структура;
		СтруктураОтдела.Вставить("number_of_persons", Строка(выборка.КоличествоСотрудников));
		СтруктураОтдела.Вставить("number_of_tasks", Строка(выборка.КоличествоЗадач));
		СтруктураОтдела.Вставить("name", Строка(выборка.Наименование));
		СтруктураОтдела.Вставить("id", Строка(выборка.Код));

		МассивОтделов.Добавить(СтруктураОтдела);
		///-ГомзМА 22.03.2024
	КонецЦикла;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, МассивОтделов);

	СтрокаДляОтвета = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Возврат Ответ;
КонецФункции
Функция текстДляСпискаСотрудников()
	Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Задача.Ссылка) КАК КоличествоЗадач,
	|	Задача.Исполнитель КАК Исполнитель
	|ПОМЕСТИТЬ ВТ_Задачи
	|ИЗ
	|	Документ.Задача КАК Задача
	|ГДЕ
	|	(Задача.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыЗадач.Создана)
	|	ИЛИ Задача.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыЗадач.Вработе)
	|	ИЛИ Задача.Статус = ЗНАЧЕНИЕ(перечисление.СтатусыЗадач.Отложена))
	|	И Задача.Дата >= ДАТАВРЕМЯ(2024, 1, 1)
	|СГРУППИРОВАТЬ ПО
	|	Задача.Исполнитель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КадровыйПриказ.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(КадровыйПриказ.Дата) КАК ДатаДоговора
	|ПОМЕСТИТЬ ВТ_ДолжностиДаты
	|ИЗ
	|	Документ.КадровыйПриказ КАК КадровыйПриказ
	|СГРУППИРОВАТЬ ПО
	|	КадровыйПриказ.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(КадровыйПриказ.Должность) КАК Должность,
	|	МАКСИМУМ(КадровыйПриказ.Отдел) КАК Отдел,
	|	КадровыйПриказ.Сотрудник КАК Сотрудник,
	|	МАКСИМУМ(КадровыйПриказ.Дата) КАК ДатаДоговора
	|ПОМЕСТИТЬ ВТ_ДолжностиНовые
	|ИЗ
	|	Документ.КадровыйПриказ КАК КадровыйПриказ
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДолжностиДаты КАК ВТ_ДолжностиДаты
	|		ПО (ВТ_ДолжностиДаты.Сотрудник = КадровыйПриказ.Сотрудник)
	|		И (ВТ_ДолжностиДаты.ДатаДоговора = КадровыйПриказ.Дата)
	|СГРУППИРОВАТЬ ПО
	|	КадровыйПриказ.Сотрудник
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	СотрудникиКонтактнаяИнформация.Представление КАК Представление,
	|	СотрудникиКонтактнаяИнформация.Представление КАК ТелефонЛичный
	|ПОМЕСТИТЬ ТелефоныЛичные
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудникаЛичный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СотрудникиКонтактнаяИнформация.Ссылка КАК Ссылка,
	|	СотрудникиКонтактнаяИнформация.Представление КАК Представление,
	|	СотрудникиКонтактнаяИнформация.Представление КАК ТелефонСлужебный
	|ПОМЕСТИТЬ ТелефоныСлужебные
	|ИЗ
	|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
	|ГДЕ
	|	СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.ТелефонСотрудникаСлужебный)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Сотрудники.Наименование КАК Наименование,
	|	Сотрудники.Код КАК Код,
	|	Сотрудники.Ссылка КАК Ссылка,
	|	Сотрудники.ДатаРождения КАК ДатаРождения,
	|	Сотрудники.Руководитель КАК Руководитель,
	|	Подразделения.Ссылка КАК ОтделНов,
	|	ВТ_ДолжностиНовые.Должность КАК ДолжностьНов,
	|	ТелефоныЛичные.ТелефонЛичный КАК ТелефонЛичный,
	|	ТелефоныСлужебные.ТелефонСлужебный КАК ТелефонСлужебный,
	|	Сотрудники.Пользователь КАК Пользователь,
	|	естьNULL(ВТ_Задачи.КоличествоЗадач, 0) КАК КоличествоЗадач
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_ДолжностиНовые КАК ВТ_ДолжностиНовые
	|		ПО (ВТ_ДолжностиНовые.Сотрудник = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Подразделения КАК Подразделения
	|		ПО (Подразделения.участники.Сотрудник = Сотрудники.Пользователь)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефоныЛичные КАК ТелефоныЛичные
	|		ПО (ТелефоныЛичные.Ссылка = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТелефоныСлужебные КАК ТелефоныСлужебные
	|		ПО (ТелефоныСлужебные.Ссылка = Сотрудники.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Задачи КАК ВТ_Задачи
	|		ПО (ВТ_Задачи.Исполнитель = Сотрудники.Пользователь)
	|ГДЕ
	|	НЕ Сотрудники.Пользователь.Недействителен
	|	И (Подразделения.Ссылка = &ОтделНов
	|	ИЛИ Подразделения.Родитель.Ссылка = &ОтделНов
	|	ИЛИ Подразделения.Родитель.Родитель.Ссылка = &ОтделНов)
	|	И НЕ Сотрудники.ПометкаУдаления
	|
	|УПОРЯДОЧИТЬ ПО
	|	ОтделНов,
	|	Наименование";
	Возврат Текст;

КонецФункции
Функция ПолучитьСписокСотрудниковgetAllWorkersList(Запрос)
	запросСотрудников = Новый Запрос;
	запросСотрудников.Текст =  текстДляСпискаСотрудников();

	запросСотрудников.УстановитьПараметр("ОтделНов", Справочники.Подразделения.НайтиПоНаименованию(
		Запрос.ПараметрыURL["department"]));
	ВыборкаСотрудников = запросСотрудников.Выполнить().Выбрать();
	МассивОтделов	  = Новый массив;
	МассивСотрудников = Новый массив;
	Отдел = Справочники.Подразделения.пустаяСсылка();
	счёт = 0;

	Пока ВыборкаСотрудников.Следующий() Цикл
		СтруктураСотрдников = Новый Структура;
		СтруктураСотрдников.Вставить("name", Строка(ВыборкаСотрудников.Наименование));
		СтруктураСотрдников.Вставить("code", Строка(ВыборкаСотрудников.Код));
		СтруктураСотрдников.Вставить("tasks", ВыборкаСотрудников.КоличествоЗадач);
		
		
		//Если ВыборкаСотрудников.ОтделНов = Отдел Или счёт = 0  Тогда
		МассивСотрудников.Добавить(СтруктураСотрдников);
		//	счёт = 1;
		//Иначе
			
		//	СтруктураОтделов = Новый Структура;
		//	СтруктураОтделов.Вставить("group_name",Строка(Отдел)); 
		//	СтруктураОтделов.Вставить("workers",МассивСотрудников);
		//	МассивСотрудников = новый массив;
		//	МассивОтделов.Добавить(СтруктураОтделов);
		//КонецЕсли;
		//Отдел = ВыборкаСотрудников.ОтделНов;
	КонецЦикла;
			//СтруктураОтделов = Новый Структура;
			//СтруктураОтделов.Вставить("group_name",Строка(Отдел)); 
			//СтруктураОтделов.Вставить("workers",МассивСотрудников);
			//МассивСотрудников = новый массив;
			//МассивОтделов.Добавить(СтруктураОтделов);

	СтруктураОтвета = Новый Структура;
	//СтруктураОтвета.Вставить("info",СтруктураИнфо);
	СтруктураОтвета.Вставить("data", МассивСотрудников);

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, МассивСотрудников);

	СтрокаДляОтвета = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Возврат Ответ;
	
КонецФункции
