
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Проект") Тогда
		Объект.Проект = Параметры.Проект;
	Иначе
		Объект.Проект = Справочники.ПроектыРазвития.ОсновнойПроект;
	КонецЕсли;
	
	ЗаполнитьУчастников();
	
КонецПроцедуры

&НаСервере
Процедура ПриЗакрытииНаСервере(Отказ)
	
	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		Возврат
	КонецЕсли;
	
	Спр = Объект.Проект.ПолучитьОбъект();
	Спр.Участники.Загрузить(Объект.Участники.Выгрузить());
	Попытка
	
		Спр.Записать();
	
	Исключение
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Не удалось записать настройки. %1",
				ОписаниеОшибки()),
			,
			,
			,
			Отказ
		);
			
	КонецПопытки;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЭтаФорма.Модифицированность 
		И НЕ ЗавершениеРаботы Тогда
		
		СтандартнаяОбработка = Ложь;
		ПриЗакрытииНаСервере(Отказ);
		
	КонецЕсли;
	
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ЗаполнитьУчастников()

	Если Не ЗначениеЗаполнено(Объект.Проект) Тогда
		Возврат
	КонецЕсли;
	
	Спр = Объект.Проект.ПолучитьОбъект();
	Объект.Участники.Загрузить(Спр.Участники.Выгрузить());

КонецПроцедуры // ЗаполнитьУчастников()

&НаКлиенте
Процедура УчастникиПриИзменении(Элемент)
	ЭтаФорма.Модифицированность = Истина;
КонецПроцедуры



#КонецОбласти