
&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	//Обновить();
	ОбщЗаданияПоРасп.ДиспетчерЗадач();
КонецПроцедуры

&НаСервере
Процедура Обновить()
    //общЗаданияПоРасп.ДиспетчерЗадач1();
	qq = Новый ЧтениеТекста("d:\n.json", КодировкаТекста.UTF8);
	текст = qq.Прочитать();
	результат = JSONm.дт_ПрочитатьJSON(текст, Истина,Ложь);
	для каждого стр из результат цикл
		//строка = ""+стр.Получить("id")+" "+стр.Получить("oe")+" "++" "+стр.Получить("brand")+" "+;
		//Сообщить(строка);
		бр = НайтиБренд(стр.Получить("brand"));
		
		сс = Справочники.Номенклатура.НайтиПоКоду(Формат(Число(стр.Получить("id")), "ЧЦ=9; ЧВН=; ЧГ=0"));
		Если сс.Пустая() Тогда
			Сообщить("нету "+стр.Получить("id"));
			прервать;
		КонецЕсли;
		//Сообщить("есть "+стр.Получить("id")+" "+об.Код);
		об = сс.ПолучитьОбъект();
		нс = об.НомераЗамен.Добавить();
		нс.наименование = стр.Получить("name");
		нс.НомерЗамены = стр.Получить("vend_oe");
		нс.Производитель = бр;
		об.Записать();
	конеццикла;
КонецПроцедуры

&НаСервере
Функция НайтиБренд(строка)
	бр = Справочники.Бренд.НайтиПоНаименованию(строка);
	Если бр.Пустая() Тогда
		об = Справочники.Бренд.СоздатьЭлемент();
		об.Наименование = строка;
		об.Записать();
		бр = об.Ссылка;
	КонецЕсли;
	Возврат бр;
КонецФункции;
