
&НаКлиенте
Процедура НачатьПоиск(Команда)
	// Вставить содержимое обработчика.
	Фильтр(Поиск);
КонецПроцедуры

&НаСервере
Функция Фильтр(Поиск) Экспорт
	RegExp = Новый COMОбъект("VBScript.RegExp");
         
	RegExp.IgnoreCase = Ложь; //Игнорировать регистр
	RegExp.Global = Истина; //Поиск всех вхождений шаблона
	RegExp.MultiLine = Истина; //Многострочный режим
			
	RegExp.Pattern = "\W";
	RegExp.Pattern = "[^a-zA-Zа-яА-Я_0-9]";
	стр1=RegExp.Replace( Поиск,"");
	Текст1 = "ВЫБРАТЬ
	                      |	ПродажаЗапчастей.Номер,
	                      |	ПродажаЗапчастей.Дата,
	                      |	ПродажаЗапчастей.Клиент,
						  | ПродажаЗапчастей.Ссылка,
	                      |	ПродажаЗапчастей.Таблица.(
	                      |		Ссылка,
	                      |		НомерСтроки,
	                      |		Товар,
	                      |		Количество,
	                      |		Цена,
	                      |		Скидка,
	                      |		машина,
	                      |		цена1,
	                      |		Комментарий
	                      |	)
	                      |ИЗ
	                      |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей" + " ГДЕ ПродажаЗапчастей.Клиент.ФИО ПОДОБНО ""%"+Поиск+"%"" ИЛИ ПродажаЗапчастей.Клиент.Наименование ПОДОБНО ""%"+Поиск+"%"" ИЛИ ПродажаЗапчастей.Таблица.Товар.Артикул ПОДОБНО """+Поиск+""" ИЛИ ПродажаЗапчастей.Таблица.Товар.Наименование ПОДОБНО ""%"+Поиск+"%"" ИЛИ ПродажаЗапчастей.Таблица.Товар.АртикулПоиск ПОДОБНО """+стр1+""" ИЛИ ПродажаЗапчастей.Таблица.Товар.Код ПОДОБНО ""%"+Поиск+""" ИЛИ ПродажаЗапчастей.Таблица.Товар.НомерПроизводителя ПОДОБНО """+Поиск+""" ИЛИ ПродажаЗапчастей.Таблица.Товар.НомерПоиск ПОДОБНО """+стр1+"""";
	Список.ТекстЗапроса = Текст1;    
КонецФункции


&НаКлиенте
Процедура Очистить(Команда)
	Очищение();
	КонецПроцедуры

&НаСервере
Функция Очищение() Экспорт
	Список.ТекстЗапроса = "ВЫБРАТЬ
	                      |	ПродажаЗапчастей.Номер,
	                      |	ПродажаЗапчастей.Дата,
	                      |	ПродажаЗапчастей.Клиент,
						  | ПродажаЗапчастей.Ссылка,
	                      |	ПродажаЗапчастей.Таблица.(
	                      |		Ссылка,
	                      |		НомерСтроки,
	                      |		Товар,
	                      |		Количество,
	                      |		Цена,
	                      |		Скидка,
	                      |		машина,
	                      |		цена1,
	                      |		Комментарий
	                      |	)
	                      |ИЗ
	                      |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей";

КонецФункции

&НаКлиенте
Процедура ОткрытьПродажу(Команда)
	// Вставить содержимое обработчика. 
	Элементы.Таблица1.ТекущиеДанные.Ссылка.ПолучитьФорму().ОткрытьМодально();;
КонецПроцедуры


