Перем НачалоНедили;

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ОбновлениеСписков(ТекущаяДата()); 
	Период = ТекущаяДата(); 
КонецПроцедуры

&НаСервере 
Процедура ОбновлениеСписков(НачалоНедили)	
	
	МассивСчетов = Новый Массив;
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000039"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000010"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000014"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000025"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000029"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000032"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000009"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000040"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000046"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000001"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000005"));
	МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000038"));
		
	СписокСчета.Параметры.УстановитьЗначениеПараметра	("МассивСчетов",МассивСчетов);
	СписокСчета.Параметры.УстановитьЗначениеПараметра	("Период",НачалоНедили);
	ДатаКалендаря = НачалоНедили; 
	СписокСчета1.Параметры.УстановитьЗначениеПараметра	("МассивСчетов",МассивСчетов);
	СписокСчета1.Параметры.УстановитьЗначениеПараметра	("Период",НачалоНедили + 86401 );
	ДатаКалендаря1 = НачалоНедили + 86401; 
	СписокСчета2.Параметры.УстановитьЗначениеПараметра	("МассивСчетов",МассивСчетов);
	СписокСчета2.Параметры.УстановитьЗначениеПараметра	("Период",НачалоНедили + 86401*2);
	ДатаКалендаря2 = НачалоНедили + 86401*2; 
	СписокСчета3.Параметры.УстановитьЗначениеПараметра	("МассивСчетов",МассивСчетов);
	СписокСчета3.Параметры.УстановитьЗначениеПараметра	("Период",НачалоНедили + 86401*3);
	ДатаКалендаря3 = НачалоНедили + 86401*3; 
	СписокСчета4.Параметры.УстановитьЗначениеПараметра	("МассивСчетов",МассивСчетов);
	СписокСчета4.Параметры.УстановитьЗначениеПараметра	("Период",НачалоНедили + 86401*4);
	ДатаКалендаря4 = НачалоНедили + 86401*4; 
		
конецПроцедуры
&НаКлиенте
Процедура РасчедДнейНедели()  
	НачалоНедили = НачалоНедели(Период); 
	ОбновлениеСписков(НачалоНедили);
КонецПроцедуры 
&НаКлиенте
Процедура Обновить(Команда)
	РасчедДнейНедели();  	
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	РасчедДнейНедели();  		
КонецПроцедуры
