&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000003"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000010"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000011"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000013"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000014"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000015"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000023"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000025"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000039"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000042"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000043"));

		
		СписокСчета.Параметры.УстановитьЗначениеПараметра	("МассивСчетов",МассивСчетов);
		
КонецПроцедуры