&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
		ОбновлениеСписков(); 
	
КонецПроцедуры

&НаСервере 
Процедура ОбновлениеСписков()

		МассивСчетов = Новый Массив;
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000039"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000010"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000014"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000025"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000029"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000032"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000009"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000040"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000046"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000001"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000005"));
		МассивСчетов.Добавить(Справочники.Счета.НайтиПоКоду("000000038"));

		СписокСчета.Параметры.УстановитьЗначениеПараметра	("МассивСчетов",МассивСчетов);
		СписокСчета.Параметры.УстановитьЗначениеПараметра	("Период",Период);

	
конецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ОбновлениеСписков(); 		
	
КонецПроцедуры
