
&НаКлиенте
Процедура Нач(Команда)
	Нач1();
КонецПроцедуры

&НаСервере
Процедура Нач1()
	Выборка = Справочники.Номенклатура.Выбрать(,,,)	;
	RegExp = Новый COMОбъект("VBScript.RegExp");
         
	RegExp.IgnoreCase = Ложь; //Игнорировать регистр
	RegExp.Global = Истина; //Поиск всех вхождений шаблона
	RegExp.MultiLine = Истина; //Многострочный режим
			
	RegExp.Pattern = "[^a-zA-Zа-яА-Я_0-9 ]";
	Пока Выборка.Следующий()  Цикл
    	Объект11 = Выборка.ПолучитьОбъект();
        Объект11.АртикулПоиск = RegExp.Replace( Объект11.Артикул,"");
		Объект11.Записать();
	КонецЦикла;
	
КонецПроцедуры
