Функция СоздатьНовогоучастникаАкции(Имя,НомерТелефона) ЭКСПОРТ 
	
	Если (НЕ ЗначениеЗаполнено(Имя)) Или (НЕ ЗначениеЗаполнено(НомерТелефона)) Тогда 
		возврат Неопределено; 
	КонецЕсли; 
	
	НомерТелефона = "+7" + " " + Сред(НомерТелефона, 3, 1) + Сред(НомерТелефона, 4, 1) + Сред(НомерТелефона, 5, 1) + " " + Сред(НомерТелефона, 6, 1) + Сред(НомерТелефона, 7, 1) + Сред(НомерТелефона, 8, 1) + "-" + Сред(НомерТелефона, 9, 1) + Сред(НомерТелефона, 10, 1) + "-" + Сред(НомерТелефона, 11, 1) + Сред(НомерТелефона, 12, 1);
	
	Структура = Новый Структура("ДобавленУчастник","Сообщение");
	
	//==================================================================================================================
	// проверка уникальности номера телефона
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчастникиАкции10.Код
		|ИЗ
		|	Справочник.УчастникиАкции10 КАК УчастникиАкции10
		|ГДЕ
		|	УчастникиАкции10.НомерТелефона = &НомерТелефона
		|	И УчастникиАкции10.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Структура.Вставить("ДобавленУчастник",Ложь); 
		Структура.Вставить("Сообщение","Пользователь с таким номером уже участвует в акции");
		
		Возврат Структура;  
	КонецЕсли; 
	//==================================================================================================================
	

	
	НовыйУчастник 				= Справочники.УчастникиАкции10.СоздатьЭлемент(); 
	НовыйУчастник.Наименование 	= Имя; 

	НовыйУчастник.НомерТелефона = НомерТелефона;
	НовыйУчастник.ДатаРегистрации = ТекущаяДатаСеанса(); 
	НовыйУчастник.Записать();
	
	ЗаявкаУчастника 					= Документы.ЗаказКлиента.СоздатьДокумент(); 
	ЗаявкаУчастника.Дата 				= ТекущаяДатаСеанса();
	ЗаявкаУчастника.Клиент 				= НовыйУчастник.Ссылка; 

	ЗаявкаУчастника.НомерТелефона 		= НомерТелефона;
	ЗаявкаУчастника.УчаствуетВАкции10 	= истина; 
	ЗаявкаУчастника.Ответственный		= НайтиОтветственногоЗаКлиента(НомерТелефона);
	ЗаявкаУчастника.Состояние			= перечисления.дт_СостоянияЗаказовКлиента.ВРаботе;
	ЗаявкаУчастника.Целевая				= Истина; 
	ЗаявкаУчастника.Записать();
	
	Структура.Вставить("ДобавленУчастник",истина); 
	Структура.Вставить("Сообщение","Вы успешно зарегистрировались в акции");
	
	Возврат Структура; 
	
КонецФункции


Функция КоличествоУчастникаАкции() ЭКСПОРТ 

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(УчастникиАкции10.Код) КАК КоличествоКод
		|ИЗ
		|	Справочник.УчастникиАкции10 КАК УчастникиАкции10
		|ГДЕ
		|	УчастникиАкции10.ПометкаУдаления = ЛОЖЬ";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Строка(Выборка.КоличествоКод);  
	иначе 
		Возврат "0";
	КонецЕсли;
	

КонецФункции

Функция НайтиОтветственногоЗаКлиента(Знач НомерТелефона)

	Результат = Справочники.Пользователи.ПустаяСсылка();

	Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Клиенты.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.ПометкаУдаления
	|	И (Клиенты.Телефон = &НомерТелефона
	|	ИЛИ Клиенты.ДополнительныеКонтакты.Телефон = &НомерТелефона)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиенты.Код УБЫВ";

	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ответственный;
	Иначе 
		Возврат Результат; 	
	КонецЕсли;

КонецФункции










