&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	ТабДок = Новый ТабличныйДокумент;
	Печать(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.АвтоМасштаб = Истина;
	//ТабДок.ЭкземпляровНаСтранице = 18;
	ТабДок.ДвусторонняяПечать = ТипДвустороннейПечати.Нет;
	
	//ТабДок.Показать();
	КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Ценник");
 // Добавляем в коллекцию (тип массив) сформированный Табличный документ
	КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
 // если требуется устанавливаем параметры печати
	КоллекцияПечатныхФорм[0].СинонимМакета = "Ценник";  // используется для формирования имени файла при сохранении из общей формы печати документов
 // .. и выводим стандартной процедурой БСП
	УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, Неопределено);
КонецПроцедуры

&НаСервере
Процедура Печать(ТабДок, ПараметрКоманды)
	Справочники.Номенклатура.ПечатьЦенника(ТабДок, ПараметрКоманды);
КонецПроцедуры