
&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
		
КонецПроцедуры

&НаКлиенте
Процедура допкатПередУдалением(Элемент, Отказ)
  УдалитьДопкат(Элемент.ТекущиеДанные.ДопКатегория);	
КонецПроцедуры

&НаСервере
Процедура УдалитьДопкат(ссыл)
	
	Для Каждого стр из Объект.допкат Цикл
		Для Каждого стр2 Из стр.ДопКатегория.допкат Цикл
			Если стр2.ДопКатегория = ссыл Тогда
				об = стр.ДопКатегория.ПолучитьОбъект();
				Для Каждого стр3 из об.допкат Цикл
					Если стр3.ДопКатегория = стр2.ДопКатегория Тогда
						об.допкат.Удалить(стр3);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				
				об.Записать();
			КонецЕсли;
			Если ссыл = стр.ДопКатегория И стр2.ДопКатегория = Объект.Ссылка Тогда
				об = стр.ДопКатегория.ПолучитьОбъект();
				Для Каждого стр3 из об.допкат Цикл
					Если стр3.ДопКатегория = стр2.ДопКатегория Тогда
						об.допкат.Удалить(стр3);
						Прервать;
					КонецЕсли;
				КонецЦикла;
				об.Записать();
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
	обновитьКат();
	ЭтаФорма.Прочитать();
КонецПроцедуры

&НаСервере
Процедура обновитьКат()
	о = Объект.Ссылка.ПолучитьОбъект();
	категории = Новый Массив;
	категории.Добавить(о.Код);
	Для Каждого стр Из о.допкат Цикл
		Если категории.Найти(стр.ДопКатегория.Код) = Неопределено Тогда
			категории.Добавить(стр.ДопКатегория.Код);
		КонецЕсли;
		Для Каждого стр2 Из стр.ДопКатегория.допкат Цикл
			Если категории.Найти(стр2.ДопКатегория.Код) = Неопределено Тогда
				категории.Добавить(стр2.ДопКатегория.Код);
			КонецЕсли
		КонецЦикла;
	КонецЦикла;
	Для Каждого кд Из категории Цикл
		
		Если кд = о.Код Тогда
			об = о;
		Иначе
			об = Справочники.Категории.НайтиПоКоду(кд).ПолучитьОбъект();
		КонецЕсли;
		
		Для Каждого кд2 Из категории Цикл
			Если кд2 <> об.Код Тогда
				найдено = ложь;
				Для Каждого стр Из об.допкат Цикл
					Если стр.ДопКатегория.Код = кд2 Тогда
						найдено = Истина;
						Прервать;
					КонецЕсли;
				КонецЦикла;
				Если найдено = Ложь Тогда
					об2 = Справочники.Категории.НайтиПоКоду(кд2);
					стртаб = об.допкат.Добавить();
					стртаб.ДопКатегория = об2;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
		Если кд <> объект.Код Тогда
			об.Записать();
		КонецЕсли;
	КонецЦикла;
	о.Записать();
КонецПроцедуры

&НаКлиенте
Процедура допкат2ПриИзменении(Элемент)
	ид = Новый УникальныйИдентификатор;
	ид2 = Новый УникальныйИдентификатор("00000000-0000-0000-0000-000000000000");
	Если Элемент.ТекущиеДанные.код = ид2 Тогда
		Элемент.ТекущиеДанные.код = ид;
	КонецЕсли;
КонецПроцедуры
