
Функция ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад) Экспорт
	
	///+ГомзМА 05.04.2023
	Результат = Ложь;
	Граница = Новый Граница(Дата, ВидГраницы.Включая);
	
	Если ТипЗнч(Ссылка) = Тип("ДокументСсылка.СписаниеТМЦВорктрак") Тогда
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеТМЦВорктракОстатки.ТМЦ КАК ТМЦ,
		|	ДвижениеТМЦВорктракОстатки.МестоХранения КАК МестоХранения,
		|	ДвижениеТМЦВорктракОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦВорктрак.Остатки(
		|			&Дата,
		|			МестоХранения = &Склад
		|				И (ТМЦ, ИнвентарныйНомер) В
		|					(ВЫБРАТЬ
		|						СписаниеТМЦВорктракСписокТМЦ.ТМЦ КАК ТМЦ,
		|						СписаниеТМЦВорктракСписокТМЦ.ИнвентарныйНомер КАК ИнвентарныйНомер
		|					ИЗ
		|						Документ.СписаниеТМЦВорктрак.СписокТМЦ КАК СписаниеТМЦВорктракСписокТМЦ
		|					ГДЕ
		|						СписаниеТМЦВорктракСписокТМЦ.Ссылка.Ссылка = &Ссылка)) КАК ДвижениеТМЦВорктракОстатки
		|ГДЕ
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток < 0";
	
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПеремещениеТМЦВорктрак") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеТМЦВорктракОстатки.ТМЦ КАК ТМЦ,
		|	ДвижениеТМЦВорктракОстатки.МестоХранения КАК МестоХранения,
		|	ДвижениеТМЦВорктракОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦВорктрак.Остатки(
		|			&Дата,
		|			МестоХранения = &Склад
		|				И (ТМЦ, ИнвентарныйНомер) В
		|					(ВЫБРАТЬ
		|						ПеремещениеТМЦВорктракСписокТМЦ.ТМЦ КАК ТМЦ,
		|						ПеремещениеТМЦВорктракСписокТМЦ.ИнвентарныйНомер КАК ИнвентарныйНомер
		|					ИЗ
		|						Документ.ПеремещениеТМЦВорктрак.СписокТМЦ КАК ПеремещениеТМЦВорктракСписокТМЦ
		|					ГДЕ
		|						ПеремещениеТМЦВорктракСписокТМЦ.Ссылка.Ссылка = &Ссылка)) КАК ДвижениеТМЦВорктракОстатки
		|ГДЕ
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток < 0";
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ЗаказНаряд") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеТМЦВорктракОстатки.ТМЦ КАК ТМЦ,
		|	ДвижениеТМЦВорктракОстатки.МестоХранения КАК МестоХранения,
		|	ДвижениеТМЦВорктракОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦВорктрак.Остатки(
		|			&Дата,
		|			МестоХранения = &Склад
		|				И (ТМЦ, ИнвентарныйНомер) В
		|					(ВЫБРАТЬ
		|						ЗаказНарядТМЦ.ТМЦ КАК ТМЦ,
		|						ЗаказНарядТМЦ.ИнвентарныйНомер КАК ИнвентарныйНомер
		|					ИЗ
		|						Документ.ЗаказНаряд.ТМЦ КАК ЗаказНарядТМЦ
		|					ГДЕ
		|						ЗаказНарядТМЦ.Ссылка.Ссылка = &Ссылка)) КАК ДвижениеТМЦСкладСнабжениеОстатки
		|ГДЕ
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток < 0";
		
	ИначеЕсли ТипЗнч(Ссылка) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ДвижениеТМЦВорктракОстатки.ТМЦ КАК ТМЦ,
		|	ДвижениеТМЦВорктракОстатки.МестоХранения КАК МестоХранения,
		|	ДвижениеТМЦВорктракОстатки.ИнвентарныйНомер КАК ИнвентарныйНомер,
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ДвижениеТМЦВорктрак.Остатки(
		|			&Дата,
		|			МестоХранения = &Склад
		|				И (ТМЦ, ИнвентарныйНомер) В
		|					(ВЫБРАТЬ
		|						ПродажаЗапчастей.ТМЦ КАК ТМЦ,
		|						ПродажаЗапчастей.ИнвентарныйНомер КАК ИнвентарныйНомер
		|					ИЗ
		|						Документ.ПродажаЗапчастей.ТМЦ КАК ПродажаЗапчастей
		|					ГДЕ
		|						ПродажаЗапчастей.Ссылка.Ссылка = &Ссылка)) КАК ДвижениеТМЦВорктракОстатки
		|ГДЕ
		|	ДвижениеТМЦВорктракОстатки.КоличествоОстаток < 0";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Дата", 		Граница);
	Запрос.УстановитьПараметр("Ссылка", 	Ссылка);
	Запрос.УстановитьПараметр("Склад", 		Склад);

	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			//Если ТипЗнч(Склад.ВидСписания) = Перечисления.ВидыСписания. Тогда
			//	СтрокаВывода = СтрШаблон("Не хватает товара %1 на складе: ""%2"", в количестве %3", 	Выборка.ТМЦ, Выборка.МестоХранения, -Выборка.КоличествоОстаток);
			//	Сообщить(СтрокаВывода);
			Если ТипЗнч(Склад.ВидСписания) = Перечисления.ВидыСписания.Сотруднику Тогда
				СтрокаВывода = СтрШаблон("Не хватает товара %1 у сотрудника: ""%2"", в количестве %3", 	Выборка.ТМЦ, Выборка.МестоХранения, -Выборка.КоличествоОстаток);
				Сообщить(СтрокаВывода);
			ИначеЕсли ТипЗнч(Склад.ВидСписания) = Перечисления.ВидыСписания.ВОтдел Тогда
				СтрокаВывода = СтрШаблон("Не хватает товара %1 в отделе: ""%2"", в количестве %3", 		Выборка.ТМЦ, Выборка.МестоХранения, -Выборка.КоличествоОстаток);
				Сообщить(СтрокаВывода);
			Иначе
				СтрокаВывода = СтрШаблон("Не хватает товара %1 на складе: ""%2"", в количестве %3", 	Выборка.ТМЦ, Выборка.МестоХранения, -Выборка.КоличествоОстаток);
				Сообщить(СтрокаВывода);
				//СтрокаВывода = СтрШаблон("Отсутствует товар %1, в количестве %2", 					Выборка.ТМЦ, -Выборка.КоличествоОстаток);
				//Сообщить(СтрокаВывода);
			КонецЕсли;
		КонецЦикла;
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	///-ГомзМА 05.04.2023 
	
КонецФункции //ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад)