// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
Процедура ПриДобавленииОбработчиковУстановкиПараметровСеанса(Обработчики) Экспорт
	
	Обработчики.Вставить("ТекущееПодразделение",        "дт_ПраваДоступа.УстановкаПараметровСеанса");
	
КонецПроцедуры


// См. ОбщегоНазначенияПереопределяемый.ПриДобавленииОбработчиковУстановкиПараметровСеанса.
Процедура УстановкаПараметровСеанса(Знач ИмяПараметра, УстановленныеПараметры = Неопределено) Экспорт
	
	Если ИмяПараметра <> "ТекущееПодразделение" Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если УстановленныеПараметры = Неопределено Тогда
		УстановленныеПараметры = Новый Массив();
	КонецЕсли;
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если ЗначениеЗаполнено(ТекущийПользователь) Тогда
		ПараметрыСеанса.ТекущееПодразделение        = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТекущийПользователь, "Подразделение");
	Иначе
		ПараметрыСеанса.ТекущееПодразделение = Неопределено;
	КонецЕсли;
	
	УстановленныеПараметры.Добавить("ТекущееПодразделение");
	
КонецПроцедуры

Функция ТекущееПодразделение() Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Возврат ПараметрыСеанса.ТекущееПодразделение;
	
КонецФункции // ТекущееПодразделение()
