&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокНоменклатурыКоэффицентПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВсеГода = 1;
	Элементы.Год.СписокВыбора.ЗагрузитьЗначения(СформироватьСвойМассивЗначений());
КонецПроцедуры

&НаКлиенте
Процедура ГодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	/// Комлев АА 14/11/24 +++
	СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.ЗагрузитьЗначения(СформироватьСвойМассивЗначений());
	/// Комлев АА 14/11/24 ---
КонецПроцедуры

Функция СформироватьСвойМассивЗначений()
	/// Комлев АА 14/11/24 +++
	МассивГодов = Новый Массив;
	МассивГодов.Добавить(Дата(Год(ТекущаяДата()), 1, 1));
	Индекс = 7;
	ТекДата = ТекущаяДата();
	Пока Индекс <> 0 Цикл
		ТекДата =  ДобавитьМесяц(ТекДата, -12);
		МассивГодов.Добавить(Дата(Год(ТекДата), 1, 1));
		Индекс = Индекс - 1;
	КонецЦикла;
	Возврат МассивГодов;
	/// Комлев АА 14/11/24 ---
КонецФункции

&НаКлиенте
Процедура ГодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Год = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ВсеГода = 2;
	КоэффицентПоГоду();
КонецПроцедуры

Процедура КоэффицентПоГоду()
	Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МЕСЯЦ(ЗаказКлиентаТовары.Ссылка.Дата)) КАК КоличествоМесяцев,
	|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
	|		МЕСЯЦ(ЗаказКлиентаТовары.Ссылка.Дата)) КАК ЧИСЛО(10, 2)) КАК Коэффицент
	|ПОМЕСТИТЬ ТоварыИзЗаявокСКоэфф
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, Год) = НачалоПериода(&Дата, Год)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Товар,
	|	ЕстьNULL(ТоварыИзЗаявокСКоэфф.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
	|	ЕстьNULL(ТоварыИзЗаявокСКоэфф.КоличествоМесяцев, 0) КАК КоличествоМесяцев,
	|	ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) КАК Коэффицент,
	|	ВЫБОР
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) = 0
	|			ТОГДА ""Новый или Мусор""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 0
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 5
	|			ТОГДА ""Категория 4""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 5
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 10
	|			ТОГДА ""Категория 3""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 10
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 15
	|			ТОГДА ""Категория 2""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 15
	|			ТОГДА ""Высокий спрос""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявокСКоэфф КАК ТоварыИзЗаявокСКоэфф
	|		ПО (ТоварыИзЗаявокСКоэфф.Номенклатура = СпрНоменклатура.Ссылка)";
	
	
	ТекстСГруппировкой = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МЕСЯЦ(ЗаказКлиентаТовары.Ссылка.Дата)) КАК КоличествоМесяцев,
	|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
	|		МЕСЯЦ(ЗаказКлиентаТовары.Ссылка.Дата)) КАК ЧИСЛО(10, 2)) КАК Коэффицент
	|ПОМЕСТИТЬ ТоварыИзЗаявокСКоэфф
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, Год) = НачалоПериода(&Дата, Год)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СпрНоменклатура.Ссылка) КАК КоличествоТоваровВКатегории,
	|	ВЫБОР
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) = 0
	|			ТОГДА ""Новый или Мусор""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 0
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 5
	|			ТОГДА ""Категория 4""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 5
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 10
	|			ТОГДА ""Категория 3""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 10
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 15
	|			ТОГДА ""Категория 2""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 15
	|			ТОГДА ""Высокий спрос""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявокСКоэфф КАК ТоварыИзЗаявокСКоэфф
	|		ПО (ТоварыИзЗаявокСКоэфф.Номенклатура = СпрНоменклатура.Ссылка)
	|Сгруппировать По
	|	ВЫБОР
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) = 0
	|			ТОГДА ""Новый или Мусор""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 0
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 5
	|			ТОГДА ""Категория 4""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 5
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 10
	|			ТОГДА ""Категория 3""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 10
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 15
	|			ТОГДА ""Категория 2""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 15
	|			ТОГДА ""Высокий спрос""
	|	КОНЕЦ";
	
	СписокНоменклатурыКоэффицент.ПроизвольныйЗапрос = Истина;
	СписокНоменклатурыКоэффицент.ТекстЗапроса = Текст;
	СписокНоменклатурыКоэффицент.Параметры.УстановитьЗначениеПараметра("Дата", Год);
	
	КоличествоТоваровВКатегрии.ПроизвольныйЗапрос = Истина;
	КоличествоТоваровВКатегрии.ТекстЗапроса = ТекстСГруппировкой;
	КоличествоТоваровВКатегрии.Параметры.УстановитьЗначениеПараметра("Дата", Год);
	
	Элементы.СписокНоменклатурыКоэффицент.Обновить();
	Элементы.КоличествоТоваровВКатегрии.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВсеГодаПриИзменении(Элемент)
	Год = Дата(1, 1, 1);
	Если ВсеГода = 1 Тогда
		ТекстЗапросаВсеКоэффВсеГода();
	КонецЕсли;
КонецПроцедуры

Процедура ТекстЗапросаВсеКоэффВсеГода()
	Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МЕСЯЦ(ЗаказКлиентаТовары.Ссылка.Дата)) КАК КоличествоМесяцев,
	|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
	|		МЕСЯЦ(ЗаказКлиентаТовары.Ссылка.Дата)) КАК ЧИСЛО(10, 2)) КАК Коэффицент
	|ПОМЕСТИТЬ ТоварыИзЗаявокСКоэфф
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Товар,
	|	ЕстьNULL(ТоварыИзЗаявокСКоэфф.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
	|	ЕстьNULL(ТоварыИзЗаявокСКоэфф.КоличествоМесяцев, 0) КАК КоличествоМесяцев,
	|	ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) КАК Коэффицент,
	|	ВЫБОР
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) = 0
	|			ТОГДА ""Новый или Мусор""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 0
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 5
	|			ТОГДА ""Категория 4""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 5
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 10
	|			ТОГДА ""Категория 3""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 10
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 15
	|			ТОГДА ""Категория 2""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 15
	|			ТОГДА ""Высокий спрос""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявокСКоэфф КАК ТоварыИзЗаявокСКоэфф
	|		ПО (ТоварыИзЗаявокСКоэфф.Номенклатура = СпрНоменклатура.Ссылка)";
	
	ТекстСГруппировкой = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ МЕСЯЦ(ЗаказКлиентаТовары.Ссылка.Дата)) КАК КоличествоМесяцев,
	|	ВЫРАЗИТЬ(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) / КОЛИЧЕСТВО(РАЗЛИЧНЫЕ
	|		МЕСЯЦ(ЗаказКлиентаТовары.Ссылка.Дата)) КАК ЧИСЛО(10, 2)) КАК Коэффицент
	|ПОМЕСТИТЬ ТоварыИзЗаявокСКоэфф
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(СпрНоменклатура.Ссылка) КАК КоличествоТоваровВКатегории,
	|	ВЫБОР
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) = 0
	|			ТОГДА ""Новый или Мусор""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 0
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 5
	|			ТОГДА ""Категория 4""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 5
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 10
	|			ТОГДА ""Категория 3""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 10
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 15
	|			ТОГДА ""Категория 2""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 15
	|			ТОГДА ""Высокий спрос""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявокСКоэфф КАК ТоварыИзЗаявокСКоэфф
	|		ПО (ТоварыИзЗаявокСКоэфф.Номенклатура = СпрНоменклатура.Ссылка)
	|Сгруппировать По
	|	ВЫБОР
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) = 0
	|			ТОГДА ""Новый или Мусор""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 0
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 5
	|			ТОГДА ""Категория 4""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 5
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 10
	|			ТОГДА ""Категория 3""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 10
	|		И ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) <= 15
	|			ТОГДА ""Категория 2""
	|		КОГДА ЕстьNULL(ТоварыИзЗаявокСКоэфф.Коэффицент, 0) > 15
	|			ТОГДА ""Высокий спрос""
	|	КОНЕЦ";
	
	
	СписокНоменклатурыКоэффицент.ПроизвольныйЗапрос = Истина;
	СписокНоменклатурыКоэффицент.ТекстЗапроса = Текст;
	
	КоличествоТоваровВКатегрии.ПроизвольныйЗапрос = Истина;
	КоличествоТоваровВКатегрии.ТекстЗапроса = ТекстСГруппировкой;
	
	Элементы.СписокНоменклатурыКоэффицент.Обновить();
	Элементы.КоличествоТоваровВКатегрии.Обновить();
КонецПроцедуры

