
&НаКлиенте
Процедура ПриОткрытии(Отказ)

КонецПроцедуры

&НаСервереБезКонтекста
Процедура СписокНоменклатурыКоэффицентПриПолученииДанныхНаСервере(ИмяЭлемента, Настройки, Строки)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ВсеГода = 1;
	Элементы.Год.СписокВыбора.ЗагрузитьЗначения(СформироватьСвойМассивЗначений());
	ДатаПолгодаНазад = ДобавитьМесяц(ТекущаяДата(), - 6);
	СписокНоменклатурыКоэффицент.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	СписокНоменклатурыКоэффицент.Параметры.УстановитьЗначениеПараметра("ДатаПолгодаНазад", НачалоДня(ДатаПолгодаНазад));
	
	КоличествоТоваровВКатегрии.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	КоличествоТоваровВКатегрии.Параметры.УстановитьЗначениеПараметра("ДатаПолгодаНазад", НачалоДня(ДатаПолгодаНазад));
КонецПроцедуры

&НаКлиенте
Процедура ГодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	/// Комлев АА 14/11/24 +++
	СтандартнаяОбработка = Ложь;
	Элемент.СписокВыбора.ЗагрузитьЗначения(СформироватьСвойМассивЗначений());
	/// Комлев АА 14/11/24 ---
КонецПроцедуры

Функция СформироватьСвойМассивЗначений()
	/// Комлев АА 14/11/24 +++
	МассивГодов = Новый Массив;
	МассивГодов.Добавить(Дата(Год(ТекущаяДата()), 1, 1));
	Индекс = 7;
	ТекДата = ТекущаяДата();
	Пока Индекс <> 0 Цикл
		ТекДата =  ДобавитьМесяц(ТекДата, -12);
		МассивГодов.Добавить(Дата(Год(ТекДата), 1, 1));
		Индекс = Индекс - 1;
	КонецЦикла;
	Возврат МассивГодов;
	/// Комлев АА 14/11/24 ---
КонецФункции

&НаКлиенте
Процедура ГодОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Год = ВыбранноеЗначение;
КонецПроцедуры

&НаКлиенте
Процедура ГодПриИзменении(Элемент)
	ВсеГода = 2;
	КоэффицентПоГоду();
КонецПроцедуры

Процедура КоэффицентПоГоду()
	Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
	|ПОМЕСТИТЬ ТоварыИзЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|	И НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, Год) = НачалоПериода(&Дата, Год)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Товар,
	|	СпрНоменклатура.ДатаСоздания КАК ДатаСоздания,
	|	ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
	|	РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания, &ТекущаяДата, МЕСЯЦ) КАК КоличествоМесяцев,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания, &ТекущаяДата, МЕСЯЦ) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) / РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания,
	|			&ТекущаяДата, МЕСЯЦ) КАК ЧИСЛО(10, 2))
	|	КОНЕЦ КАК Коэффицент
	|ПОМЕСТИТЬ ТоварыСКоэфф
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
	|		ПО (ТоварыИзЗаявок.Номенклатура = СпрНоменклатура.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ТоварыСКоэфф.ДатаСоздания КАК ДатаСоздания,
	|	ТоварыСКоэфф.КоличествоЗаявок КАК КоличествоЗаявок,
	|	ТоварыСКоэфф.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ТоварыСКоэфф.Коэффицент КАК Коэффицент,
	|	ВЫБОР
	|		КОГДА ТоварыСКоэфф.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент = 0
	|			ТОГДА ""Мусор""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0
	|		И ТоварыСКоэфф.Коэффицент <= 0.03
	|			ТОГДА ""Категория 8""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.03
	|		И ТоварыСКоэфф.Коэффицент <= 0.05
	|			ТОГДА ""Категория 7""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.05
	|		И ТоварыСКоэфф.Коэффицент <= 0.09
	|			ТОГДА ""Категория 6""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.09
	|		И ТоварыСКоэфф.Коэффицент <= 0.15
	|			ТОГДА ""Категория 5""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.15
	|		И ТоварыСКоэфф.Коэффицент <= 0.3
	|			ТОГДА ""Категория 4""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.3
	|		И ТоварыСКоэфф.Коэффицент <= 1
	|			ТОГДА ""Категория 3""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1
	|		И ТоварыСКоэфф.Коэффицент <= 1.5
	|			ТОГДА ""Категория 2""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1.5
	|			ТОГДА ""Категория 1""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСКоэфф КАК ТоварыСКоэфф
	|		ПО ТоварыСКоэфф.Товар = Номенклатура.Ссылка";
	
	
	ТекстСГруппировкой = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
	|ПОМЕСТИТЬ ТоварыИзЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|И НАЧАЛОПЕРИОДА(ЗаказКлиентаТовары.Ссылка.Дата, Год) = НачалоПериода(&Дата, Год)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Товар,
	|	СпрНоменклатура.ДатаСоздания КАК ДатаСоздания,
	|	ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
	|	РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания, &ТекущаяДата, МЕСЯЦ) КАК КоличествоМесяцев,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания, &ТекущаяДата, МЕСЯЦ) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) / РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания,
	|			&ТекущаяДата, МЕСЯЦ) КАК ЧИСЛО(10, 2))
	|	КОНЕЦ КАК Коэффицент
	|ПОМЕСТИТЬ ТоварыСКоэфф
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
	|		ПО (ТоварыИзЗаявок.Номенклатура = СпрНоменклатура.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Номенклатура.Ссылка) КАК КоличествоТоваров,
	|	ВЫБОР
	|		КОГДА ТоварыСКоэфф.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент = 0
	|			ТОГДА ""Мусор""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0
	|		И ТоварыСКоэфф.Коэффицент <= 0.03
	|			ТОГДА ""Категория 8""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.03
	|		И ТоварыСКоэфф.Коэффицент <= 0.05
	|			ТОГДА ""Категория 7""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.05
	|		И ТоварыСКоэфф.Коэффицент <= 0.09
	|			ТОГДА ""Категория 6""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.09
	|		И ТоварыСКоэфф.Коэффицент <= 0.15
	|			ТОГДА ""Категория 5""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.15
	|		И ТоварыСКоэфф.Коэффицент <= 0.3
	|			ТОГДА ""Категория 4""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.3
	|		И ТоварыСКоэфф.Коэффицент <= 1
	|			ТОГДА ""Категория 3""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1
	|		И ТоварыСКоэфф.Коэффицент <= 1.5
	|			ТОГДА ""Категория 2""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1.5
	|			ТОГДА ""Категория 1""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСКоэфф КАК ТоварыСКоэфф
	|		ПО ТоварыСКоэфф.Товар = Номенклатура.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТоварыСКоэфф.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент = 0
	|			ТОГДА ""Мусор""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0
	|		И ТоварыСКоэфф.Коэффицент <= 0.03
	|			ТОГДА ""Категория 8""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.03
	|		И ТоварыСКоэфф.Коэффицент <= 0.05
	|			ТОГДА ""Категория 7""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.05
	|		И ТоварыСКоэфф.Коэффицент <= 0.09
	|			ТОГДА ""Категория 6""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.09
	|		И ТоварыСКоэфф.Коэффицент <= 0.15
	|			ТОГДА ""Категория 5""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.15
	|		И ТоварыСКоэфф.Коэффицент <= 0.3
	|			ТОГДА ""Категория 4""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.3
	|		И ТоварыСКоэфф.Коэффицент <= 1
	|			ТОГДА ""Категория 3""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1
	|		И ТоварыСКоэфф.Коэффицент <= 1.5
	|			ТОГДА ""Категория 2""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1.5
	|			ТОГДА ""Категория 1""
	|	КОНЕЦ";
	
	СписокНоменклатурыКоэффицент.ПроизвольныйЗапрос = Истина;
	СписокНоменклатурыКоэффицент.ТекстЗапроса = Текст;
	СписокНоменклатурыКоэффицент.Параметры.УстановитьЗначениеПараметра("Дата", Год);
	
	КоличествоТоваровВКатегрии.ПроизвольныйЗапрос = Истина;
	КоличествоТоваровВКатегрии.ТекстЗапроса = ТекстСГруппировкой;
	КоличествоТоваровВКатегрии.Параметры.УстановитьЗначениеПараметра("Дата", Год);
	
	Элементы.СписокНоменклатурыКоэффицент.Обновить();
	Элементы.КоличествоТоваровВКатегрии.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура ВсеГодаПриИзменении(Элемент)
	Год = Дата(1, 1, 1);
	Если ВсеГода = 1 Тогда
		ТекстЗапросаВсеКоэффВсеГода();
	КонецЕсли;
КонецПроцедуры

Процедура ТекстЗапросаВсеКоэффВсеГода()
	Текст = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
	|ПОМЕСТИТЬ ТоварыИзЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Товар,
	|	СпрНоменклатура.ДатаСоздания КАК ДатаСоздания,
	|	ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
	|	РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания, &ТекущаяДата, МЕСЯЦ) КАК КоличествоМесяцев,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания, &ТекущаяДата, МЕСЯЦ) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) / РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания,
	|			&ТекущаяДата, МЕСЯЦ) КАК ЧИСЛО(10, 2))
	|	КОНЕЦ КАК Коэффицент
	|ПОМЕСТИТЬ ТоварыСКоэфф
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
	|		ПО (ТоварыИзЗаявок.Номенклатура = СпрНоменклатура.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Номенклатура.Ссылка КАК Товар,
	|	ТоварыСКоэфф.ДатаСоздания КАК ДатаСоздания,
	|	ТоварыСКоэфф.КоличествоЗаявок КАК КоличествоЗаявок,
	|	ТоварыСКоэфф.КоличествоМесяцев КАК КоличествоМесяцев,
	|	ТоварыСКоэфф.Коэффицент КАК Коэффицент,
	|	ВЫБОР
	|		КОГДА ТоварыСКоэфф.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент = 0
	|			ТОГДА ""Мусор""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0
	|		И ТоварыСКоэфф.Коэффицент <= 0.03
	|			ТОГДА ""Категория 8""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.03
	|		И ТоварыСКоэфф.Коэффицент <= 0.05
	|			ТОГДА ""Категория 7""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.05
	|		И ТоварыСКоэфф.Коэффицент <= 0.09
	|			ТОГДА ""Категория 6""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.09
	|		И ТоварыСКоэфф.Коэффицент <= 0.15
	|			ТОГДА ""Категория 5""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.15
	|		И ТоварыСКоэфф.Коэффицент <= 0.3
	|			ТОГДА ""Категория 4""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.3
	|		И ТоварыСКоэфф.Коэффицент <= 1
	|			ТОГДА ""Категория 3""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1
	|		И ТоварыСКоэфф.Коэффицент <= 1.5
	|			ТОГДА ""Категория 2""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1.5
	|			ТОГДА ""Категория 1""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСКоэфф КАК ТоварыСКоэфф
	|		ПО ТоварыСКоэфф.Товар = Номенклатура.Ссылка";
	
	ТекстСГруппировкой = "ВЫБРАТЬ
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура,
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоЗаявок
	|ПОМЕСТИТЬ ТоварыИзЗаявок
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Номенклатура <> ЗНАЧЕНИЕ(Справочник.Номенклатура.ПустаяСсылка)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрНоменклатура.Ссылка КАК Товар,
	|	СпрНоменклатура.ДатаСоздания КАК ДатаСоздания,
	|	ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) КАК КоличествоЗаявок,
	|	РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания, &ТекущаяДата, МЕСЯЦ) КАК КоличествоМесяцев,
	|	ВЫБОР
	|		КОГДА РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания, &ТекущаяДата, МЕСЯЦ) = 0
	|			ТОГДА 0
	|		ИНАЧЕ ВЫРАЗИТЬ(ЕСТЬNULL(ТоварыИзЗаявок.КоличествоЗаявок, 0) / РАЗНОСТЬДАТ(СпрНоменклатура.ДатаСоздания,
	|			&ТекущаяДата, МЕСЯЦ) КАК ЧИСЛО(10, 2))
	|	КОНЕЦ КАК Коэффицент
	|ПОМЕСТИТЬ ТоварыСКоэфф
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыИзЗаявок КАК ТоварыИзЗаявок
	|		ПО (ТоварыИзЗаявок.Номенклатура = СпрНоменклатура.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(Номенклатура.Ссылка) КАК КоличествоТоваров,
	|	ВЫБОР
	|		КОГДА ТоварыСКоэфф.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент = 0
	|			ТОГДА ""Мусор""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0
	|		И ТоварыСКоэфф.Коэффицент <= 0.03
	|			ТОГДА ""Категория 8""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.03
	|		И ТоварыСКоэфф.Коэффицент <= 0.05
	|			ТОГДА ""Категория 7""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.05
	|		И ТоварыСКоэфф.Коэффицент <= 0.09
	|			ТОГДА ""Категория 6""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.09
	|		И ТоварыСКоэфф.Коэффицент <= 0.15
	|			ТОГДА ""Категория 5""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.15
	|		И ТоварыСКоэфф.Коэффицент <= 0.3
	|			ТОГДА ""Категория 4""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.3
	|		И ТоварыСКоэфф.Коэффицент <= 1
	|			ТОГДА ""Категория 3""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1
	|		И ТоварыСКоэфф.Коэффицент <= 1.5
	|			ТОГДА ""Категория 2""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1.5
	|			ТОГДА ""Категория 1""
	|	КОНЕЦ КАК Категория
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТоварыСКоэфф КАК ТоварыСКоэфф
	|		ПО ТоварыСКоэфф.Товар = Номенклатура.Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ТоварыСКоэфф.ДатаСоздания > &ДатаПолгодаНазад
	|			ТОГДА ""Новые""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент = 0
	|			ТОГДА ""Мусор""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0
	|		И ТоварыСКоэфф.Коэффицент <= 0.03
	|			ТОГДА ""Категория 8""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.03
	|		И ТоварыСКоэфф.Коэффицент <= 0.05
	|			ТОГДА ""Категория 7""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.05
	|		И ТоварыСКоэфф.Коэффицент <= 0.09
	|			ТОГДА ""Категория 6""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.09
	|		И ТоварыСКоэфф.Коэффицент <= 0.15
	|			ТОГДА ""Категория 5""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.15
	|		И ТоварыСКоэфф.Коэффицент <= 0.3
	|			ТОГДА ""Категория 4""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 0.3
	|		И ТоварыСКоэфф.Коэффицент <= 1
	|			ТОГДА ""Категория 3""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1
	|		И ТоварыСКоэфф.Коэффицент <= 1.5
	|			ТОГДА ""Категория 2""
	|		КОГДА ТоварыСКоэфф.ДатаСоздания < &ДатаПолгодаНазад
	|		И ТоварыСКоэфф.Коэффицент > 1.5
	|			ТОГДА ""Категория 1""
	|	КОНЕЦ";
	
	
	СписокНоменклатурыКоэффицент.ПроизвольныйЗапрос = Истина;
	СписокНоменклатурыКоэффицент.ТекстЗапроса = Текст;
	
	КоличествоТоваровВКатегрии.ПроизвольныйЗапрос = Истина;
	КоличествоТоваровВКатегрии.ТекстЗапроса = ТекстСГруппировкой;
	
	Элементы.СписокНоменклатурыКоэффицент.Обновить();
	Элементы.КоличествоТоваровВКатегрии.Обновить();
КонецПроцедуры

