
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
  НепроверяемыеРеквизиты = Новый Массив();
НепроверяемыеРеквизиты.Добавить("Владелец");  
УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);    
 // КонецЕсли;
КонецПроцедуры   

     Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    // перед удалением реквизита из массива необходимо проверить, что он там есть
    // (не был удален ранее платформой или в коде).
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	Запрос = новый запрос;
		Запрос.Текст = "ВЫБРАТЬ
		|	ИндНомер.индкод КАК индкод
		|ИЗ
		|	РегистрСведений.ИндНомер КАК ИндНомер
		|ГДЕ
		|	ИндНомер.поддон = &поддон"; 
		запрос.УстановитьПараметр("поддон", Ссылка);
		выборка = Запрос.Выполнить().Выбрать(); 
		Выборка.Следующий();
		
		
		Пока Выборка.Следующий() Цикл
			НаборЗаписей = РегистрыСведений.ИндНомер.СоздатьНаборЗаписей();  			
			НаборЗаписей.Отбор.индкод.Установить(Выборка.индкод);
			НаборЗаписей.Прочитать();
			Для Каждого стрНабора из НаборЗаписей Цикл
				стрНабора.стеллаж = Стеллаж; //5
			КонецЦикла;
			НаборЗаписей.Записать();
		КонецЦикла; 
КонецПроцедуры
