

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий
Процедура ПриКопировании(ОбъектКопирования)
	
	ФайлПечать = Неопределено; 
	ФайлПодписьГлавногоБухгалтера = Неопределено;
	ОсновнойБанковскийСчет = Неопределено;
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	дт_Нумерация.ПроверитьУникальностьЭлементаСправочника(ЭтотОбъект, "БукваВНакладной", Истина, Истина, Истина, Отказ);
	
КонецПроцедуры




#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли