
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ТабДок = Новый ТабличныйДокумент; 
	ПечатьНаСервере(ТабДок,ПараметрКоманды); 
	ТабДок.Показать("МакетАктВозврата"); 

КонецПроцедуры

&НаСервере 
Процедура ПечатьНаСервере(ТабДок, СсылкаНаДокумент)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктВозврата.Номер,
		|	АктВозврата.Дата,
		|	АктВозврата.Клиент,
		|	АктВозврата.Организация,
		|	АктВозврата.Продажа,
		|	АктВозврата.Ответственный,
		|	АктВозвратаТаблица.НомерСтроки,
		|	АктВозвратаТаблица.укод,
		|	АктВозвратаТаблица.Артикул,
		|	АктВозвратаТаблица.Товар,
		|	АктВозвратаТаблица.Количество,
		|	АктВозвратаТаблица.Цена,
		|	АктВозвратаТаблица.Сумма,
		|	АктВозвратаТаблица.Партия
		|ИЗ
		|	Документ.АктВозврата.Таблица КАК АктВозвратаТаблица
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.АктВозврата КАК АктВозврата
		|		ПО АктВозвратаТаблица.Ссылка = АктВозврата.Ссылка
		|ГДЕ
		|	АктВозврата.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", СсылкаНаДокумент);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Структура = Новый Структура; 
	СуммаИтого =0; 
	КолличествоСтрок =0; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Структура.Вставить("Номер",ВыборкаДетальныеЗаписи.Номер);	
		Структура.Вставить("Дата",ВыборкаДетальныеЗаписи.Дата);
		Структура.Вставить("Клиент",ВыборкаДетальныеЗаписи.Клиент);
		Структура.Вставить("Организация",ВыборкаДетальныеЗаписи.Организация);
		Структура.Вставить("Продажа",ВыборкаДетальныеЗаписи.Продажа);
		Структура.Вставить("Ответственный",ВыборкаДетальныеЗаписи.Ответственный);
		Структура.Вставить("НомерСтроки",ВыборкаДетальныеЗаписи.НомерСтроки);
		Структура.Вставить("укод",ВыборкаДетальныеЗаписи.укод);
		Структура.Вставить("Артикул",ВыборкаДетальныеЗаписи.Артикул);
		Структура.Вставить("Товар",ВыборкаДетальныеЗаписи.Товар);
		Структура.Вставить("Количество",ВыборкаДетальныеЗаписи.Количество);
		Структура.Вставить("Цена",ВыборкаДетальныеЗаписи.Цена);
		Структура.Вставить("Сумма",ВыборкаДетальныеЗаписи.Сумма);
		Структура.Вставить("Партия",ВыборкаДетальныеЗаписи.Партия);
		СуммаИтого = СуммаИтого + ВыборкаДетальныеЗаписи.Сумма;  
		КолличествоСтрок = КолличествоСтрок + 1; 
	КонецЦикла;

	

	Макет = Документы.Актвозврата.ПолучитьМакет("МакетАктВозврата"); 
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("заголовок"); 
	ОбластьЗаголовок.Параметры.ОрганизацияНаименование = Структура.Организация; 
	ОбластьЗаголовок.Параметры.ПокупательНаименование = Структура.Клиент;
	ОбластьЗаголовок.Параметры.НомерДокумента = Структура.Номер;  
	ОбластьЗаголовок.Параметры.ДатаДокумента = Структура.Дата;  
	  
	ТабДок.Вывести(ОбластьЗаголовок); 
	
	ОбластьЗаголовок2 = Макет.ПолучитьОбласть("заголовок2"); 
	ТабДок.Вывести(ОбластьЗаголовок); 
	
	ОбластьШапка = Макет.ПолучитьОбласть("Шапка"); 
	ТабДок.Вывести(ОбластьШапка); 
	
	ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
	ОбластьЗаголовок.Параметры.НомерСтроки = Структура.НомерСтроки;
	ОбластьЗаголовок.Параметры.НашКод = Структура.укод;
	ОбластьЗаголовок.Параметры.код = Структура.Партия;
	ОбластьЗаголовок.Параметры.артикул = Структура.Артикул;
	ОбластьЗаголовок.Параметры.наименование = Структура.Товар;
	ОбластьЗаголовок.Параметры.колво = Структура.Количество;
	ОбластьЗаголовок.Параметры.цена = Структура.Цена; 
	ОбластьЗаголовок.Параметры.сумма = Структура.Сумма;
	ТабДок.Вывести(ОбластьСтрока); 
	
	ОбластьПодвал = Макет.ПолучитьОбласть("подвал"); 
	ОбластьЗаголовок.Параметры.КоличествоСтрок = КолличествоСтрок;
	ОбластьЗаголовок.Параметры.СуммаИтого = СуммаИтого;
	ОбластьЗаголовок.Параметры.СуммаПрописью = ЧислоПрописью(СуммаИтого, ,"рубль, рубля, рублей, м, копейка, копейки, копеек, ж");
	ОбластьЗаголовок.Параметры.ПродавецФИО = Структура.Ответственный;
	ОбластьЗаголовок.Параметры.Продажа = Структура.Продажа;
	
	
	ТабДок.Вывести(ОбластьПодвал); 
	
	ОбластьРазделитель = Макет.ПолучитьОбласть("Разделитель"); 
	ТабДок.Вывести(ОбластьРазделитель); 
КонецПроцедуры













































