
#Область ПрограммныйИнтерфейс


// Возвращает дату начала действия закона 150-ФЗ от 30.05.2016
// 
// Возвращаемое значение:
//   Дата - Дата - Дата начала применения закона
//
Функция ДатаНачалаДействия150ФЗ() Экспорт
	
	Возврат Дата("20160701");
	
КонецФункции

// Возвращает Истина, если указанная дата меньше даты начала действия закона 150-ФЗ
// В противном случае - Ложь.
// 
// Параметры:
//   Дата - проверяемая дата
// 
// Возвращаемое значение:
//   Результат - Булево
//
Функция УпрощенныйПорядокВычетаНДСПоНесырьевомуЭкспорту(Дата) Экспорт
	
	Возврат ДатаНачалаДействия150ФЗ() <= Дата;
	
КонецФункции

// Определяет, является ли страна членом Евразийского экономического союза
//
// Параметры:
//	Страна - СправочникСсылка.СтраныМира - Страна, для которой нужно определить членство в ЕАЭС
//	Период - Дата - Дата, на которую необходимо определить членство в ЕАЭС для страны. 
//			 Если не указано, то членство определяется на текущую дату
//
// Возвращаемое значение:
//	Булево - Истина, если страна является членом ЕАЭС, иначе - Ложь
//
Функция СтранаЯвляетсяЧленомЕАЭС(Страна, Период = Неопределено) Экспорт
	
	Если Не ЗначениеЗаполнено(Страна) 
		или ТипЗнч(Страна) <> Тип("СправочникСсылка.Страна") Тогда
		
		Возврат Ложь;
		
	КонецЕсли;
	
	КодСтраны = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Страна, "Код");
	
	Если Период = Неопределено Тогда
		Период = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Период >= '2015-01-01' 
			и (КодСтраны = "112" или КодСтраны = "398") Тогда // Казахстан, Беларусь
		Возврат Истина;
	КонецЕсли;
	
	Если Период >= '2015-01-02' и КодСтраны = "051" Тогда // Армения
		Возврат Истина;
	КонецЕсли;
	
	Если Период >= '2015-08-12' и КодСтраны = "417" Тогда // Киргизия
		Возврат Истина;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции // СтранаЯвляетсяЧленомЕАЭС()

#КонецОбласти

