
Процедура ОбработкаПроведения(Отказ, Режим)
	
	///+ГомзМА 07.04.2023
	// регистр ДвижениеТМЦ Расход
	Движения.ДвижениеТМЦ.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
		Движение 				= Движения.ДвижениеТМЦ.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Расход;
		Движение.Период 		= Дата;
		Движение.ТМЦ 			= ТекСтрокаСписокТМЦ.ТМЦ;
		Движение.МестоХранения 	= СкладСписания;
		Движение.Код 			= ТекСтрокаСписокТМЦ.Код;
		Движение.Количество 	= ТекСтрокаСписокТМЦ.Количество;
		Движение.Цена 			= ТекСтрокаСписокТМЦ.Цена;
		Движение.ТМЦПоНакладной = ТекСтрокаСписокТМЦ.ТМЦ.ТМЦПоНакладной;
	КонецЦикла;
	///-ГомзМА 07.04.2023
	
	//// регистр ДвижениеТМЦ Приход
	//Движения.ДвижениеТМЦ.Записывать = Истина;
	//Если ВидСписания = Перечисления.ВидыСписания.Производство тогда
	//	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
	//		Движение = Движения.ДвижениеТМЦ.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период = Дата;
	//		Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
	//		Движение.МестоХранения = ТекСтрокаСписокТМЦ.Склад;
	//		Движение.ИндКод = ТекСтрокаСписокТМЦ.Код;
	//		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	//	КонецЦикла;
	//	
	//	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
	//		Движение = Движения.ДвижениеТМЦ.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
	//		Движение.МестоХранения = СкладСписания;
	//		Движение.ИндКод = ТекСтрокаСписокТМЦ.Код;
	//		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	//	КонецЦикла;
	//	
	//ИначеЕсли ВидСписания = Перечисления.ВидыСписания.НаЧеловека тогда
	//	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
	//		Движение = Движения.ДвижениеТМЦ.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//		Движение.Период = Дата;
	//		Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
	//		Движение.МестоХранения = ТекСтрокаСписокТМЦ.Склад;
	//		Движение.ИндКод = ТекСтрокаСписокТМЦ.Код;
	//		Движение.Получатель = Получатель;
	//		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	//	КонецЦикла;
	//	
	//	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
	//		Движение = Движения.ДвижениеТМЦ.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
	//		Движение.МестоХранения = СкладСписания;
	//		Движение.ИндКод = ТекСтрокаСписокТМЦ.Код;
	//		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	//	КонецЦикла;
	//ИначеЕсли ВидСписания = Перечисления.ВидыСписания.Полное тогда
	//	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
	//		Движение = Движения.ДвижениеТМЦ.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
	//		Движение.МестоХранения = СкладСписания;
	//		Движение.ИндКод = ТекСтрокаСписокТМЦ.Код;
	//		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	//	КонецЦикла;
	//КонецЕсли;
	
	
	///+ГомзМА 05.04.2023
	Движения.Записать();
	
	Отказ = РегистрыНакопления.ДвижениеТМЦ.ЕстьОтрицательныеОстатки(Ссылка, Дата, СкладСписания); 
	///-ГомзМА 05.04.2023
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	СкладСписания = Справочники.Стеллаж.НайтиПоКоду("000000530");	
	
	///+ГомзМА 07.04.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТМЦ") Тогда
		
		Ответственный  = ДанныеЗаполнения.Ответственный;
		СкладСписания  = Справочники.Стеллаж.НайтиПоКоду("000000530");
		ПоступлениеТМЦ = ДанныеЗаполнения.Ссылка;
		Организация	   = ДанныеЗаполнения.Организация;
		Поставщик	   = ДанныеЗаполнения.Поставщик;
		Для Каждого ТекСтрокаСписокТМЦ Из ДанныеЗаполнения.СписокТМЦ Цикл
			НоваяСтрока 				= СписокТМЦ.Добавить();
			НоваяСтрока.Код 			= ТекСтрокаСписокТМЦ.Код;
			НоваяСтрока.Количество 		= ТекСтрокаСписокТМЦ.Количество;
			НоваяСтрока.Склад 			= ТекСтрокаСписокТМЦ.Склад;
			НоваяСтрока.Сумма 			= ТекСтрокаСписокТМЦ.Сумма;
			НоваяСтрока.ТМЦ 			= ТекСтрокаСписокТМЦ.ТМЦ;
			НоваяСтрока.ТМЦПоНакладной 	= ТекСтрокаСписокТМЦ.ТМЦПоНакладной;
			НоваяСтрока.Цена 			= ТекСтрокаСписокТМЦ.Цена;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 07.04.2023

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	СуммаДокумента = СписокТМЦ.Итог("Сумма");
КонецПроцедуры
