

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ГомзМА 06.07.2023
	ЗаполнитьПодвал();
	///-ГомзМА 06.07.2023
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодвал()

	///+ГомзМА 06.07.2023
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	
	ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьАвтоЕвро.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьАвтоРубли.ГоризонтальноеПоложениеВПодвале 		= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьДоставкиИзСтраны.ГоризонтальноеПоложениеВПодвале 	= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьДоставкиПоРоссии.ГоризонтальноеПоложениеВПодвале 	= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.ДополнительныеРасходы.ГоризонтальноеПоложениеВПодвале 		= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаЕвро.ГоризонтальноеПоложениеВПодвале 					= ГоризонтальноеПоложениеЭлемента.Право;
	//ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьАвтомобиляИтогоРуб.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
	
	
	ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьАвтоЕвро.ТекстПодвала 			= Формат(Результат.Итог("СтоимостьАвтоЕвро"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьАвтоРубли.ТекстПодвала 			= Формат(Результат.Итог("СтоимостьАвтоРубли"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьДоставкиИзСтраны.ТекстПодвала 	= Формат(Результат.Итог("СтоимостьДоставкиИзСтраны"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьДоставкиПоРоссии.ТекстПодвала 	= Формат(Результат.Итог("СтоимостьДоставкиПоРоссии"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.ДополнительныеРасходы.ТекстПодвала 		= Формат(Результат.Итог("ДополнительныеРасходы"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаЕвро.ТекстПодвала 					= Формат(Результат.Итог("СуммаЕвро"),"ЧДЦ=0; ЧН=-");
	//ЭтотОбъект.ЭтаФорма.Элементы.СтоимостьАвтомобиляИтогоРуб.ТекстПодвала 					= Формат(Результат.Итог("СтоимостьАвтомобиляИтогоРуб"),"ЧДЦ=0; ЧН=-");
	///-ГомзМА 06.07.2023

КонецПроцедуры
