&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	/// Комлев АА 28/10/24 +++
	Фильтр = 1;
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокКлиентов, "Целевой", Истина, // Значение отбора

		ВидСравненияКомпоновкиДанных.Равно, , Истина);
	ОбновитьСписокНовыхКлиентов();
	УсловноеОФормлениеСписокКлиентов();
	/// Комлев АА 28/10/24 ---
КонецПроцедуры

Процедура УсловноеОФормлениеСписокКлиентов() Экспорт
	/// Комлев АА 02/11/24 ++++
	ЭлементОформления = СписокКлиентов.УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоМашин");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = 0;
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоНебесноГолубой);
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("КоличествоМашин");
	ПолеОформления.Использование = Истина;
	
	ЭлементОформления = СписокКлиентов.УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Город");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Справочники.Город.ПустаяСсылка();
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоКоралловый);
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Город");
	ПолеОформления.Использование = Истина;

	/// Комлев АА 02/11/24 ---
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКоличествоНовых(Команда)
	КоличествоНовых = КоличествоСтрокВСписке("СписокКлиентов");
КонецПроцедуры

&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	/// Комлев АА 30/10/24 +++
	Если Фильтр = 1 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокКлиентов, "Целевой", Истина, // Значение отбора

			ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбновитьСписокНовыхКлиентов();
	ИначеЕсли Фильтр = 2 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		СписокКлиентов, "Целевой", Ложь, // Значение отбора

			ВидСравненияКомпоновкиДанных.Равно, , Истина);
		ОбновитьСписокНовыхКлиентов();
	ИначеЕсли Фильтр = 3 Тогда
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(СписокКлиентов, "Целевой");
		ОбновитьСписокНовыхКлиентов();
	КонецЕсли;
	
	/// Комлев АА 30/10/24 ---
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	/// Комлев АА 28/10/24 +++
	ОбновитьСписокНовыхКлиентов();
	/// Комлев АА 28/10/24 ---
КонецПроцедуры

Процедура ОбновитьСписокНовыхКлиентов() Экспорт
	/// Комлев АА 28/10/24 +++
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Период.ДатаОкончания);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ОбщийКлиент", Справочники.Пользователи.НайтиПоНаименованию(
		"ОбщийКлиент"));
	КоличествоНовых = КоличествоСтрокВСписке("СписокКлиентов");
		/// Комлев АА 28/10/24 ---
КонецПроцедуры

&НаСервере
Функция КоличествоСтрокВСписке(НазваниеСписка) // Строка 
	// Комлев АА 29/10/24 +++ 
	СКД = Элементы[НазваниеСписка].ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы[НазваниеСписка].ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикКД.Выполнить(СКД, НастройкиКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД);
	ПроцессорВыводаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	РезультатКД_ТЗ = ПроцессорВыводаКД.Вывести(ПроцессорКД);

	Возврат РезультатКД_ТЗ.Количество();
	
	// Комлев АА 29/10/24 --- 
КонецФункции