&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	/// Комлев АА 28/10/24 +++
	ОбновитьСписокНовыхКлиентов();
	/// Комлев АА 28/10/24 ---
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьКоличествоНовых(Команда)
	КоличествоНовых = КоличествоСтрокВСписке("СписокКлиентов");
КонецПроцедуры


&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	/// Комлев АА 28/10/24 +++
	ОбновитьСписокНовыхКлиентов();
	КоличествоНовых = КоличествоСтрокВСписке("СписокКлиентов");
	/// Комлев АА 28/10/24 ---
КонецПроцедуры


Процедура ОбновитьСписокНовыхКлиентов() Экспорт
	/// Комлев АА 28/10/24 +++
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Период.ДатаОкончания);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ОбщийКлиент", Справочники.Пользователи.НайтиПоНаименованию(
		"ОбщийКлиент"));
	КоличествоНовых = КоличествоСтрокВСписке("СписокКлиентов");
		/// Комлев АА 28/10/24 ---
КонецПроцедуры


&НаСервере
Функция КоличествоСтрокВСписке(НазваниеСписка) // Строка 
	// Комлев АА 29/10/24 +++ 
	СКД = Элементы[НазваниеСписка].ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы[НазваниеСписка].ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикКД.Выполнить(СКД, НастройкиКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД);
	ПроцессорВыводаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	РезультатКД_ТЗ = ПроцессорВыводаКД.Вывести(ПроцессорКД);

	Возврат РезультатКД_ТЗ.Количество();
	
	// Комлев АА 29/10/24 --- 
КонецФункции