&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	/// Комлев АА 28/10/24 +++
	ОбновитьСписокНовыхКлиентов();
	/// Комлев АА 28/10/24 ---
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	/// Комлев АА 28/10/24 +++
	ОбновитьСписокНовыхКлиентов();
	/// Комлев АА 28/10/24 ---
КонецПроцедуры

Процедура ОбновитьСписокНовыхКлиентов()
	/// Комлев АА 28/10/24 +++
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Период.ДатаОкончания);
	СписокКлиентов.Параметры.УстановитьЗначениеПараметра("ОбщийКлиент", Справочники.Пользователи.НайтиПоНаименованию(
		"ОбщийКлиент"));
		/// Комлев АА 28/10/24 ---
КонецПроцедуры