
&НаКлиенте
Процедура DoJob(Команда)
	// Вставить содержимое обработчика.
	ВР();
КонецПроцедуры

&НаСервере
Процедура ВР()
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка,
	               |	Номенклатура.DirectText,
	               |	Номенклатура.DirectNazvanie
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.DirectZapolneno = &DirectZapolneno";
	запрос.УстановитьПараметр("DirectZapolneno", Ложь );
	рез = запрос.Выполнить().Выгрузить();
	Для Каждого стр Из рез цикл
		об = стр.Ссылка.ПолучитьОбъект();
		об.DirectText = об.Наименование;
		об.DirectNazvanie = об.Наименование;
		об.Записать();
	КонецЦикла;
КонецПроцедуры
