
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОстаткиБалансИзменение" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Пользователи.РолиДоступны("КассаМосква") И НЕ Пользователи.РолиДоступны("ПолныеПрава") тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("Подразделение",Справочники.Подразделения.НайтиПоКоду("000000029"));
	//КонецЕсли;
	
	///+ГомзМА 05.02.2024
	Если Пользователи.ТекущийПользователь().Подразделение = Справочники.Подразделения.НайтиПоКоду("000000060") И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда //Филиал Екатеринбург - Действующий
		Список.Параметры.УстановитьЗначениеПараметра("Подразделение",Справочники.Подразделения.НайтиПоКоду("000000060")); //Филиал Екатеринбург - Действующий
	ИначеЕсли Пользователи.ТекущийПользователь().Подразделение = Справочники.Подразделения.НайтиПоКоду("000000029") И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда //Филиал Москва - Действующий
		Список.Параметры.УстановитьЗначениеПараметра("Подразделение",Справочники.Подразделения.НайтиПоКоду("000000029")); //Филиал Москва - Действующий
	КонецЕсли;
	///-ГомзМА 05.02.2024
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти