
#Область СлужебныйПрограммныйИнтерфейс

Процедура ЗаполнитьСтроковыйИдентификаторПоУИ(Таблица, ИмяКолонкиУИ, ИмяКолонкиСтрока) Экспорт
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
	
		СтрокаТаблицы[ИмяКолонкиСтрока] = Строка(СтрокаТаблицы[ИмяКолонкиУИ]);
	
	КонецЦикла;  
	
КонецПроцедуры

Процедура ЗаполнитьУникальныйИдентификаторПоСтроке(Таблица, ИмяКолонкиУИ, ИмяКолонкиСтрока)   Экспорт
	
	Для каждого СтрокаТаблицы Из Таблица Цикл
	
		СтрокаТаблицы[ИмяКолонкиУИ] = Новый УникальныйИдентификатор(СтрокаТаблицы[ИмяКолонкиСтрока]);
	
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
