#Область ПрограммныйИнтерфейс

Процедура ОбновитьФИО(Объект) Экспорт
	
	ФИО = Объект.Наименование;
	Если ПустаяСтрока(ФИО) Тогда
		Возврат
	КонецЕсли;
	
	ФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(ФИО, " ");
	
	Объект.Фамилия = ФИО[0];
	
	Если ФИО.Количество() > 1 Тогда
		Объект.Имя = ФИО[1];
		
		Если ФИО.Количество() > 2 Тогда
			Объект.Отчество = ФИО[2];
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбновитьНаименование(Объект) Экспорт
	
	СоставСтроки = Новый Массив();
	Если ЗначениеЗаполнено(Объект.Фамилия) Тогда
		СоставСтроки.Добавить(Объект.Фамилия);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Имя) Тогда
		СоставСтроки.Добавить(Объект.Имя);
	КонецЕсли;
	Если ЗначениеЗаполнено(Объект.Отчество) Тогда
		СоставСтроки.Добавить(Объект.Отчество);
	КонецЕсли;
	
	Объект.Наименование = СтрСоединить(СоставСтроки, " ");
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти