&НаКлиенте
Процедура ЗакупленныйТоварЦенаПродажиПриИзменении(Элемент)
//	ТекДанные = Элементы.ЗакупленныйТовар.ТекущиеДанные;
//	ТекДанные.Прибыль = (ТекДанные.ЦенаПродажи * ТекДанные.Количество) - ТекДанные.СуммаЗакупки;
КонецПроцедуры

Функция ПолучитьСтатусОжидаем()
//	Возврат Перечисления.СтатусЗакупкиТовара.ОжидаемПоступление;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьДанныеТовара(СсылкаНаТовар)
/// Комлев АА 22/11/24 +++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Код КАК Код,
	|	Номенклатура.Артикул КАК Артикул,
	|	Номенклатура.Производитель КАК Производитель,
	|	Номенклатура.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ДанныеОТоваре
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка = &СсылкаНаТовар
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВТ_ДанныеОТоваре.Код КАК Код,
	|	ВТ_ДанныеОТоваре.Артикул КАК Артикул,
	|	ВТ_ДанныеОТоваре.Производитель КАК Производитель,
	|	дт_ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаПродажи,
	|	ВТ_ДанныеОТоваре.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_ДанныеОТоваре КАК ВТ_ДанныеОТоваре
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дт_ЦеныНоменклатуры.СрезПоследних(, Номенклатура В
	|			(ВЫБРАТЬ
	|				ДанныеОТоваре.Ссылка
	|			ИЗ
	|				ВТ_ДанныеОТоваре КАК ДанныеОТоваре)) КАК дт_ЦеныНоменклатурыСрезПоследних
	|		ПО (дт_ЦеныНоменклатурыСрезПоследних.Номенклатура = ВТ_ДанныеОТоваре.Ссылка)
	|
	|УПОРЯДОЧИТЬ ПО
	|	дт_ЦеныНоменклатурыСрезПоследних.Период УБЫВ";

	Запрос.УстановитьПараметр("СсылкаНаТовар", СсылкаНаТовар);

	РезультатЗапроса = Запрос.Выполнить();

	Выборка = РезультатЗапроса.Выбрать();
	СтруктураТовара  = Новый Структура;
	Пока Выборка.Следующий() Цикл
		СтруктураТовара.Вставить("Код", Выборка.Код);
		СтруктураТовара.Вставить("Артикул", Выборка.Артикул);
		СтруктураТовара.Вставить("Производитель", Выборка.Производитель);
		СтруктураТовара.Вставить("ЦенаПродажи", Выборка.ЦенаПродажи);
	КонецЦикла;
	Возврат СтруктураТовара;
	/// Комлев АА 22/11/24 ---
КонецФункции

&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	Для Каждого СтрокаТЧ Из Объект.ЗакупленныйТовар Цикл
		СтрокаТЧ.СуммаНДС = (СтрокаТЧ.СуммаЗакупки - СтрокаТЧ.СтоимостьДоставки) * ПолучитьНалогОрганизации(Объект.Организация) / 120;
		СтрокаТЧ.ЦенаЗакупки = (СтрокаТЧ.СуммаЗакупки - СтрокаТЧ.СуммаНДС  - СтрокаТЧ.СтоимостьДоставки) / СтрокаТЧ.Количество;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ЗакупленныйТоварСуммаЗакупкиПриИзменении(Элемент)
	ТекДанные = Элементы.ЗакупленныйТовар.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекДанные.СуммаНДС = (ТекДанные.СуммаЗакупки - ТекДанные.СтоимостьДоставки) * ПолучитьНалогОрганизации(Объект.Организация) / 120;
	Иначе
		ТекДанные.СуммаНДС = 0;
	КонецЕсли;
	ТекДанные.ЦенаЗакупки = (ТекДанные.СуммаЗакупки - ТекДанные.СуммаНДС - ТекДанные.СтоимостьДоставки) / ТекДанные.Количество;
	ТекДанные.Прибыль = (ТекДанные.ЦенаПродажи * ТекДанные.Количество) - ТекДанные.СуммаЗакупки - ТекДанные.СтоимостьДоставки;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакупленныйТоварТоварПриИзменении(Элемент)
	ТекДанные = Элементы.ЗакупленныйТовар.ТекущиеДанные;
	ДанныеОТоваре = ПолучитьДанныеТовара(ТекДанные.Товар);
	ТекДанные.Код = ДанныеОТоваре.Код;
	ТекДанные.Артикул = ДанныеОТоваре.Артикул;
	ТекДанные.Производитель = ДанныеОТоваре.Производитель;
	ТекДанные.Количество = 1;
	ТекДанные.ЦенаПродажи = ДанныеОТоваре.ЦенаПродажи;
	ТекДанные.Прибыль = (ТекДанные.ЦенаПродажи * ТекДанные.Количество) - ТекДанные.СуммаЗакупки;
	ТекДанные.СтатусПоступления = ПолучитьСтатусОжидаем();
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

Функция ПолучитьНалогОрганизации(Организация)
	
	Налог = 0; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организация.Налог КАК Налог
	|ИЗ
	|	Справочник.Организация КАК Организация
	|ГДЕ
	|	Организация.Ссылка = &Организация";

	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	Налог = Число(ВыборкаДетальныеЗаписи.Налог); 
	Возврат Налог;
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьНалогТранспортнойКомпании(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТранспротнаяКомпания.Налог КАК Налог
		|ИЗ
		|	Справочник.ТранспротнаяКомпания КАК ТранспротнаяКомпания
		|ГДЕ
		|	ТранспротнаяКомпания.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Налог; 
	
КонецФункции



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если ЗначениеЗаполнено(объект.НДСДоставки) тогда 
		Элементы.НДСДоставки.Видимость = Истина; 
	КонецЕсли; 
КонецПроцедуры
	

&НаКлиенте
Процедура ТранспортнаяКомпанияПриИзменении(Элемент)
		ПосчитатьНДСДоставки(); 
		Для Каждого СтрокаТЧ ИЗ Объект.ЗакупленныйТовар Цикл 
			СтрокаТЧ.СтоимостьДоставки = СтоимостьДоставкиЗаЕдиницуТовара(); 
			ПосчитатьСуммуВСтрокеТЧ(СтрокаТЧ); 
		КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьДоставкиПриИзменении(Элемент)
		ПосчитатьНДСДоставки(); 
		Для Каждого СтрокаТЧ ИЗ Объект.ЗакупленныйТовар Цикл 
			СтрокаТЧ.СтоимостьДоставки = СтоимостьДоставкиЗаЕдиницуТовара(); 
			ПосчитатьСуммуВСтрокеТЧ(СтрокаТЧ); 
		КонецЦикла;  
КонецПроцедуры

&НаКлиенте
Процедура ЗакупленныйТоварЦенаСНДСПриИзменении(Элемент)
	Строка = Элементы.ЗакупленныйТовар.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		ПроцентНалог 		= ПолучитьНалогОрганизации(Объект.Организация); 
		Строка.ЦенаБЕЗНДС 	= Строка.ЦенаСНДС - (Строка.ЦенаСНДС * (ПроцентНалог / ПроцентНалог + 100)); 
		Строка.НДС			= Строка.ЦенаБЕЗНДС * 0.2;
		
		ПосчитатьСуммуВСтрокеТЧ(Строка); 
	Иначе 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текс = "Организация не указанна";
		Сообщение.Сообщить();
	КонецЕсли; 
	Объект.СуммаДокумента = Объект.ЗакупленныйТовар.Итог("Сумма");	
КонецПроцедуры

&НаКлиенте
Процедура ЗакупленныйТоварЦенаБЕЗНДСПриИзменении(Элемент)
	
	Строка = Элементы.ЗакупленныйТовар.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		ПроцентНалог 		= ПолучитьНалогОрганизации(Объект.Организация); 
		Строка.ЦенаСНДС 	= Строка.ЦенаБЕЗНДС * (ПроцентНалог / 100); 
		Строка.НДС			= Строка.ЦенаБЕЗНДС * (ПроцентНалог / 100); 
		
		ПосчитатьСуммуВСтрокеТЧ(Строка); 
	КонецЕсли; 
	Объект.СуммаДокумента = Объект.ЗакупленныйТовар.Итог("Сумма");	
КонецПроцедуры

&НаСервере
Процедура ПосчитатьСуммуВСтрокеТЧ(Строка)
	
	Строка.Сумма 	= (Строка.ЦенаБЕЗНДС + Строка.НДС + Строка.СтоимостьДоставки)	* Строка.Количество; 
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакупленныйТоварКоличествоПриИзменении1(Элемент)
	Строка = Элементы.ЗакупленныйТовар.ТекущиеДанные; 
	ПосчитатьСуммуВСтрокеТЧ(Строка); 
	Объект.СуммаДокумента = Объект.ЗакупленныйТовар.Итог("Сумма");	
КонецПроцедуры


&НаСервере
Процедура ПосчитатьСуммуДокумента(Строка)
	
	Строка.Сумма 	= (Строка.ЦенаБЕЗНДС + Строка.НДС + Строка.СтоимостьДоставки)	* Строка.Количество; 
	
КонецПроцедуры

&НаСервере
Функция СтоимостьДоставкиЗаЕдиницуТовара() 
	
	ЦенаДоставкиЗаЕдиницу = 0; 
	Если ЗначениеЗаполнено(Объект.ТранспортнаяКомпания) И ЗначениеЗаполнено(Объект.СтоимостьДоставки) Тогда 
		
		ОбщееКоличествоТоваров 	= Объект.ЗакупленныйТовар.Итог("Количество");
		ЦенаДоставкиЗаЕдиницу 	= Объект.СтоимостьДоставки / ОбщееКоличествоТоваров; 
		
	КонецЕсли;	
	Возврат ЦенаДоставкиЗаЕдиницу; 	
	
КонецФункции


&НаСервере
Функция ПосчитатьНДСДоставки()
	
	Если ЗначениеЗаполнено(Объект.ТранспортнаяКомпания) И ЗначениеЗаполнено(Объект.СтоимостьДоставки) Тогда 
		
		Налог = ОпределитьНалогТранспортнойКомпании(Объект.ТранспортнаяКомпания); 
		Если Налог > 0 Тогда 
			Объект.НДСДоставки 				= (Объект.СтоимостьДоставки * Налог) / (Налог + 100); 
			Элементы.НДСДоставки.Видимость 	= Истина; 
		КонецЕсли; 
		
	КонецЕсли; 

КонецФункции







































































	
	
	
	
	
	
	
	
	
	
	
	
	
	
	