&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() Тогда
		Объект.Ответственный = Пользователи.ТекущийПользователь();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Т_ТПриИзменении(Элемент)
	
	Если Объект.Т_Т = ПредопределенноеЗначение("Перечисление.Да_Нет.Да")    Тогда 
		
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Ложь; 
		Элементы.Т_Д.Видимость = Ложь; 
		Элементы.Д_Д.Видимость = Ложь;
	Иначе 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Истина;
		 
	КонецЕсли 
КонецПроцедуры

&НаКлиенте
Процедура Д_ТПриИзменении(Элемент)
	Если Объект.Д_Т = ПредопределенноеЗначение("Перечисление.Да_Нет.Да")  ТОгда 
		
		Элементы.Т_Т.Видимость = Ложь; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Ложь; 
		Элементы.Д_Д.Видимость = Ложь;
	Иначе 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Истина;
		 
	КонецЕсли  
КонецПроцедуры

&НаКлиенте
Процедура Т_ДПриИзменении(Элемент)

	Если Объект.Т_Д = ПредопределенноеЗначение("Перечисление.Да_Нет.Да")  ТОгда 
		Элементы.Т_Т.Видимость = Ложь; 
		Элементы.Д_Т.Видимость = Ложь; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Ложь;
	Иначе 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Истина; 
	КонецЕсли
	  
КонецПроцедуры

&НаКлиенте
Процедура Д_ДПриИзменении(Элемент)
	
	Если Объект.Д_Д = ПредопределенноеЗначение("Перечисление.Да_Нет.Да")  ТОгда 
		
		Элементы.Т_Т.Видимость = Ложь; 
		Элементы.Д_Т.Видимость = Ложь; 
		Элементы.Т_Д.Видимость = Ложь; 
		Элементы.Д_Д.Видимость = Истина;
		
	Иначе 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Истина; 
		
	КонецЕсли  
	
КонецПроцедуры

&НаСервере
Функция ВидимостьСтатусовДвеБуквы()
	Если Объект.Т_Т = Перечисления.Да_Нет.Да Тогда 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Ложь; 
		Элементы.Т_Д.Видимость = Ложь; 
		Элементы.Д_Д.Видимость = Ложь;
	Иначе 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Истина; 
	КонецЕсли;

	Если Объект.Д_Т = Перечисления.Да_Нет.Да  ТОгда 
		Элементы.Т_Т.Видимость = Ложь; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Ложь; 
		Элементы.Д_Д.Видимость = Ложь;
	Иначе 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Истина; 
	КонецЕсли; 

	Если Объект.Т_Д = Перечисления.Да_Нет.Да  ТОгда 
		Элементы.Т_Т.Видимость = Ложь; 
		Элементы.Д_Т.Видимость = Ложь; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Ложь;
	Иначе 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Истина; 
	КонецЕсли;  

	Если Объект.Д_Д = Перечисления.Да_Нет.Да ТОгда 
		Элементы.Т_Т.Видимость = Ложь; 
		Элементы.Д_Т.Видимость = Ложь; 
		Элементы.Т_Д.Видимость = Ложь; 
		Элементы.Д_Д.Видимость = Истина;
		
	Иначе 
		Элементы.Т_Т.Видимость = Истина; 
		Элементы.Д_Т.Видимость = Истина; 
		Элементы.Т_Д.Видимость = Истина; 
		Элементы.Д_Д.Видимость = Истина; 
	КонецЕсли; 

КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если ЗначениеЗаполнено(объект.НДСДоставки) тогда 
		Элементы.НДСДоставки.Видимость = Истина; 
	КонецЕсли; 
	
	ВидимостьСтатусовДвеБуквы(); 
	
КонецПроцедуры




#Область Работа_С_ТЧ

//&НаСервереБезКонтекста
//Функция ПолучитьДанныеТовара(СсылкаНаТовар)
///// Комлев АА 22/11/24 +++
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	"ВЫБРАТЬ
//	|	Номенклатура.Код КАК Код,
//	|	Номенклатура.Артикул КАК Артикул,
//	|	Номенклатура.Производитель КАК Производитель,
//	|	Номенклатура.Ссылка КАК Ссылка
//	|ПОМЕСТИТЬ ВТ_ДанныеОТоваре
//	|ИЗ
//	|	Справочник.Номенклатура КАК Номенклатура
//	|ГДЕ
//	|	Номенклатура.Ссылка = &СсылкаНаТовар
//	|;
//	|
//	|////////////////////////////////////////////////////////////////////////////////
//	|ВЫБРАТЬ ПЕРВЫЕ 1
//	|	ВТ_ДанныеОТоваре.Код КАК Код,
//	|	ВТ_ДанныеОТоваре.Артикул КАК Артикул,
//	|	ВТ_ДанныеОТоваре.Производитель КАК Производитель,
//	|	дт_ЦеныНоменклатурыСрезПоследних.Цена КАК ЦенаПродажи,
//	|	ВТ_ДанныеОТоваре.Ссылка КАК Ссылка
//	|ИЗ
//	|	ВТ_ДанныеОТоваре КАК ВТ_ДанныеОТоваре
//	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.дт_ЦеныНоменклатуры.СрезПоследних(, Номенклатура В
//	|			(ВЫБРАТЬ
//	|				ДанныеОТоваре.Ссылка
//	|			ИЗ
//	|				ВТ_ДанныеОТоваре КАК ДанныеОТоваре)) КАК дт_ЦеныНоменклатурыСрезПоследних
//	|		ПО (дт_ЦеныНоменклатурыСрезПоследних.Номенклатура = ВТ_ДанныеОТоваре.Ссылка)
//	|
//	|УПОРЯДОЧИТЬ ПО
//	|	дт_ЦеныНоменклатурыСрезПоследних.Период УБЫВ";
//
//	Запрос.УстановитьПараметр("СсылкаНаТовар", СсылкаНаТовар);
//
//	РезультатЗапроса = Запрос.Выполнить();
//
//	Выборка = РезультатЗапроса.Выбрать();
//	СтруктураТовара  = Новый Структура;
//	Пока Выборка.Следующий() Цикл
//		СтруктураТовара.Вставить("Код", Выборка.Код);
//		СтруктураТовара.Вставить("Артикул", Выборка.Артикул);
//		СтруктураТовара.Вставить("Производитель", Выборка.Производитель);
//		СтруктураТовара.Вставить("ЦенаПродажи", Выборка.ЦенаПродажи);
//	КонецЦикла;
//	Возврат СтруктураТовара;
//	/// Комлев АА 22/11/24 ---
//КонецФункции

//&НаКлиенте
//Процедура ЗакупленныйТоварТоварПриИзменении(Элемент)
//	ТекДанные = Элементы.ЗакупленныйТовар.ТекущиеДанные;
//	ДанныеОТоваре = ПолучитьДанныеТовара(ТекДанные.Товар);
//	ТекДанные.Код = ДанныеОТоваре.Код;
//	ТекДанные.Артикул = ДанныеОТоваре.Артикул;
//	ТекДанные.Производитель = ДанныеОТоваре.Производитель;
//	ТекДанные.Количество = 1;
//	ТекДанные.ЦенаПродажи = ДанныеОТоваре.ЦенаПродажи;
//	ТекДанные.Прибыль = (ТекДанные.ЦенаПродажи * ТекДанные.Количество) - ТекДанные.СуммаЗакупки;
//	ТекДанные.СтатусПоступления = ПолучитьСтатусОжидаем();
//КонецПроцедуры

&НаСервере
Функция ПолучитьСтатусОжидаем()
	Возврат Перечисления.СтатусЗакупкиТовара.ОжидаемПоступление;
КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьНалогОрганизации(Организация)
	
	Налог = 0; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организация.Налог КАК Налог
	|ИЗ
	|	Справочник.Организация КАК Организация
	|ГДЕ
	|	Организация.Ссылка = &Организация";

	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	Налог = Число(ВыборкаДетальныеЗаписи.Налог); 
	Возврат Налог;
КонецФункции

&НаСервереБезКонтекста
Функция ОпределитьНалогТранспортнойКомпании(Ссылка)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ТранспротнаяКомпания.Налог КАК Налог
		|ИЗ
		|	Справочник.ТранспротнаяКомпания КАК ТранспротнаяКомпания
		|ГДЕ
		|	ТранспротнаяКомпания.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Возврат Выборка.Налог; 
	
КонецФункции

&НаКлиенте
Процедура ТранспортнаяКомпанияПриИзменении(Элемент)
		ПосчитатьНДСДоставки(); 
		Для Каждого СтрокаТЧ ИЗ Объект.ЗакупленныйТовар Цикл 
			СтрокаТЧ.СтоимостьДоставки = СтоимостьДоставкиЗаЕдиницуТовара(); 
			СтрокаТЧ.Сумма 	= (СтрокаТЧ.ЦенаБЕЗНДС + СтрокаТЧ.НДС)	* СтрокаТЧ.Количество + СтрокаТЧ.СтоимостьДоставки; 
		КонецЦикла; 
КонецПроцедуры

&НаСервере
Функция ПосчитатьНДСДоставки()
	
	Если ЗначениеЗаполнено(Объект.ТранспортнаяКомпания) И ЗначениеЗаполнено(Объект.СтоимостьДоставки) Тогда 
		
		Налог = ОпределитьНалогТранспортнойКомпании(Объект.ТранспортнаяКомпания); 
		Если Налог > 0 Тогда 
			Объект.НДСДоставки 				= (Объект.СтоимостьДоставки * Налог) / (Налог + 100); 
			Элементы.НДСДоставки.Видимость 	= Истина; 
		Иначе 
			Объект.НДСДоставки = 0;
		КонецЕсли; 
		
	КонецЕсли; 

КонецФункции

&НаСервере
Функция СтоимостьДоставкиЗаЕдиницуТовара() 
	
	ЦенаДоставкиЗаЕдиницу = 0; 
	Если ЗначениеЗаполнено(Объект.ТранспортнаяКомпания) И ЗначениеЗаполнено(Объект.СтоимостьДоставки) Тогда 
		
		ОбщееКоличествоТоваров 	= Объект.ЗакупленныйТовар.Итог("Количество");
		ЦенаДоставкиЗаЕдиницу 	= Объект.СтоимостьДоставки / ОбщееКоличествоТоваров; 
		
	КонецЕсли;	
	Возврат ЦенаДоставкиЗаЕдиницу; 	
	
КонецФункции

&НаКлиенте
Процедура СтоимостьДоставкиПриИзменении(Элемент)
		ПересчитьСтоимостьДоставкиТоваров(); 
КонецПроцедуры

&НаСервере
Функция ПересчитьСтоимостьДоставкиТоваров()
		ПосчитатьНДСДоставки(); 
		Для Каждого СтрокаТЧ ИЗ Объект.ЗакупленныйТовар Цикл 
			СтрокаТЧ.СтоимостьДоставки = СтоимостьДоставкиЗаЕдиницуТовара() * СтрокаТЧ.Количество; 
			СтрокаТЧ.Сумма 	= (СтрокаТЧ.ЦенаБЕЗНДС + СтрокаТЧ.НДС )	* СтрокаТЧ.Количество + СтрокаТЧ.СтоимостьДоставки; 
		КонецЦикла; 
		Объект.СуммаДокумента = Объект.ЗакупленныйТовар.Итог("Сумма");	
КонецФункции

&НаКлиенте
Процедура ЗакупленныйТоварЦенаСНДСПриИзменении(Элемент)
	Строка = Элементы.ЗакупленныйТовар.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		ПроцентНалог 		= ПолучитьНалогОрганизации(Объект.Организация); 
		Если ПроцентНалог > 0 Тогда 
			
			Строка.ЦенаБЕЗНДС 	= Строка.ЦенаСНДС - (Строка.ЦенаСНДС * (ПроцентНалог / (ПроцентНалог + 100))); 
			Строка.НДС			= Строка.ЦенаБЕЗНДС * 0.2;
			Строка.Сумма 		= (Строка.ЦенаБЕЗНДС + Строка.НДС)	* Строка.Количество + Строка.СтоимостьДоставки;
		Иначе 
			Строка.ЦенаСНДС		= 0;  
			Строка.НДС			= 0;
			Строка.Сумма 		= (Строка.ЦенаБЕЗНДС + Строка.НДС )	* Строка.Количество + Строка.СтоимостьДоставки;	 
		КонецЕсли; 		
	Иначе 
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текс = "Организация не указанна";
		Сообщение.Сообщить();
	КонецЕсли; 
	Объект.СуммаДокумента = Объект.ЗакупленныйТовар.Итог("Сумма");	
КонецПроцедуры

&НаКлиенте
Процедура ЗакупленныйТоварЦенаБЕЗНДСПриИзменении(Элемент)
	
	Строка = Элементы.ЗакупленныйТовар.ТекущиеДанные;
	Если ЗначениеЗаполнено(Объект.Организация) Тогда 
		ПроцентНалог 		= ПолучитьНалогОрганизации(Объект.Организация); 
		Если ПроцентНалог > 0 Тогда 
			Строка.ЦенаСНДС 	= Строка.ЦенаБЕЗНДС + (Строка.ЦенаБЕЗНДС * (ПроцентНалог / 100)); 
			Строка.НДС			= Строка.ЦенаБЕЗНДС * (ПроцентНалог / 100); 
			Строка.Сумма 		= (Строка.ЦенаБЕЗНДС + Строка.НДС )	* Строка.Количество + Строка.СтоимостьДоставки; 
		Иначе 
			Строка.ЦенаСНДС 	= 0; 
			Строка.НДС			= 0; 
			Строка.Сумма 		= (Строка.ЦенаБЕЗНДС + Строка.НДС )	* Строка.Количество + Строка.СтоимостьДоставки; 
		КонецЕсли; 
	КонецЕсли; 
	Объект.СуммаДокумента 	= Объект.ЗакупленныйТовар.Итог("Сумма");	
КонецПроцедуры

&НаКлиенте
Процедура ЗакупленныйТоварКоличествоПриИзменении1(Элемент)
	ПересчитьСтоимостьДоставкиТоваров(); 
//	Строка = Элементы.ЗакупленныйТовар.ТекущиеДанные; 
//	Строка.Сумма = (Строка.ЦенаБЕЗНДС + Строка.НДС + Строка.СтоимостьДоставки)	* Строка.Количество; 
//	Объект.СуммаДокумента = Объект.ЗакупленныйТовар.Итог("Сумма");	
	
КонецПроцедуры



























































#КонецОбласти 




































































	
	
	
	
	
	
	
	
	
	
	
	
	
	
	