Процедура ОбработатьНовыеЗаказы() Экспорт
	текст = ЗапроситьНовыеЗаказы();
	результат = JSONm.дт_ПрочитатьJSON(текст, Истина,Ложь);
	Для Каждого строка Из результат Цикл
		док = Документы.ЗаказыССайта.СоздатьДокумент();
		док.НомерССайта = строка.Получить("id");
		док.Статус=Справочники.СтатусЗаказа.НайтиПоРеквизиту("СтатусССайта",строка.Получить("status"));
		док.НомерТелефона=строка.Получить("suser").Получить("phone");
		польз = НайтиКлиента(док.НомерТелефона);
		Если польз = Справочники.Клиенты.ПустаяСсылка() Тогда
			клиент = Справочники.Клиенты.СоздатьЭлемент();
			клиент.Email=строка.Получить("suser").Получить("email");
			клиент.Телефон= "+7"+строка.Получить("suser").Получить("phone");
			клиент.Наименование = "Клиент с Сайта "+строка.Получить("suser").Получить("name")+
			                        " "+строка.Получить("suser").Получить("fname")+ 
									" "+строка.Получить("suser").Получить("lname");
			клиент.ФИО=строка.Получить("suser").Получить("fname")+" "+строка.Получить("suser").Получить("lname");
			// ++ obrv 24.01.18
			Клиент.ТипКлиента = ПредопределенноеЗначение("Перечисление.дт_ТипыКлиентов.ФизЛицо");
			// -- obrv 24.01.18
			клиент.Записать();
			док.Клиент=клиент.Ссылка;
		Иначе
			док.Клиент=польз;
		КонецЕсли;
		сумма = 0;
		Для Каждого товар Из строка.Получить("order_item") Цикл
			Если товар.Получить("isnew") = 0 Тогда 
				стр=док.Товары.Добавить();
				стр.Деталь = Справочники.Номенклатура.НайтиПоКоду(Формат(товар.Получить("id1c"), "ЧЦ=9; ЧВН=; ЧГ=0"));
				стр.Количество=товар.Получить("kolvo");
				стр.Цена=товар.Получить("price");
				сумма = сумма + стр.Количество * стр.Цена;
			КонецЕсли;
			Если товар.Получить("isnew") = 3 Тогда 
				стр=док.Товары.Добавить();
				стр.Дельфин = "Деталь из Волжска. Код 1С "+Формат(товар.Получить("id1c"), "ЧЦ=9; ЧВН=; ЧГ=0");
				стр.Количество=товар.Получить("kolvo");
				стр.Цена=товар.Получить("price");
				сумма = сумма + стр.Количество * стр.Цена;
			КонецЕсли
		КонецЦикла;
		док.Сумма = сумма;
		док.ПрофильКлиентаНаСайте = "https://www.truckdonor.ru/profile/"+Формат(строка.Получить("suser_id"), "ЧВН=; ЧГ=0");
		док.Дата = ТекущаяДата();
		док.ДатаОбновления = ТекущаяДата();
		док.Записать();
	КонецЦикла;
	
КонецПроцедуры

Функция ЗапроситьНовыеЗаказы() Экспорт
	   дат = Константы.ДатаПоследнегоЗапросаНаСайт1.Получить();
	   запрдат = ТекущаяДата();
	   Если дат = '00010101000000' Тогда
       		дат = ТекущаяДата(); 	
	   КонецЕсли;
	   Константы.ДатаПоследнегоЗапросаНаСайт1.Установить(запрдат);
       Попытка
        WinHttp = Новый COMОбъект("WinHttp.WinHttpRequest.5.1");
        WinHttp.Option(2,"utf-8");
        WinHttp.Open("POST","http://www.truckdonor.ru/api/getorders",0);
        WinHttp.SetRequestHeader("Accept-Language", "ru");
        WinHttp.SetRequestHeader("Accept-Charset","utf-8");
        WinHttp.setRequestHeader("Content-Language", "ru");
        WinHttp.setRequestHeader("Content-Charset", "utf-8");
        WinHttp.setRequestHeader("Content-type", "application/x-www-form-urlencoded; charset=utf-8");
		дата = Формат(дат, "ДФ=""гггг-ММ-дд ЧЧ:мм:сс""");
        ПараметрыПОСТ = "mindate=" + дата + "&status=1&authtoken=osaidfys-7d89f6sa-f9a45l-vsy-sdaf43sd345";
        WinHttp.Send(ПараметрыПОСТ);
        ТекстОтвета = WinHttp.ResponseText();
		Возврат ТекстОтвета;
    Исключение
        Сообщить(ОписаниеОшибки());
	КонецПопытки;
КонецФункции

	
Функция НайтиКлиента(Телефон)
	запрос = новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	                      |	СправочникКлиенты.Ссылка,
	                      |	СправочникКлиенты.ВерсияДанных,
	                      |	СправочникКлиенты.ПометкаУдаления,
	                      |	СправочникКлиенты.Предопределенный,
	                      |	СправочникКлиенты.Код,
	                      |	СправочникКлиенты.Наименование,
	                      |	СправочникКлиенты.ФИО,
	                      |	СправочникКлиенты.Телефон,
	                      |	СправочникКлиенты.Страна,
	                      |	СправочникКлиенты.Город,
	                      |	СправочникКлиенты.Скидка,
	                      |	СправочникКлиенты.Комментарий,
	                      |	СправочникКлиенты.ПолноеНаименование,
	                      |	СправочникКлиенты.ИНН,
	                      |	СправочникКлиенты.КПП,
	                      |	СправочникКлиенты.КодПоОКПО,
	                      |	СправочникКлиенты.ЮридическийАдрес,
	                      |	СправочникКлиенты.ФактическийАдрес,
	                      |	СправочникКлиенты.РеквизитТелефон
	                      |ИЗ
	                      |	Справочник.Клиенты КАК СправочникКлиенты ГДЕ СправочникКлиенты.Телефон ПОДОБНО ""%"+Телефон+"%""";
	рез = запрос.Выполнить().Выгрузить();
	Если рез.Количество() > 0 Тогда
		возврат рез.Получить(0).Ссылка;
	КонецЕсли;
	Возврат Справочники.Клиенты.ПустаяСсылка();
КонецФункции
