
&НаКлиенте
Процедура Сформировать(Команда)
	
	ТекстОшибки = "";
	Если НЕ ГенераторШтрихКодаКлиент.УстановитьКомпонентуШтрихКодирования(ТекстОшибки) Тогда 
		Сообщить("Использование компоненты штрихкодирования в тонком и веб-клиенте невозможна..." + Символы.ПС + ТекстОшибки);	
	КонецЕсли;
	
	Если НЕ СформироватьНаСервере() Тогда 
		Сообщить("Использование компоненты штрихкодирования завершилась ошибкой..." + Символы.ПС + ТекстОшибки);	
	КонецЕсли;
		
КонецПроцедуры


&НаСервере
Функция СформироватьНаСервере()
	
	
	ПолеКартинки = "";
	
	
	ТекстОшибки = "";
	ШК = ГенераторШтрихКода.ПолучитьКомпонентуШтрихКодирования(ТекстОшибки);
	
	Если ШК = Неопределено Тогда 
		Возврат Ложь;	
	КонецЕсли;
	
	
	//Если всё ок - формируем
	//(все свойства компоненты - см.в отладчике)
	ШК.Ширина			= 200;
	ШК.Высота			= 100;
	ШК.ТипКода			= 1; //1 - EAN13 (одномерный), 16 - QR-код (двумерный)
	ШК.УголПоворота		= 0;
	ШК.ЗначениеКода		= СтрокаШК;
	ШК.ПрозрачныйФон	= Истина;
	ШК.ОтображатьТекст	= Истина; //для QR-кода отключить
	
	ДвоичныйШК = ШК.ПолучитьШтрихкод(); //штрихкод в двоичных данных
	КартинкаШК = Новый Картинка(ДвоичныйШК, Истина);
	
	ПолеКартинки = ПоместитьВоВременноеХранилище(КартинкаШК, УникальныйИдентификатор);
	
	
	Возврат Истина; 
	
КонецФункции





&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СтрокаШК = "1234567890123";
КонецПроцедуры

&НаКлиенте
Процедура УстановитьКомпонентуШтрихКода(Команда)
	ТекстОшибки = "";
	Если НЕ ГенераторШтрихКодаКлиент.УстановитьКомпонентуШтрихКодирования(ТекстОшибки) тогда
		Сообщить("Использование невозможно");
	КонецЕсли
	
КонецПроцедуры
