
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ПоказатьЗначение(, Элемент.ТекущиеДанные.Ссылка);
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ЗаполнениеПодвала();
КонецПроцедуры

Процедура ЗаполнениеПодвала()
    Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ЭтотОбъект.ЭтаФорма.Элементы.КоличествоАвтомобилей.ГоризонтальноеПоложениеВПодвале  = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Клиентыобработанные.ГоризонтальноеПоложениеВПодвале    = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.КоличествоКлиентов.ГоризонтальноеПоложениеВПодвале     = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.КоличествоЗвонков.ГоризонтальноеПоложениеВПодвале 		= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаПоступлений.ГоризонтальноеПоложениеВПодвале 	 	= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Длительность.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.КолвоПродаж.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаПродаж.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.КолвоЗаявок.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Исходящие.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Входящие.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Наличные.ГоризонтальноеПоложениеВПодвале				= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Безнал.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Дельта.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
	
    ЭтотОбъект.ЭтаФорма.Элементы.КоличествоАвтомобилей.ТекстПодвала  =  Формат(Результат.Итог("КоличествоАвтомобилей"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Клиентыобработанные.ТекстПодвала    =  Формат(Результат.Итог("Клиентыобработанные"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.КоличествоКлиентов.ТекстПодвала     =  Формат(Результат.Итог("КоличествоКлиентов"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.КоличествоЗвонков.ТекстПодвала 	 =  Формат(Результат.Итог("КоличествоЗвонков"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаПоступлений.ТекстПодвала 	 	 =  Формат(Результат.Итог("СуммаПоступлений"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Длительность.ТекстПодвала 		 	 =  Формат(Результат.Итог("Длительность"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.КолвоПродаж.ТекстПодвала 			 =  Формат(Результат.Итог("КолвоПродаж"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаПродаж.ТекстПодвала 			 =  Формат(Результат.Итог("СуммаПродаж"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.КолвоЗаявок.ТекстПодвала 		 	 =  Формат(Результат.Итог("КолвоЗаявок"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Исходящие.ТекстПодвала 			 =  Формат(Результат.Итог("Исходящие"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Входящие.ТекстПодвала 			 	 =  Формат(Результат.Итог("Входящие"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Наличные.ТекстПодвала 			 	 =  Формат(Результат.Итог("Наличные"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Безнал.ТекстПодвала 				 =  Формат(Результат.Итог("Безнал"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Дельта.ТекстПодвала 				 =  Формат(Результат.Итог("Дельта"),"ЧДЦ=0; ЧН=-");
КонецПроцедуры
