&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	КоличествоПродажИНеудЗаявок.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоГода(ТекущаяДата()));
	КоличествоПродажИНеудЗаявок.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецГода(ТекущаяДата()));
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	КоличествоПродажИНеудЗаявок.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодОтчета.ДатаНачала);
	КоличествоПродажИНеудЗаявок.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодОтчета.ДатаОкончания);
КонецПроцедуры