
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ГомзМА 14.04.2023
	Список.Параметры.УстановитьЗначениеПараметра("Дата", 	ТекущаяДатаСеанса());
	Список.Параметры.УстановитьЗначениеПараметра("Группа", 	Справочники.МестаХраненияТМЦ.НайтиПоКоду("000000052"));
	///-ГомзМА 14.04.2023
	
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	///+ГомзМА 25.04.2023
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ТекДанные = Элементы.Список.ТекущаяСтрока;
		ИнвентарныеНомера.Параметры.УстановитьЗначениеПараметра("Владелец", ТекДанные);
	КонецЕсли;
	///-ГомзМА 25.04.2023
	
КонецПроцедуры



#КонецОбласти


#Область ОбработчикиКомандФормы 

&НаКлиенте
Процедура СоздатьПоступление(Команда)
	
	///+ГомзМА 26.04.2023
	ТекДанные = Элементы.Список.ТекущиеДанные;
	
	Документ = СоздатьДокументПоступление(ТекДанные.Код);
	
	ПараметрыФормы = Новый Структура("Ключ", Документ);
	ОткрытьФорму("Документ.ПоступлениеТМЦСкладСнабжение.ФормаОбъекта", ПараметрыФормы);
	///-ГомзМА 26.04.2023
	
КонецПроцедуры


&НаКлиенте
Процедура СоздатьПеремещение(Команда)
	
	///+ГомзМА 26.04.2023
	ТекДанные = Элементы.ИнвентарныеНомера.ТекущиеДанные;
	
	Документ = СоздатьДокументПеремещениеТМЦ(ТекДанные.Наименование);
	
	
	ПараметрыФормы = Новый Структура("Ключ", Документ);
	ОткрытьФорму("Документ.ПеремещениеТМЦ.ФормаОбъекта", ПараметрыФормы);
	///-ГомзМА 26.04.2023
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

	&НаСервере
Функция СоздатьДокументПоступление(Код);

	///+ГомзМА 26.04.2023
	НовыйДокумент 			 	= Документы.ПоступлениеТМЦСкладСнабжение.СоздатьДокумент();
	НовыйДокумент.Дата  	 	= ТекущаяДатаСеанса();
	НовыйДокумент.Склад 	 	= Справочники.МестаХраненияТМЦ.НайтиПоКоду("000000001");
	НовыйДокумент.Ответственный = Пользователи.ТекущийПользователь();
	
	НовыйДокументТЧ 		 	= НовыйДокумент.СписокТМЦ.Добавить();
	НовыйДокументТЧ.ТМЦ 	 	= Справочники.СкладСнабжение.НайтиПоКоду(Код);
	НовыйДокументТЧ.Код 		= НовыйДокументТЧ.ТМЦ.Код;
	НовыйДокументТЧ.ТипУчета 	= Перечисления.ТипУчетаТМЦ.УчестьПоштучно;
	НовыйДокументТЧ.Склад 	 	= Справочники.МестаХраненияТМЦ.НайтиПоКоду("000000001");
	НовыйДокументТЧ.Количество 	= 1;
	
	НовыйДокумент.Записать();
	Возврат НовыйДокумент.Ссылка;
	///-ГомзМА 26.04.2023

КонецФункции // СоздатьДокументПоступление(Код);


&НаСервере
Функция СоздатьДокументПеремещениеТМЦ(Наименование);

	///+ГомзМА 26.04.2023
	НовыйДокумент 			 		= Документы.ПеремещениеТМЦ.СоздатьДокумент();
	НовыйДокумент.Дата  	 		= ТекущаяДатаСеанса();
	НовыйДокумент.Ответственный 	= Пользователи.ТекущийПользователь();
	
	НовыйДокументТЧ 		 		 = НовыйДокумент.СписокТМЦ.Добавить();
	НовыйДокументТЧ.ИнвентарныйНомер = Справочники.ИнвентарныеНомера.НайтиПоНаименованию(Наименование);
	НовыйДокументТЧ.ТМЦ 			 = НовыйДокументТЧ.ИнвентарныйНомер.Владелец;
	НовыйДокументТЧ.СерийныйНомер 	 = НовыйДокументТЧ.ИнвентарныйНомер.СерийныйНомер;
	НовыйДокументТЧ.Количество 	 	 = 1;
	НовыйДокументТЧ.Цена 			 = НовыйДокументТЧ.ИнвентарныйНомер.Стоимость;
	НовыйДокументТЧ.Сумма 			 = НовыйДокументТЧ.Количество * НовыйДокументТЧ.Цена;
	
	НовыйДокумент.Записать();
	Возврат НовыйДокумент.Ссылка;
	///-ГомзМА 26.04.2023

КонецФункции // СоздатьДокументПеремещениеТМЦ(Код);

&НаКлиенте
Процедура ИнвентарныеНомераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ГомзМА 12.05.2023
	ТекСтрока = Элементы.ИнвентарныеНомера.ТекущиеДанные;
	Если Поле = Элементы.ИнвентарныеНомераСсылка Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Ссылка;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Справочник.ИнвентарныеНомера.Форма.ФормаЭлемента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///+ГомзМА 12.05.2023
	
КонецПроцедуры


#КонецОбласти















