#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	

	Если ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.Пользователи") Тогда
		СвойстваПользователя = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Наименование,ФИО");
		
		Если ЗначениеЗаполнено(СвойстваПользователя.ФИО) Тогда
			ФИО = СвойстваПользователя.ФИО;
		Иначе
			ФИО = СвойстваПользователя.Наименование;
		КонецЕсли;	
		
		Наименование = ФИО;
		
		дт_СотрудникиКлиентСервер.ОбновитьФИО(ЭтотОбъект);
		
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли