Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	//СтандартнаяОбработка = Ложь;
	//Параметры.Вставить("ПолнотекстовыйПоиск",  ПолнотекстовыйПоискПриВводеПоСтроке.Использовать);
КонецПроцедуры

Процедура ПечатьЦенника(ТабДок, Ссылка) Экспорт
/// Комлев 09/07/24 +++
	Макет = ПолучитьМакет("Ценник");
	Область = Макет.ПолучитьОбласть("Ценник | Столбец");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Артикул,
	|	Номенклатура.Код,
	|	Номенклатура.Наименование,
	|	Номенклатура.РекомендованаяЦена
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	ТабДок.Очистить();
	ТекДата = Формат(ТекущаяДата(), "ДЛФ=DD;");

	Номер = 0;
	Пока Выборка.Следующий() Цикл

		Область.Параметры.Заполнить(Выборка);
		Область.Параметры.ЦенаРекомендованая = Выборка.РекомендованаяЦена;
		Область.Параметры.ТекущаяДата = ТекДата;
		Если Номер < 3 Тогда
			ТабДок.Присоединить(Область);
			Номер = Номер + 1;

		Иначе
			Номер = 1;
			ТабДок.Вывести(Область);
		КонецЕсли;

		Если СтрДлина(Выборка.Наименование) > 45 Тогда
			ЯчейкаНаименование = Неопределено;
			Пока ЯчейкаНаименование = Неопределено Цикл
				ЯчейкаНаименование = ТабДок.НайтиТекст(Выборка.Наименование);
				НовыйШрифт = Новый Шрифт(, 8);
				ЯчейкаНаименование.Шрифт = НовыйШрифт;
				ЯчейкаНаименование.АвтоВысотаСтроки = Истина;
				ЯчейкаНаименование.РазмещениеТекста=ТипРазмещенияТекстаТабличногоДокумента.Переносить;
				
			КонецЦикла;

		КонецЕсли;

		Если Не ТабДок.ПроверитьВывод(Область) Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
	КонецЦикла;
	
	/// Комлев 09/07/24 ---
КонецПроцедуры