#Область ПрограммныйИнтерфейс

// Выполняет движения регистра накопления РасчетыСПоставщиками
//
Процедура ОтразитьРасчетыСПоставщиками(ПараметрыПроведения, Движения, Отказ) Экспорт
	
	ТаблицыДляДвижения = Новый Массив();
	ТаблицыДляДвижения.Добавить("ТаблицаРасчетыСПоставщиками");
	
	
	ТаблицаДвижения = Неопределено;
	
	Для каждого ИмяТаблицы Из ТаблицыДляДвижения Цикл
	
		Если ПараметрыПроведения.Свойство(ИмяТаблицы) Тогда
			
			Если ТаблицаДвижения = Неопределено Тогда
				ТаблицаДвижения = ПараметрыПроведения[ИмяТаблицы].Скопировать();
			Иначе
				ОбщегоНазначенияКлиентСервер.ДополнитьТаблицу(ПараметрыПроведения[ИмяТаблицы], ТаблицаДвижения);
			КонецЕсли;
			
		КонецЕсли;
	
	КонецЦикла;
	
	Если Отказ
	 ИЛИ ТаблицаДвижения = Неопределено 
	 ИЛИ ТаблицаДвижения.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	
	ДвиженияНабор = Движения.РасчетыСПоставщиками;
	ДвиженияНабор.Записывать = Истина;
	ДвиженияНабор.Загрузить(ТаблицаДвижения);
	
КонецПроцедуры


// Готовит к записи наборы записей документа (только по регистрам, входящих в подсистему)
//
Процедура ПодготовитьНаборыЗаписей(СтруктураОбъект) Экспорт
	
	РегистрыПодсистемы = Новый Массив;
	РегистрыПодсистемы.Добавить("РасчетыСПоставщиками");
	
	Для каждого Регистр Из РегистрыПодсистемы Цикл
	
		НаборЗаписей = СтруктураОбъект.Движения.Найти(Регистр);
		
		Если НаборЗаписей <> Неопределено Тогда
			Если НЕ НаборЗаписей.ДополнительныеСвойства.Свойство("ДляПроведения") Тогда
				
				НаборЗаписей.ДополнительныеСвойства.Вставить("ДляПроведения", Новый Структура);
				
			КонецЕсли;
			
			Если НЕ НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Свойство("СтруктураВременныеТаблицы") Тогда
				
				НаборЗаписей.ДополнительныеСвойства.ДляПроведения.Вставить("СтруктураВременныеТаблицы", СтруктураОбъект.ДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы);
				
			КонецЕсли;
			
			//РегистрыНакопления[Регистр].СоздатьПустуюВременнуюТаблицуИзменение(СтруктураОбъект.ДополнительныеСвойства);
		
		КонецЕсли;
	
	КонецЦикла; 
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти