#Область ОбработчикиСобытий

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ТатарМА 09.12.2024
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	НоменклатураАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	НоменклатураАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Категории", МассивКатегорийШин);
	НоменклатураАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	НоменклатураАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	///-ТатарМА 09.12.2024
	
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураАвитоЧасть1ПриАктивизацииСтроки(Элемент)
	
	///+ТатарМА 09.12.2024
	Если Элементы.ТоварыАвитоЧасть1.ТекущиеДанные <> Неопределено Тогда
		ТекДанные = Элементы.Список.ТекущаяСтрока;
		УстановитьПараметрыЗапросаАвитоЧасть1(ТекДанные);
	КонецЕсли;
	///-ТатарМА 09.12.2024
	
КонецПроцедуры


&НаКлиенте
Процедура НоменклатураАвитоЧасть1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ТатарМА 09.12.2024
	ТекСтрока = Элементы.НоменклатураАвитоЧасть1.ТекущиеДанные;
	Если Поле = Элементы.НоменклатураАвитоЧасть1индкодВладелецСсылка Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.НоменклатураАвитоЧасть1индкодВладелецСсылка;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///-ТатарМА 09.12.2024

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура УстановитьПараметрыЗапросаАвитоЧасть1(ТекДанные)
	
	///+ТатарМА 09.12.2024
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Владелец", ТекДанные);
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Склад", ТекДанные);
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Категории", МассивКатегорийШин);
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	ТоварыАвитоЧасть1.Параметры.УстановитьЗначениеПараметра("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	///-ТатарМА 09.12.2024
	
КонецПроцедуры

#КонецОбласти