
&НаКлиенте
Процедура Команда1(Команда)
	// Вставить содержимое обработчика.
	ККК();
КонецПроцедуры

&НаСервере
Процедура ККК()
	Сообщить("Глав");
	Сообщить(ТекущаяДата());
	
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Код,
	               |	Номенклатура.Наименование,
	               |	Номенклатура.Артикул,
	               |	Номенклатура.НомерПроизводителя,
	               |	Номенклатура.МестоНаСкладе2,
	               |	РегистрНакопления1Остатки.КолвоОстаток,
	               |	Номенклатура.Бренд,
	               |	Номенклатура.Описание,
	               |	Номенклатура.Ссылка,
	               |	Номенклатура.Комплектность.(
	               |		НомерПоиск,
	               |		Артикул,
	               |		Наименование,
	               |		Количество
	               |	),
	               |	Номенклатура.Категория,
	               |	Номенклатура.КрупныйАгрегат,
	               |	Номенклатура.НомераЗамен.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		НомерЗамены
	               |	),
	               |	Номенклатура.Видео,
	               |	Номенклатура.РекомендованаяЦена,
	               |	Номенклатура.НаСайтеТракДонор,
	               |	Номенклатура.Производитель.Ссылка КАК произв1,
	               |	Номенклатура.catauto,
	               |	Номенклатура.Вес,
	               |	Номенклатура.Объем,
	               |	Номенклатура.ДляТэгов.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Реквизит1,
	               |		Реквизит1.Код Как кд
	               |	),
	               |	Номенклатура.ЕстьТэги,
	               |	Номенклатура.Диаметр,
	               |	Номенклатура.ШагРезьбы,
	               |	Номенклатура.Прочность,
	               |	Номенклатура.ТипКрепеж,
	               |	Номенклатура.Длина,
	               |	Номенклатура.ВнутреннийДиаметр,
	               |	Номенклатура.podkategoria,
	               |	Номенклатура.Толщина,
	               |	Номенклатура.Предложения.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Реквизит1
	               |	),
	               |	Номенклатура.длин,
	               |	Номенклатура.шир,
	               |	Номенклатура.выс,
	               |	Номенклатура.ЭтоНоваяЗапчасть,
	               |	Номенклатура.catauto.catauto
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	               |		ПО Номенклатура.Ссылка = РегистрНакопления1Остатки.Товар";
	результат = Запрос.Выполнить();
	таблица = результат.Выгрузить();
	док = "<?xml version='1.0' encoding='UTF-8'?><info><kod>ByTdEt87&id1c</kod><items>";
	Сообщить("Глав");
	Сообщить(ТекущаяДата());
	Для Каждого номстрока из таблица Цикл

		Компл = "";
		Компл2 = "";
		компл21 = "";
		Для Каждого кпл из номстрока.Комплектность Цикл
			Компл = Компл + "/"+кпл.НомерПоиск;
			компл21 = компл21 + "<komplitem><nomer>"+кпл.Артикул+"</nomer><name>"+кпл.Наименование+"</name><kolvo>"+кпл.Количество+"</kolvo></komplitem>";
		КонецЦикла;
		Для Каждого кпл из номстрока.НомераЗамен Цикл
			Компл = Компл + "/"+кпл.НомерЗамены;
		КонецЦикла;
		Компл = Компл + "/";
		насайте = 0;
		Если номстрока.НаСайтеТракДонор = ИСТИНА Тогда
			насайте = 1
		КонецЕсли;
		крепеж = "<krep_info>";
		Если номстрока.Категория.код = "000000148" Тогда
			крепеж=крепеж + "<type>"+номстрока.ТипКрепеж+"</type><diametr>"+номстрока.Диаметр+"</diametr><shag>"+
			номстрока.ШагРезьбы+"</shag><dlina>"+номстрока.Длина+"</dlina><prochnost>"+номстрока.Прочность+
			"</prochnost><wd>"+номстрока.ВнутреннийДиаметр+"</wd><tol>"+номстрока.Толщина+"</tol>";
		КонецЕсли;
		крепеж=крепеж + "</krep_info>";
		цена = номстрока.РекомендованаяЦена;
		кагг = 0;
		Если номстрока.КрупныйАгрегат = Истина Тогда
			кагг = 1;
		КонецЕсли;
		ет = 0;
		Если номстрока.ЕстьТэги = Истина Тогда
			ет = 1;
		КонецЕсли;
		эт_н=0;
		Если номстрока.ЭтоНоваяЗапчасть = Истина Тогда
			эт_н=1;
		КонецЕсли;
		
		тд=0;		
		док = док + "<item><id1c>"+номстрока.Код + "</id1c><name>"+номстрока.Наименование + "</name><oe>"+номстрока.Артикул + "</oe>
		| <analog>"+номстрока.НомерПроизводителя + "</analog><brend>"+номстрока.Бренд + "</brend><price>"+Формат(цена,"ЧРГ=;ЧРД=.;") + "</price>
		| <warehouse>"+номстрока.МестоНаСкладе2 + "</warehouse><kolvo>"+номстрока.КолвоОстаток + "</kolvo><kompl>"+Компл + "</kompl><kompl2>"+компл21 + "</kompl2>
		| <cat>"+номстрока.Категория.Код + "</cat><sitecat>"+номстрока.произв1 + "</sitecat><bigagg>"+кагг + "</bigagg><vidlink>"+номстрока.Видео + "</vidlink>
		| <pr_exp>"+номстрока.РекомендованаяЦена + "</pr_exp><podkat>"+номстрока.podkategoria.Код+"</podkat>
		| <weigth>"+номстрока.Вес+"</weigth><volume>"+номстрока.Объем+"</volume>
		| <ontd>"+насайте + "</ontd><partdescr>"+номстрока.Описание + "</partdescr>
		| <dlin>"+номстрока.длин+"</dlin><shir>"+номстрока.шир+"</shir><isnew>"+эт_н+"</isnew><vis>"+номстрока.выс+"</vis>
		| <catauto>"+номстрока.catauto.catauto+"</catauto><hastags>"+ет+"</hastags>"+крепеж;

		Если номстрока.ЕстьТэги = Истина Тогда
			док = док + "<tags>";
			Для каждого тэг Из номстрока.ДляТэгов Цикл
				док = док + "<tag>"+тэг.кд+"</tag>";
			КонецЦикла;
			док = док + "</tags>";
		КонецЕсли;

		док = док + "<predlozenia>";
			Для каждого тэг Из номстрока.Предложения Цикл
				док = док + "<predl>"+тэг.Реквизит1.код+"</predl>";
			КонецЦикла;
			док = док + "</predlozenia>";

		док = док + "</item>";
	КонецЦикла;
	док = док + "</items>";
	Сообщить("specpredl");
	Сообщить(ТекущаяДата());

	Запрос.Текст = "ВЫБРАТЬ
	               |	Спецпредложения.Код,
	               |	Спецпредложения.ДатаНачала,
	               |	Спецпредложения.ДатаОкончания,
	               |	Спецпредложения.ДатаОбновления,
	               |	Спецпредложения.Товар.Код как ткод,
	               |	Спецпредложения.Товар.ЭтоНоваяЗапчасть как этн,
	               |	Спецпредложения.Цена
	               |ИЗ
	               |	Справочник.Спецпредложения КАК Спецпредложения";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = док + "<specpredl>";
	Для Каждого пред из рез1 Цикл
		этн = 0;
		Если пред.этн = Истина Тогда
			этн = 1;
		КонецЕсли;
		док = док + "<predl><id>"+пред.Код+"</id><id1c>"+пред.ткод+"</id1c><isnew>"+этн+"</isnew><updated>"+пред.ДатаОбновления+"</updated>
		|<from>"+пред.ДатаНачала+"</from><to>"+пред.ДатаОкончания+"</to>
		|<price>"+пред.Цена+"</price></predl>";
	КонецЦикла;
    док = док + "</specpredl>";
	Сообщить("tags_table");
	Сообщить(ТекущаяДата());

	Запрос.Текст = "ВЫБРАТЬ
	               |	Тэги.Ссылка,
	               |	Тэги.ВерсияДанных,
	               |	Тэги.ПометкаУдаления,
	               |	Тэги.Предопределенный,
	               |	Тэги.Код,
	               |	Тэги.Наименование
	               |ИЗ
	               |	Справочник.Тэги КАК Тэги";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = док + "<tags_table>";
	Для Каждого тэг из рез1 Цикл
		док = док + "<tag><id>"+тэг.Код+"</id><name>"+тэг.Наименование+"</name></tag>";
	КонецЦикла;
	док = док + "</tags_table>";
	док = СтрЗаменить(док,"&","&amp;");
	
	Сообщить("phones");
	Сообщить(ТекущаяДата());
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Клиенты.Телефон
	                |ИЗ
	                |	Справочник.Клиенты КАК Клиенты" ;
	рез1 = Запрос.Выполнить().Выгрузить();
	док = док + "<phones>";
	Для Каждого тел из рез1 цикл
		док = док + "<phone>"+тел.Телефон+"</phone>";
	КонецЦикла;
	док = док + "</phones>";
	
	Сообщить("podkats");
	Сообщить(ТекущаяДата());

	Запрос.Текст = "ВЫБРАТЬ
	               |	Podkategorii.Ссылка,
	               |	Podkategorii.ВерсияДанных,
	               |	Podkategorii.ПометкаУдаления,
	               |	Podkategorii.Предопределенный,
	               |	Podkategorii.Владелец,
	               |	Podkategorii.Код,
	               |	Podkategorii.Наименование,
	               |	Podkategorii.poryadok
	               |ИЗ
	               |	Справочник.Podkategorii КАК Podkategorii";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = док + "<podkats>";
	Для Каждого подкат из рез1 цикл
		док = док + "<podkat><id>"+подкат.Код+"</id><catid>"+подкат.Владелец.Код+"</catid><name>"+подкат.Наименование+"</name><poryadok>"+подкат.poryadok+"</poryadok></podkat>";
	КонецЦикла;
	
	
	запрос333 = Новый Запрос;
запрос333.Текст =  "ВЫБРАТЬ
                   |	ПродажаЗапчастей.ЕстьДоставка,
                   |	ПродажаЗапчастей.ДоставкаНеЗаполнена,
                   |	ПродажаЗапчастей.ТранспортнаяКомпания,
                   |	ПродажаЗапчастей.Вес,
                   |	ПродажаЗапчастей.Объем,
                   |	ПродажаЗапчастей.КоличествоМест,
                   |	ПродажаЗапчастей.ГородОтправки,
                   |	ПродажаЗапчастей.РегионПолучения,
                   |	ПродажаЗапчастей.ГородПолучения,
                   |	ПродажаЗапчастей.СтоимостьДоставки,
                   |	ПродажаЗапчастей.Номер,
                   |	ПродажаЗапчастей.Таблица.(
                   |		Ссылка,
                   |		НомерСтроки,
                   |		Товар,
                   |		Количество,
                   |		Цена,
                   |		Скидка,
                   |		машина,
                   |		цена1,
                   |		Комментарий,
                   |		Сумма
                   |	)
                   |ИЗ
                   |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей" ;
рез = запрос333.Выполнить().Выгрузить();
хмл = "<dostavki>";
Для Каждого стр Из рез Цикл
	Если стр.ЕстьДоставка = Истина И стр.ДоставкаНеЗаполнена = Ложь Тогда
		хмл = хмл + "<dostavka><nomer>"+стр.Номер+"</nomer><from>"+стр.ГородОтправки+"</from><to>"+стр.РегионПолучения.Владелец+", "+стр.РегионПолучения+", г. "+стр.ГородПолучения+"</to><transport>"+стр.ТранспортнаяКомпания+"</transport>
		| <ves>"+стр.Вес+"</ves><obem>"+стр.Объем+"</obem><mest>"+стр.КоличествоМест+"</mest><stoimost>"+стр.СтоимостьДоставки+"</stoimost><tovari>";
		Для каждого стр1 Из стр.Таблица Цикл
			хмл = хмл + "<tovar><id>"+стр1.Товар.Код+"</id><name>"+стр1.Товар.Наименование+"</name><kolvo>"+стр1.Количество+"</kolvo></tovar>"; 
		КонецЦикла;
		хмл = хмл + "</tovari></dostavka>";
	КонецЕсли;
КонецЦикла;
хмл = хмл + "</dostavki>";

	
запрос333.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
                  |	Клиенты.Область,
                  |	Клиенты.Город2,
                  |	Клиенты.Страна2
                  |ИЗ
                  |	Справочник.Клиенты КАК Клиенты";	
	
рез = запрос333.Выполнить().Выгрузить();
хмл = хмл + "<cities>";
Для Каждого стр Из рез Цикл	
		хмл = хмл + "<city><to>"+стр.Страна2+", "+стр.Область+", г. "+стр.Город2+"</to></city>";
КонецЦикла;
хмл = хмл + "</cities>";
	
	
	док = док + "</podkats>"+хмл+"</info>";
    Сообщить("all");
	Сообщить(ТекущаяДата());

	Текст = Новый ЗаписьТекста("d:\Dropbox\Public\sklad.xml", КодировкаТекста.UTF8);
	Текст.ЗаписатьСтроку(док);
	Текст.Закрыть();

	Сообщить("finished");
	Сообщить(ТекущаяДата());

КонецПроцедуры