&НаКлиенте
Процедура Поиск(Команда)
	// Вставить содержимое обработчика.
	Фильтр(Поиск);
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	// Вставить содержимое обработчика.
	Очищение();
КонецПроцедуры


&НаСервере
Функция Фильтр(Поиск) Экспорт
	RegExp = Новый COMОбъект("VBScript.RegExp");
         
	RegExp.IgnoreCase = Ложь; //Игнорировать регистр
	RegExp.Global = Истина; //Поиск всех вхождений шаблона
	RegExp.MultiLine = Истина; //Многострочный режим
			
	RegExp.Pattern = "\W";
	RegExp.Pattern = "[^a-zA-Zа-яА-Я_0-9]";
	стр1=RegExp.Replace( Поиск,"");
	Текст1 = "ВЫБРАТЬ
	| РегистрНакопления1.Регистратор,
	| РегистрНакопления1.ВидДвижения,
	| РегистрНакопления1.Товар,
	| РегистрНакопления1.Машина,
	| РегистрНакопления1.Колво
| ИЗ
	| РегистрНакопления.РегистрНакопления1 КАК РегистрНакопления1"; 
	Текст1 = Текст1	+ " ГДЕ РегистрНакопления1.Товар.Артикул ПОДОБНО """+Поиск+"""
		| ИЛИ РегистрНакопления1.Товар.Наименование ПОДОБНО ""%"+Поиск+"%"" 
		| ИЛИ РегистрНакопления1.Товар.АртикулПоиск ПОДОБНО """+стр1+"""
		| ИЛИ РегистрНакопления1.Товар.Код ПОДОБНО ""%"+Поиск+"""
		| ИЛИ РегистрНакопления1.Товар.НомерПроизводителя ПОДОБНО """+Поиск+"""
		| ИЛИ РегистрНакопления1.Товар.НомерПоиск ПОДОБНО """+стр1+"""";
	Реквизит1.ТекстЗапроса = Текст1;    
КонецФункции


&НаСервере
Функция Очищение() Экспорт
	Реквизит1.ТекстЗапроса = "ВЫБРАТЬ
	| РегистрНакопления1.Регистратор,
	| РегистрНакопления1.ВидДвижения,
	| РегистрНакопления1.Товар,
	| РегистрНакопления1.Машина,
	| РегистрНакопления1.Колво
| ИЗ
	| РегистрНакопления.РегистрНакопления1 КАК РегистрНакопления1";

КонецФункции


