&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьИтоги();
	
КонецПроцедуры



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// ++ obrv 12.03.20
	//ОбновитьОбщ();
	// -- obrv 12.03.20
КонецПроцедуры

&НаСервере
Процедура ОбновитьОбщ()
	з = новый запрос;
	з.Текст = "ВЫБРАТЬ
	          |	Сумма(ЛичныйВывод.Сумма) как сумма
	          |ИЗ
	          |	Документ.ЛичныйВывод КАК ЛичныйВывод
	          |ГДЕ
	          |	ЛичныйВывод.Проведен = ИСТИНА
	          |	И ЛичныйВывод.Кому = &Кому";
	з.УстановитьПараметр("Кому", Перечисления.Учеридители.Александр);
	Александр = з.Выполнить().Выгрузить().Итог("сумма");
	
	з.УстановитьПараметр("Кому", Перечисления.Учеридители.Андрей);
	Андрей = з.Выполнить().Выгрузить().Итог("сумма");
	
	з.УстановитьПараметр("Кому", Перечисления.Учеридители.Василий);
	Василий = з.Выполнить().Выгрузить().Итог("сумма");
	
	з.УстановитьПараметр("Кому", Перечисления.Учеридители.Никита);
	Никита = з.Выполнить().Выгрузить().Итог("сумма");
КонецПроцедуры


&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	// ++ obrv 12.03.20
	//ОбновитьОбщ();
	ОбновитьИтоги();
	// -- obrv 12.03.20
	
	Оповестить("ОстаткиБалансИзменение");
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура ОбновитьИтоги()

	
	// Удалить с формы реквизиты вида П1, П2, ...
	//РеквизитыКУдалению = Новый Массив();
	//РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	//Для каждого РеквизитФормы Из РеквизитыФормы Цикл
	//	
	//	Если Лев(РеквизитФормы.Имя, 1) = "П"
	//		И СтроковыеФункцииКлиентСервер.ТолькоЦифрыВСтроке(Сред(РеквизитФормы.Имя, 2)) Тогда
	//		
	//		РеквизитыКУдалению.Добавить(РеквизитФормы.Имя);
	//		
	//	КонецЕсли;
	//	
	//КонецЦикла;
	//
	//Если РеквизитыКУдалению.Количество() <> 0 Тогда
	//	ЭтаФорма.ИзменитьРеквизиты(, РеквизитыКУдалению);
	//КонецЕсли;
	
	
	Запрос = новый запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СУММА(ЛичныйВывод.Сумма) КАК сумма,
	|	ЛичныйВывод.Учредитель КАК Учредитель
	|ИЗ
	|	Документ.ЛичныйВывод КАК ЛичныйВывод
	|ГДЕ
	|	ЛичныйВывод.Проведен
	|
	|СГРУППИРОВАТЬ ПО
	|	ЛичныйВывод.Учредитель
	|
	|УПОРЯДОЧИТЬ ПО
	|	Учредитель
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Индекс = 0;
	Пока Выборка.Следующий() Цикл
		
		ВывестиПоказатель(Выборка.Учредитель, Выборка.Сумма, Индекс);
		Индекс = Индекс + 1;
		
	КонецЦикла;
	
	// Элементы с Индекс скрыть
	Пока Истина Цикл
		ИмяПоля = СтрШаблон("П%1", Формат(Индекс, "ЧГ=0"));
		Элемент = Элементы.Найти(ИмяПоля);
		Если Элемент = Неопределено Тогда
			Прервать
		КонецЕсли;
		Элементы.Удалить(Элемент);
		Индекс = Индекс + 1;
	КонецЦикла;
	

КонецПроцедуры // ОбновитьИтоги()

&НаСервере
Функция ЕстьРеквизитФормы(Имя)

	РеквизитыФормы = ЭтаФорма.ПолучитьРеквизиты();
	Для каждого РеквизитФормы Из РеквизитыФормы Цикл
	
		Если РеквизитФормы.Имя = Имя Тогда 
			Возврат Истина;
		КонецЕсли;
	
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции // ЕстьРеквизитФормы()


&НаСервере
Процедура НайтиСоздатьРеквизитФормы(ИмяПоля, СинонимПоля)
	
	Если НЕ ЕстьРеквизитФормы(ИмяПоля) Тогда
		
		Реквизиты = Новый Массив; 
		Реквизиты.Добавить(Новый РеквизитФормы(ИмяПоля, Новый ОписаниеТипов("Число"),  , , Ложь));
		
		ЭтаФорма.ИзменитьРеквизиты(Реквизиты);
		
	КонецЕсли;
	

	Элемент = Элементы.Найти(ИмяПоля);
	
	Если Элемент = Неопределено Тогда
		
		Элемент = Элементы.Добавить(ИмяПоля, Тип("ПолеФормы"), Элементы.ГруппаИтоги);
		Элемент.ПутьКДанным = ИмяПоля;
		Элемент.Вид = ВидПоляФормы.ПолеВвода;
		Элемент.ТолькоПросмотр = Истина;
		Элемент.Ширина = 10;
		Элемент.РастягиватьПоГоризонтали = Ложь;
		
	КонецЕсли;
	
	Элемент.Заголовок = СинонимПоля;
	
КонецПроцедуры // НайтиСоздатьРеквизитФормы()

	

&НаСервере
Процедура ВывестиПоказатель(Показатель, Значение, Индекс)

	Если НЕ ЗначениеЗаполнено(Показатель) Тогда
		Возврат
	КонецЕсли;
	
	СинонимПоля = Строка(Показатель);
	ИмяПоля = СтрШаблон("П%1", Формат(Индекс, "ЧГ=0"));//СтрЗаменить(СинонимПоля, " ", "");
	
	НайтиСоздатьРеквизитФормы(ИмяПоля, СинонимПоля);
	
	ЭтаФорма[ИмяПоля] = Значение;
	

КонецПроцедуры // ВывестиПоказатель()

