#Область ПрограммныйИнтерфейс

// Формирует массив реквизитов документа. 
// 
// Параметры: 
//  ИмяДокумента - Строка - имя документа.
//
// Возвращаемое значение:
//   Массив - массив наименований реквизитов документа. 
//
Функция МассивРеквизитовОбъектаДляФормированияПредставления(ИмяДокумента) Экспорт
	
	МассивДопРеквизитов = Новый Массив;
	
	Объект = Метаданные.Документы.Найти(ИмяДокумента);
	
	Если Объект = Неопределено Тогда
		Объект =  Метаданные.Справочники.Найти(ИмяДокумента);
	КонецЕсли;
	
	Если Объект = Неопределено Тогда
		Возврат МассивДопРеквизитов;
	КонецЕсли;
	
		
	Если ОбщегоНазначения.ЕстьРеквизитОбъекта("Комментарий", Объект) Тогда
		МассивДопРеквизитов.Добавить("Комментарий");
	КонецЕсли;
	
	Возврат МассивДопРеквизитов
	
КонецФункции

// Получает представление документа для печати.
//
// Параметры:
//  Выборка  - КоллекцияДанных - структура или выборка из результатов запроса
//                 в которой содержатся дополнительные реквизиты, на основании
//                 которых можно сформировать переопределенное представление 
//                 документа для вывода в отчет "Структура подчиненности".
//
// Возвращаемое значение:
//   Строка,Неопределено   - переопределенное представление документа, или Неопределено,
//                           если для данного типа документов такое не задано.
//
Функция ПредставлениеОбъектаДляВыводаВОтчет(Выборка) Экспорт
	
	
	
	Возврат Неопределено;
	
КонецФункции

// Возвращает имя реквизита документа, в котором содержится информация о Сумме и Валюте документа для вывода в
// структуру подчиненности.
// По умолчанию используются реквизиты Валюта и СуммаДокумента. Если для конкретного документа или конфигурации в целом
// используются другие
// реквизиты, то переопределить значения по умолчанию можно в данной функции.
//
// Параметры:
//  ИмяДокумента  - Строка - имя документа, для которого надо получить имя реквизита.
//  Реквизит      - Строка - Строка, может принимать значения "Валюта" и "СуммаДокумента".
//
// Возвращаемое значение:
//   Строка   - Имя реквизита документа, в котором содержится информация о Валюте или Сумме.
//
Функция ИмяРеквизитаДокумента(ИмяДокумента, Реквизит) Экспорт
	
	Если Реквизит = "СуммаДокумента" Тогда
		
		Если ИмяДокумента = "Расходы" Тогда
			Возврат "Сумма";
		ИначеЕсли ИмяДокумента = "ПродажаЗапчастей" Тогда
			Возврат "ИтогоРекв"	
		ИначеЕсли ИмяДокумента = "ПоступлениеЗапчастей" Тогда
			Возврат "СуммаНакладной"	
		ИначеЕсли ИмяДокумента = "ПредварительныйСчет" Тогда
			Возврат "ИтогоРекв"	
		КонецЕсли;
		
	КонецЕсли;
	Возврат Неопределено;
	
КонецФункции

#КонецОбласти
