
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Менеджеры = Объект.Участники.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник");
	СписокРейтинг.Параметры.УстановитьЗначениеПараметра("Менеджеры", Менеджеры);
		
	СписокРейтинг.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	СписокРейтинг.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);

КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	СписокРейтинг.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	СписокРейтинг.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	
	ЗаполнениеПодвала();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Менеджеры = Объект.Участники.Выгрузить(,"Сотрудник").ВыгрузитьКолонку("Сотрудник");
	СписокРейтинг.Параметры.УстановитьЗначениеПараметра("Менеджеры", Менеджеры);
	
	СписокРейтинг.Параметры.УстановитьЗначениеПараметра("ДатаНачала",Период.ДатаНачала);
	СписокРейтинг.Параметры.УстановитьЗначениеПараметра("ДатаОкончания",Период.ДатаОкончания);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
	ЗаполнениеПодвала();
КонецПроцедуры

Процедура ЗаполнениеПодвала()
	
    Схема = Элементы.СписокРейтинг.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.СписокРейтинг.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКоличествоАвтомобилей.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКлиентыобработанные.ГоризонтальноеПоложениеВПодвале   = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКоличествоКлиентов.ГоризонтальноеПоложениеВПодвале    = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКоличествоЗвонков.ГоризонтальноеПоложениеВПодвале 	= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингСуммаПоступлений.ГоризонтальноеПоложениеВПодвале 	 	= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингДлительность.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКолвоПродаж.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингСуммаПродаж.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКолвоЗаявок.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингИсходящие.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингВходящие.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингНаличные.ГоризонтальноеПоложениеВПодвале				= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингБезнал.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингДельта.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
	
    ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКоличествоАвтомобилей.ТекстПодвала =  Формат(Результат.Итог("КоличествоАвтомобилей"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКлиентыобработанные.ТекстПодвала   =  Формат(Результат.Итог("Клиентыобработанные"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКоличествоКлиентов.ТекстПодвала    =  Формат(Результат.Итог("КоличествоКлиентов"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКоличествоЗвонков.ТекстПодвала 	 =  Формат(Результат.Итог("КоличествоЗвонков"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингСуммаПоступлений.ТекстПодвала 	 =  Формат(Результат.Итог("СуммаПоступлений"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингДлительность.ТекстПодвала 		 =  Формат(Результат.Итог("Длительность"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКолвоПродаж.ТекстПодвала 			 =  Формат(Результат.Итог("КолвоПродаж"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингСуммаПродаж.ТекстПодвала 			 =  Формат(Результат.Итог("СуммаПродаж"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингКолвоЗаявок.ТекстПодвала 		 	 =  Формат(Результат.Итог("КолвоЗаявок"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингИсходящие.ТекстПодвала 			 =  Формат(Результат.Итог("Исходящие"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингВходящие.ТекстПодвала 			 =  Формат(Результат.Итог("Входящие"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингНаличные.ТекстПодвала 			 =  Формат(Результат.Итог("Наличные"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингБезнал.ТекстПодвала 				 =  Формат(Результат.Итог("Безнал"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокРейтингДельта.ТекстПодвала 				 =  Формат(Результат.Итог("Дельта"),"ЧДЦ=0; ЧН=-");
	
КонецПроцедуры
