#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	МассивНепроверяемыхРеквизитов = Новый Массив;
	
	Если ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
	
		КонтрольУникальности(Отказ);
	Иначе
		
		МассивНепроверяемыхРеквизитов.Добавить("ВидДоговора");
	КонецЕсли;
	
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	
	// Установить новый уникальный номер	  
	Если НЕ ЗначениеЗаполнено(НомерДоговора) Тогда
				
		НомерДоговора = дт_ОбщегоНазначения.УникальныйНомерДоговора(ЭтотОбъект);
		
	КонецЕсли;
	
	///+ГомзяковаМА 20.02.2023
	Если Ссылка.Пустая() Тогда
		ОтветственныйМенеджер = Владелец.Ответственный;	
	КонецЕсли;
	///-ГомзяковаМА 20.02.2023
	
КонецПроцедуры





Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(НомерДоговора) Тогда
		НомерДоговора = дт_ОбщегоНазначения.УникальныйНомерДоговора(ЭтотОбъект);
	КонецЕсли;
	
	
	Если Не ЗначениеЗаполнено(ДатаДоговора) Тогда
		ДатаДоговора = ТекущаяДата();
	КонецЕсли;

	Если Не ЗначениеЗаполнено(Наименование) Тогда
		Наименование = дт_ОбщегоНазначенияКлиентСервер.НаименованиеДоговора(ЭтотОбъект);
	КонецЕсли;
	
	ОтсрочкаПлатежаВДнях = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "ОтсрочкаПлатежаВДнях");
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
Процедура КонтрольУникальности(Отказ)

	Если НЕ ЗначениеЗаполнено(НомерДоговора) 
		ИЛИ ПометкаУдаления Тогда
		
		Возврат;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Спр.Представление,
	|	Спр.Владелец.Представление КАК Контрагент
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК Спр
	|ГДЕ
	|	Спр.Ссылка <> &Ссылка
	|	И Спр.Организация = &Организация
	|	И Спр.НомерДоговора = &НомерДоговора
	|	И НАЧАЛОПЕРИОДА(Спр.ДатаДоговора, ГОД) = &ГодДоговора
	|	И НЕ Спр.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Организация", Организация);
	Запрос.УстановитьПараметр("НомерДоговора", НомерДоговора);
	Запрос.УстановитьПараметр("ГодДоговора", НачалоГода(ДатаДоговора));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Не уникальный номер договора (см.%1, %2)", Выборка.Представление, Выборка.Контрагент),
			,
			"НомерДоговора",
			,
			Отказ);
		
	КонецЕсли;

	
КонецПроцедуры // КонстрольУникальности()



#КонецОбласти

#КонецЕсли