Процедура ДиспетчерЗадач() Экспорт
	ДиспетчерЗадач1();
КонецПроцедуры

Процедура ДиспетчерЗадач1() Экспорт
	//ADOСоединение = Новый COMОбъект("ADODB.Connection");
	//СтрокаСоединения="Provider=MSDASQL.1;Driver={SQL Server};Server=DESKTOP-0T1HNVK\SQLEXPRESS;Port=1433;Database=dttrans;Uid=sa;Pwd=123456;";
	//ADOСоединение.Open(СтрокаСоединения); 
	//rs = ADOСоединение.Execute("UPDATE _reference12 SET _fld349 = FALSE WHERE TRUE");
	ИмяКаталога = Константы.дт_КаталогКартинокТоваров.Получить();
	Если НЕ СтрЗаканчиваетсяНа(ИмяКаталога, "\") Тогда
		ИмяКаталога = ИмяКаталога + "\";
	КонецЕсли;
	
	НайденныеФайлы = НайтиФайлы(ИмяКаталога,"*");
	запрос33 = Новый Запрос;
	запрос33.Текст = "ВЫБРАТЬ ПЕРВЫЕ 1
	               |	Номенклатура.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.Код ПОДОБНО &код";
    
	Для Каждого файл Из НайденныеФайлы Цикл
		Если файл.ЭтоКаталог() Тогда
		    Сообщить("%0"+файл.Имя);
			НайденныеФайлы1 = НайтиФайлы(ИмяКаталога + файл.Имя + "\","*");
			Для Каждого файл1 Из НайденныеФайлы1 Цикл
				Если файл1.ЭтоКаталог() Тогда
					запрос33.УстановитьПараметр("код","%0"+файл1.Имя);
					рез = запрос33.Выполнить().Выгрузить();
					Для Каждого об Из рез Цикл
						об1 = об.Ссылка.ПолучитьОбъект();
						об1.Фото = Истина;
						об1.Записать();
					КонецЦикла
				КонецЕсли	
			КонецЦикла
		КонецЕсли
	КонецЦикла;
	
	// ++ obrv 24.05.19
	//Выгрузка на основной сайт выполняется так же как и на региональные см. дт_ОбменССайтами
	Возврат;
	// -- obrv 24.05.19

    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Код,
	               |	Номенклатура.Наименование,
	               |	Номенклатура.Артикул,
	               |	Номенклатура.НомерПроизводителя,
	               |	Номенклатура.МестоНаСкладе2,
	               |	РегистрНакопления1Остатки.КолвоОстаток,
	               |	Номенклатура.Бренд,
	               |	Номенклатура.Описание,
	               |	Номенклатура.Ссылка,
	               |	Номенклатура.Комплектность.(
	               |		НомерПоиск,
	               |		Артикул,
	               |		Наименование,
	               |		Количество,
	               |		Предложение
	               |	),
	               |	Номенклатура.Категория,
	               |	Номенклатура.КрупныйАгрегат,
	               |	Номенклатура.НомераЗамен.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		НомерЗамены,
	               |		Производитель
	               |	),
	               |	Номенклатура.Видео,
	               |	Номенклатура.РекомендованаяЦена,
	               |	Номенклатура.НаСайтеТракДонор,
	               |	Номенклатура.Производитель.Ссылка КАК произв1,
	               |	Номенклатура.Вес,
	               |	Номенклатура.Объем,
	               |	Номенклатура.ДляТэгов.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Реквизит1
	               |	),
	               |	Номенклатура.ЕстьТэги,
	               |	Номенклатура.Диаметр,
	               |	Номенклатура.ШагРезьбы,
	               |	Номенклатура.Прочность,
	               |	Номенклатура.ТипКрепеж,
	               |	Номенклатура.Длина,
				   |	Номенклатура.Производитель,
				   |	Номенклатура.Состояние,
				   |	Номенклатура.Длина,
	               |	Номенклатура.ВнутреннийДиаметр,
	               |	Номенклатура.podkategoria,
	               |	Номенклатура.Толщина,
	               |	Номенклатура.Title,
	               |	Номенклатура.Предложения.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Реквизит1
	               |	),
	               |	Номенклатура.длин,
	               |	Номенклатура.шир,
	               |	Номенклатура.выс,
	               |	Номенклатура.ЭтоНоваяЗапчасть,
	               |	Номенклатура.ЗапросыПоисковиков.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Название
	               |	),
	               |	Номенклатура.podkat2,
	               |	Номенклатура.ДопКат.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		кат,
	               |		подкат,
	               |		кат2
	               |	),
	               |	Номенклатура.Подкатегория2,
	               |	Номенклатура.ЦенаПроверена,
	               |	Номенклатура.DirectNazvanie,
	               |	Номенклатура.DirectText,
	               |	Номенклатура.DirectSlova,
	               |	Номенклатура.DirectZapolneno
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	               |		ПО Номенклатура.Ссылка = РегистрНакопления1Остатки.Товар";
	результат = Запрос.Выполнить();
	таблица = результат.Выгрузить();
	Текст = Новый ЗаписьТекста("D:\DropBox_DT\Dropbox\PublicDT\sklad.xml", КодировкаТекста.UTF8);
	док = "<?xml version='1.0' encoding='UTF-8'?><info><items>";
	Текст.ЗаписатьСтроку(док);
	Для Каждого номстрока из таблица Цикл
		//Запрос1 = Новый Запрос;
		//Запрос1.Текст = "ВЫБРАТЬ
		//                |	РегистрНакопления1Остатки.Цена
		//                |ИЗ
		//                |	РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		//                |ГДЕ
		//                |	РегистрНакопления1Остатки.Товар = &Товар";
		Компл = "";
		Компл2 = "";
		компл21 = "";
		комплН = "";
		запросП = "";
		dz = 0;
		Если номстрока.DirectZapolneno = ИСТИНА Тогда
			dz = 1
		КонецЕсли;
		direct  = "<direct><ok>"+dz+"</ok><name><![CDATA["+номстрока.DirectNazvanie+"]]></name><text><![CDATA["+номстрока.DirectText+"]]></text><slova>"+номстрока.DirectSlova+"</slova></direct>";
		Для Каждого кпл из номстрока.Комплектность Цикл
			Компл = Компл + "/"+кпл.НомерПоиск;
			компл21 = компл21 + "<komplitem><nomer>"+кпл.Артикул+"</nomer><name><![CDATA["+кпл.Наименование+"]]></name><predl>"+кпл.Предложение.Код+"</predl><kolvo>"+кпл.Количество+"</kolvo></komplitem>";
		КонецЦикла;
		Для Каждого кпл из номстрока.НомераЗамен Цикл
			Компл = Компл + "/"+кпл.НомерЗамены;
			комплН = комплН + "<n><![CDATA["+кпл.НомерЗамены+"]]></n><b><![CDATA["+кпл.Производитель.Наименование+"]]></b>"
		КонецЦикла;
		Для Каждого зпр из номстрока.ЗапросыПоисковиков Цикл
			запросП = запросП + зпр.Название + "/";
		КонецЦикла;
		Компл = Компл + "/";
		насайте = 0;
		Если номстрока.НаСайтеТракДонор = ИСТИНА Тогда
			насайте = 1
		КонецЕсли;
		допкат = "<dopkats>";
		Для Каждого дк из номстрока.ДопКат Цикл
			допкат = допкат + "<dop><kat2>"+дк.кат2.Код+"</kat2><podkat>"+дк.подкат.Код+"</podkat></dop>";
		КонецЦикла;
		допкат = допкат + "</dopkats>";
		крепеж = "<krep_info>";
		Если номстрока.Категория.код = "000000148" Тогда
			крепеж=крепеж + "<type>"+номстрока.ТипКрепеж+"</type><diametr>"+номстрока.Диаметр+"</diametr><shag>"+
			номстрока.ШагРезьбы+"</shag><dlina>"+номстрока.Длина+"</dlina><prochnost>"+номстрока.Прочность+
			"</prochnost><wd>"+номстрока.ВнутреннийДиаметр+"</wd><tol>"+номстрока.Толщина+"</tol>";
		КонецЕсли;
		крепеж=крепеж + "</krep_info>";
		цена = номстрока.РекомендованаяЦена;
		кагг = 0;
		Если номстрока.КрупныйАгрегат = Истина Тогда
			кагг = 1;
		КонецЕсли;
		ет = 0;
		Если номстрока.ЕстьТэги = Истина Тогда
			ет = 1;
		КонецЕсли;
		эт_н=0;
		Если номстрока.ЭтоНоваяЗапчасть = Истина Тогда
			эт_н=1;
		КонецЕсли;
		цп=0;
		Если номстрока.ЦенаПроверена = Истина Тогда
			цп = 1;
		КонецЕсли;
		
		
		тд=0;		
		СтрокаЗапроса = "/common/api?key=ByTdEt87&id1c="+номстрока.Код + "&name="+номстрока.Наименование+"&oe="+номстрока.Артикул+
		"&analog="+номстрока.НомерПроизводителя+"&brend="+номстрока.Бренд+
		"&price="+Формат(цена,"ЧРГ=;ЧРД=.;")+"&warehouse="+номстрока.МестоНаСкладе2+"&kolvo="+номстрока.КолвоОстаток+"&kompl="+Компл+
		"&cat="+номстрока.Категория.Код+"&bigagg="+кагг+"&vidlink="+номстрока.Видео+"&pr_exp="+номстрока.РекомендованаяЦена+
		"&partdescr="+номстрока.Описание;
		док = "<item><id1c>"+номстрока.Код + "</id1c><name><![CDATA["+номстрока.Наименование + "]]></name><title>"+номстрока.Title+"</title><oe>"+номстрока.Артикул + "</oe>
		| <analog>"+номстрока.НомерПроизводителя + "</analog><brend>"+номстрока.Бренд + "</brend><price>"+Формат(цена,"ЧРГ=;ЧРД=.;") + "</price>
		| <warehouse>"+номстрока.МестоНаСкладе2 + "</warehouse><proizv>"+номстрока.Производитель+"</proizv><sost>"+номстрока.Состояние+"</sost><kolvo>"+номстрока.КолвоОстаток + "</kolvo><kompl>"+Компл + "</kompl><kompl2>"+компл21 + "</kompl2>
		| <cat2>"+номстрока.Подкатегория2.Код + "</cat2><sitecat>"+номстрока.произв1 + "</sitecat><bigagg>"+кагг + "</bigagg><vidlink>"+номстрока.Видео + "</vidlink>
		| <pr_exp>"+номстрока.РекомендованаяЦена + "</pr_exp><nzn>"+комплН+"</nzn>
		| <weigth>"+номстрока.Вес+"</weigth><volume>"+номстрока.Объем+"</volume><cp>"+цп+"</cp>
		| <ontd>"+насайте + "</ontd><partdescr><![CDATA["+номстрока.Описание + "]]></partdescr>"+direct+"
		| <dlin>"+номстрока.длин+"</dlin><shir>"+номстрока.шир+"</shir><isnew>"+эт_н+"</isnew><vis>"+номстрока.выс+"</vis>
		| <zapros>"+запросП+"</zapros><hastags>"+ет+"</hastags>"+крепеж;
		
		Если номстрока.ЕстьТэги = Истина Тогда
			док = док + "<tags>";
			Для каждого тэг Из номстрока.ДляТэгов Цикл
				док = док + "<tag>"+тэг.Реквизит1.код+"</tag>";
			КонецЦикла;
			док = док + "</tags>";
		КонецЕсли;
		док = док + "<predlozenia>";
			Для каждого тэг Из номстрока.Предложения Цикл
				док = док + "<predl>"+тэг.Реквизит1.код+"</predl>";
			КонецЦикла;
			док = док + "</predlozenia>";
        док = док + допкат;
		док = док + "</item>";
		док = СтрЗаменить(док,"&","&amp;");
		Текст.ЗаписатьСтроку(док);
	КонецЦикла;
	док ="</items></info>";
	Текст.ЗаписатьСтроку(док);
	Текст.Закрыть();
	Текст = Новый ЗаписьТекста("D:\DropBox_DT\Dropbox\PublicDT\sklad2.xml", КодировкаТекста.UTF8);
	док = "<?xml version='1.0' encoding='UTF-8'?><info>";
	Текст.ЗаписатьСтроку(док);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Спецпредложения.Код,
	               |	Спецпредложения.ДатаНачала,
	               |	Спецпредложения.ДатаОкончания,
	               |	Спецпредложения.ДатаОбновления,
	               |	Спецпредложения.Товар.Код КАК ткод,
	               |	Спецпредложения.Товар.ЭтоНоваяЗапчасть КАК этн,
	               |	Спецпредложения.Цена,
	               |	Спецпредложения.Условия
	               |ИЗ
	               |	Справочник.Спецпредложения КАК Спецпредложения";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = "<specpredl>";
	Текст.ЗаписатьСтроку(док);

	Для Каждого пред из рез1 Цикл
		этн = 0;
		Если пред.этн = Истина Тогда
			этн = 1;
		КонецЕсли;
		док = "<predl><id>"+пред.Код+"</id><id1c>"+пред.ткод+"</id1c><isnew>"+этн+"</isnew><updated>"+пред.ДатаОбновления+"</updated>
		|<from>"+пред.ДатаНачала+"</from><to>"+пред.ДатаОкончания+"</to>
		|<price>"+пред.Цена+"</price><description><![CDATA["+пред.Условия+"]]></description></predl>";
		док = СтрЗаменить(док,"&","&amp;");
		Текст.ЗаписатьСтроку(док);
	КонецЦикла;
    док = "</specpredl>";
	Текст.ЗаписатьСтроку(док);
	Запрос.Текст = "ВЫБРАТЬ
	               |	Тэги.Ссылка,
	               |	Тэги.ВерсияДанных,
	               |	Тэги.ПометкаУдаления,
	               |	Тэги.Предопределенный,
	               |	Тэги.Код,
	               |	Тэги.Наименование
	               |ИЗ
	               |	Справочник.Тэги КАК Тэги";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = "<tags_table>";
	Для Каждого тэг из рез1 Цикл
		док = док + "<tag><id>"+тэг.Код+"</id><name>"+тэг.Наименование+"</name></tag>";
	КонецЦикла;
	док = док + "</tags_table>";
	док = СтрЗаменить(док,"&","&amp;");
	Текст.ЗаписатьСтроку(док);

	Запрос.Текст =  "ВЫБРАТЬ
	                |	Клиенты.Телефон,
	                |	Клиенты.ФИО
	                |ИЗ
	                |	Справочник.Клиенты КАК Клиенты" ;
	рез1 = Запрос.Выполнить().Выгрузить();
	док = "<phones>";
	Для Каждого тел из рез1 цикл
		док = док + "<phone><pn>"+тел.Телефон+"</pn><name>"+тел.ФИО+"</name></phone>";
	КонецЦикла;
	док = док + "</phones>";
	Текст.ЗаписатьСтроку(док);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Podkategorii.Ссылка,
	               |	Podkategorii.ВерсияДанных,
	               |	Podkategorii.ПометкаУдаления,
	               |	Podkategorii.Предопределенный,
	               |	Podkategorii.Владелец,
	               |	Podkategorii.Код,
	               |	Podkategorii.Наименование,
	               |	Podkategorii.poryadok
	               |ИЗ
	               |	Справочник.Podkategorii КАК Podkategorii";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = "<podkats>";
	Для Каждого подкат из рез1 цикл
		док = док + "<podkat><id>"+подкат.Код+"</id><catid>"+подкат.Владелец.Код+"</catid><name>"+подкат.Наименование+"</name><poryadok>"+подкат.poryadok+"</poryadok></podkat>";
	КонецЦикла;
	
	
	запрос333 = Новый Запрос;
запрос333.Текст =  "ВЫБРАТЬ
                   |	ПродажаЗапчастей.ЕстьДоставка,
                   |	ПродажаЗапчастей.ДоставкаНеЗаполнена,
                   |	ПродажаЗапчастей.ТранспортнаяКомпания,
                   |	ПродажаЗапчастей.Вес,
                   |	ПродажаЗапчастей.Объем,
                   |	ПродажаЗапчастей.КоличествоМест,
                   |	ПродажаЗапчастей.ГородОтправки,
                   |	ПродажаЗапчастей.РегионПолучения,
                   |	ПродажаЗапчастей.ГородПолучения,
                   |	ПродажаЗапчастей.СтоимостьДоставки,
                   |	ПродажаЗапчастей.Номер,
                   |	ПродажаЗапчастей.Таблица.(
                   |		Ссылка,
                   |		НомерСтроки,
                   |		Товар,
                   |		Количество,
                   |		Цена,
                   |		Скидка,
                   |		машина,
                   |		цена1,
                   |		Комментарий,
                   |		Сумма
                   |	)
                   |ИЗ
                   |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей" ;
рез = запрос333.Выполнить().Выгрузить();
хмл = "<dostavki>";
Для Каждого стр Из рез Цикл
	Если стр.ЕстьДоставка = Истина И стр.ДоставкаНеЗаполнена = Ложь Тогда
		хмл = хмл + "<dostavka><nomer>"+стр.Номер+"</nomer><from>"+стр.ГородОтправки+"</from><to>"+стр.РегионПолучения.Владелец+", "+стр.РегионПолучения+", г. "+стр.ГородПолучения+"</to><transport>"+стр.ТранспортнаяКомпания+"</transport>
		| <ves>"+стр.Вес+"</ves><obem>"+стр.Объем+"</obem><mest>"+стр.КоличествоМест+"</mest><stoimost>"+стр.СтоимостьДоставки+"</stoimost><tovari>";
		Для каждого стр1 Из стр.Таблица Цикл
			хмл = хмл + "<tovar><id>"+стр1.Товар.Код+"</id><name><![CDATA["+стр1.Товар.Наименование+"]]></name><kolvo>"+стр1.Количество+"</kolvo></tovar>"; 
		КонецЦикла;
		хмл = хмл + "</tovari></dostavka>";
	КонецЕсли;
КонецЦикла;
хмл = хмл + "</dostavki>";

	
запрос333.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
                  |	Клиенты.Область,
                  |	Клиенты.Город2,
                  |	Клиенты.Страна2
                  |ИЗ
                  |	Справочник.Клиенты КАК Клиенты";	
	
рез = запрос333.Выполнить().Выгрузить();
хмл = хмл + "<cities>";
Для Каждого стр Из рез Цикл	
		хмл = хмл + "<city><to>"+стр.Страна2+", "+стр.Область+", г. "+стр.Город2+"</to></city>";
КонецЦикла;
хмл = хмл + "</cities>";

запрос333.Текст = "ВЫБРАТЬ
                  |	РегистрНакопления1Остатки.Товар,
                  |	ИндНомер.Цена КАК цена,
                  |	РегистрНакопления1Остатки.КолвоОстаток,
                  |	Комментарии.Комментарий,
                  |	ИндНомер.Код КАК ИндКод,
                  |	ВЫБОР
                  |		КОГДА РегистрНакопления1Остатки.Товар.Состояние = ЗНАЧЕНИЕ(Перечисление.Состояние.БУ)
                  |			ТОГДА (ВЫРАЗИТЬ(РегистрНакопления1Остатки.Товар.РекомендованаяЦена * ИндНомер.наценка.Коофициент / 10 КАК ЧИСЛО(10, 0))) * 10
                  |		ИНАЧЕ ИндНомер.Цена
                  |	КОНЕЦ КАК наценкаФ
                  |ИЗ
                  |	РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Комментарии КАК Комментарии
                  |		ПО (Комментарии.Товар = РегистрНакопления1Остатки.Товар)
                  |			И (Комментарии.Машина = РегистрНакопления1Остатки.машина)
                  |			И (Комментарии.индкод = РегистрНакопления1Остатки.индкод)
                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИндНомер КАК ИндНомер
                  |		ПО (ИндНомер.индкод = РегистрНакопления1Остатки.индкод)";
рез = запрос333.Выполнить().Выгрузить();
хмл = хмл + "<indparts>";
Для Каждого стр Из рез Цикл	
		хмл = хмл + "<indpart><id>"+стр.Товар.Код+"</id><price>"+стр.наценкаФ+"</price><kolvo>"+стр.КолвоОстаток+"</kolvo><indkod>"+стр.ИндКод+"</indkod></indpart>";
КонецЦикла;
хмл = хмл + "</indparts>";


Запрос.Текст = "ВЫБРАТЬ
               |	Категории.Код,
               |	Категории.Наименование,
               |	Категории.Порядок1,
               |	Категории.Родитель,
               |	Категории.допкат.(
               |		Ссылка,
               |		НомерСтроки,
               |		ДопКатегория
               |	),
               |	Категории.ОписаниеОбщее,
               |	Категории.ОписаниеСкания,
               |	Категории.ОписаниеДАФ,
               |	Категории.ОписаниеМАН,
               |	Категории.ОписаниеВольво,
               |	Категории.ОписаниеРено,
               |	Категории.Автолайн,
               |	Категории.допкат2.(
               |		Ссылка,
               |		НомерСтроки,
               |		код,
               |		Родитель,
               |		Название
               |	),
               |	Категории.НазваниеДляОписания,
               |	Категории.МетаОписание
               |ИЗ
               |	Справочник.Категории КАК Категории";
	рез1 = Запрос.Выполнить().Выгрузить();
	хмл = хмл + "<mainkats>";
	Для Каждого подкат из рез1 цикл
		катавто = "";
		Если подкат.Автолайн <> Справочники.Категории.ПустаяСсылка() Тогда
			катавто = подкат.Автолайн.catauto;
		КонецЕсли;
		If  подкат.Родитель = Справочники.Категории.ПустаяСсылка() Then
		  хмл = хмл + "<kat><id>"+подкат.Код+"</id><name>"+подкат.Наименование+"</name>
		  | <poryadok>"+Формат(подкат.Порядок1,"ЧРГ=;ЧРД=.;")+"</poryadok><parent>0</parent></kat>";
	    Else
		  хмл = хмл + "<kat><id>"+подкат.Код+"</id>
		  | <name>"+подкат.Наименование+"</name><poryadok>"+Формат(подкат.Порядок1,"ЧРГ=;ЧРД=.;")+"</poryadok>
		  | <parent>"+подкат.Родитель.Код+"</parent><catauto>"+катавто+"</catauto><similar2>";
		  Для Каждого симкат Из подкат.допкат2 Цикл
			  хмл = хмл+"<skat><id>"+симкат.Код+"</id><pid>"+симкат.Родитель.Код+"</pid><name>"+симкат.Название+"</name></skat>";
		  КонецЦикла;
		  хмл = хмл + "</similar2><similar>";
		  Для Каждого симкат Из подкат.допкат Цикл
			  хмл = хмл+"<skat>"+симкат.ДопКатегория.Код+"</skat>";
		  КонецЦикла; 		  
		  хмл = хмл + "</similar><fordesc>"+подкат.НазваниеДляОписания+"</fordesc><metadesc><![CDATA["+подкат.МетаОписание+"]]></metadesc><descmain><![CDATA["+подкат.ОписаниеОбщее+"]]></descmain>
		  | <descscania><![CDATA["+подкат.ОписаниеСкания+"]]></descscania>
		  | <descdaf><![CDATA["+подкат.ОписаниеДАФ+"]]></descdaf>
		  | <descman><![CDATA["+подкат.ОписаниеМАН+"]]></descman>
		  | <descvolvo><![CDATA["+подкат.ОписаниеВольво+"]]></descvolvo>
		  | <descrenault><![CDATA["+подкат.ОписаниеРено+"]]></descrenault></kat>";
		EndIf;
	КонецЦикла;
	хмл = хмл + "</mainkats>";
	док = док + "</podkats>"+хмл+"</info>";
	док = СтрЗаменить(док,"&","&amp;");

	Текст.ЗаписатьСтроку(док);
	Текст.Закрыть();


КонецПроцедуры


Процедура Покупки() 
	Текст = Новый ЗаписьТекста("d:\Dropbox\Public\orders.xml", КодировкаТекста.UTF8);
	док = "<?xml version='1.0' encoding='UTF-8'?><info><orders>";
	Текст.ЗаписатьСтроку(док);
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаЗапчастей.Ссылка,
	               |	ПродажаЗапчастей.ВерсияДанных,
	               |	ПродажаЗапчастей.ПометкаУдаления,
	               |	ПродажаЗапчастей.Номер,
	               |	ПродажаЗапчастей.Дата,
	               |	ПродажаЗапчастей.Проведен,
	               |	ПродажаЗапчастей.Клиент,
	               |	ПродажаЗапчастей.Комментарий,
	               |	ПродажаЗапчастей.Доставка,
	               |	ПродажаЗапчастей.Расход,
	               |	ПродажаЗапчастей.СрокПроверки,
	               |	ПродажаЗапчастей.Организация,
	               |	ПродажаЗапчастей.ИтогоРекв,
	               |	ПродажаЗапчастей.КтоПродал,
	               |	ПродажаЗапчастей.Оплачено,
	               |	ПродажаЗапчастей.УжеОплачено,
	               |	ПродажаЗапчастей.Откат,
	               |	ПродажаЗапчастей.КомуОткат,
	               |	ПродажаЗапчастей.ОтданоМарату,
	               |	ПродажаЗапчастей.ИтогоБезнал,
	               |	ПродажаЗапчастей.АртикулВНазвании,
	               |	ПродажаЗапчастей.ВычитатьИзСуммы,
	               |	ПродажаЗапчастей.ПотеряНаОбналичку,
	               |	ПродажаЗапчастей.ОстатокДенег,
	               |	ПродажаЗапчастей.ВозвратТовара,
	               |	ПродажаЗапчастей.СуммаВозврат,
	               |	ПродажаЗапчастей.ТранспортнаяКомпания,
	               |	ПродажаЗапчастей.Вес,
	               |	ПродажаЗапчастей.Объем,
	               |	ПродажаЗапчастей.КоличествоМест,
	               |	ПродажаЗапчастей.ГородОтправки,
	               |	ПродажаЗапчастей.РегионПолучения,
	               |	ПродажаЗапчастей.ГородПолучения,
	               |	ПродажаЗапчастей.СтоимостьДоставки,
	               |	ПродажаЗапчастей.ЕстьДоставка,
	               |	ПродажаЗапчастей.ДоставкаНеЗаполнена,
	               |	ПродажаЗапчастей.Самовывоз,
	               |	ПродажаЗапчастей.СтранаПолучения,
	               |	ПродажаЗапчастей.Новые,
	               |	ПродажаЗапчастей.Скидка,
	               |	ПродажаЗапчастей.КоммДост,
	               |	ПродажаЗапчастей.НомерПП,
	               |	ПродажаЗапчастей.TipOplati,
	               |	ПродажаЗапчастей.Таблица.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Товар,
	               |		Количество,
	               |		Цена,
	               |		Скидка,
	               |		машина,
	               |		цена1,
	               |		Комментарий,
	               |		Сумма,
	               |		ПродНак
	               |	),
	               |	ПродажаЗапчастей.УслугиДоствка.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Услуга,
	               |		Цена
	               |	)
	               |ИЗ
	               |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей";
	результат = запрос.Выполнить().Выгрузить();
	рез = "";
	Для Каждого стр из результат Цикл
		рез = "<order><id>"+стр.Номер+"</id><phone>"+стр.Клиент.Телефон+"</phone><total_price>"+стр.ИтогоРекв+"</total_price><tovari>";
		Для Каждого товар из стр.Таблица Цикл
			рез = рез + "<tovar><id>"+товар.Товар.Код+"</id><kolvo>"+товар.Количество+"</kolvo><price>"+товар.Цена+"</price></tovar>";
		КонецЦикла;
		рез = рез + "</tovari></order>";
		Текст.ЗаписатьСтроку(рез);
	КонецЦикла;
	рез = "</orders></info>";
	Текст.ЗаписатьСтроку(рез);
	Текст.Закрыть();
КонецПроцедуры

	
Процедура МаркаМодель() Экспорт
	запрос = Новый Запрос;
Текст = Новый ЗаписьТекста("d:\Dropbox\Public\mm.xml", КодировкаТекста.UTF8);
запрос.Текст =  "ВЫБРАТЬ
                |	ТипТС.Код,
                |	ТипТС.Наименование
                |ИЗ
                |	Справочник.ТипТС КАК ТипТС" ;
рез = Запрос.Выполнить().Выгрузить();
Текст.ЗаписатьСтроку("<?xml version='1.0' encoding='UTF-8'?><info>");
хмл = "<tiptc>";	
Текст.ЗаписатьСтроку(хмл);
Для Каждого стр Из рез Цикл
	хмл = "<tip><id1c>"+стр.Код+"</id1c><name>"+стр.Наименование+"</name></tip>";	
	Текст.ЗаписатьСтроку(хмл);
КонецЦикла;
хмл = "</tiptc>";
Текст.ЗаписатьСтроку(хмл);


запрос.Текст =  "ВЫБРАТЬ
                |	МодельТС.Код,
                |	МодельТС.Наименование,
                |	МодельТС.Владелец
                |ИЗ
                |	Справочник.МодельТС КАК МодельТС" ;
рез = Запрос.Выполнить().Выгрузить();
хмл = "<modeltc>";
Текст.ЗаписатьСтроку(хмл);
Для Каждого стр Из рез Цикл
	хмл = "<model><id1c>"+стр.Код+"</id1c><name>"+стр.Наименование+"</name><tip1c>"+стр.Владелец.Код+"</tip1c></model>";	
	Текст.ЗаписатьСтроку(хмл);
КонецЦикла;
хмл = "</modeltc>";
Текст.ЗаписатьСтроку(хмл);



запрос.Текст =  "ВЫБРАТЬ
                |	ПоступлениеЗапчастей.Машина,
                |	ПоступлениеЗапчастей.Таблица.(
                |		Товар
                |	)
                |ИЗ
                |	Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей" ;
рез = Запрос.Выполнить().Выгрузить();
хмл = "<markamodel>";
Текст.ЗаписатьСтроку(хмл);
Для Каждого стр Из рез Цикл
	Если стр.Машина.ТипТС <> Справочники.ТипТС.ПустаяСсылка() И стр.Машина.МаркаТС <> Справочники.МодельТС.ПустаяСсылка() Тогда
		Для каждого таб Из стр.Таблица Цикл
			хмл = "<mm><item1c>"+таб.Товар.Код+"</item1c><tip1c>"+стр.Машина.ТипТС.Код+"</tip1c><model1c>"+стр.Машина.МаркаТС.Код+"</model1c></mm>";
			Текст.ЗаписатьСтроку(хмл);
		КонецЦикла;
	КонецЕсли;
КонецЦикла;
хмл = "</markamodel>";
Текст.ЗаписатьСтроку(хмл);
Текст.ЗаписатьСтроку("</info>");
Текст.Закрыть();

КонецПроцедуры


Процедура ДобавленоНаДату() Экспорт
	
	запрос = Новый Запрос;
		
	запрос.Текст = "ВЫБРАТЬ
	               |	ДобавлениеЗапчастейОстатки.пользователь,
	               |	ДобавлениеЗапчастейОстатки.КолвоОстаток
	               |ИЗ
	               |	РегистрНакопления.ДобавлениеЗапчастей.Остатки КАК ДобавлениеЗапчастейОстатки";
				   
	результаты = запрос.Выполнить().Выгрузить();
	Для Каждого стр из результаты Цикл
		об = РегистрыСведений.ДобавленоЗапчастейНаДату.СоздатьМенеджерЗаписи();
		об.пользователь = стр.пользователь;
		об.дата = ТекущаяДата();
		об.колво = стр.КолвоОстаток;
		об.Записать();
	КонецЦикла;
	
КонецПроцедуры



Процедура ОбновитьОдинТовар_v1(Код) Экспорт
	
    Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Код,
	               |	Номенклатура.Наименование,
	               |	Номенклатура.Артикул,
	               |	Номенклатура.НомерПроизводителя,
	               |	Номенклатура.МестоНаСкладе2,
	               |	РегистрНакопления1Остатки.КолвоОстаток,
	               |	Номенклатура.Бренд,
	               |	Номенклатура.Описание,
	               |	Номенклатура.Ссылка,
	               |	Номенклатура.Комплектность.(
	               |		НомерПоиск,
	               |		Артикул,
	               |		Наименование,
	               |		Количество,
	               |		Предложение
	               |	),
	               |	Номенклатура.Категория,
	               |	Номенклатура.КрупныйАгрегат,
	               |	Номенклатура.НомераЗамен.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		НомерЗамены,
	               |		Производитель
	               |	),
	               |	Номенклатура.Видео,
	               |	Номенклатура.РекомендованаяЦена,
	               |	Номенклатура.НаСайтеТракДонор,
	               |	Номенклатура.Производитель.Ссылка КАК произв1,
	               |	Номенклатура.Вес,
	               |	Номенклатура.Объем,
	               |	Номенклатура.ДляТэгов.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Реквизит1
	               |	),
	               |	Номенклатура.ЕстьТэги,
	               |	Номенклатура.Диаметр,
	               |	Номенклатура.ШагРезьбы,
	               |	Номенклатура.Прочность,
	               |	Номенклатура.ТипКрепеж,
	               |	Номенклатура.Длина,
	               |	Номенклатура.Производитель,
	               |	Номенклатура.Состояние,
	               |	Номенклатура.Длина КАК Длина1,
	               |	Номенклатура.ВнутреннийДиаметр,
	               |	Номенклатура.podkategoria,
	               |	Номенклатура.Толщина,
	               |	Номенклатура.Title,
	               |	Номенклатура.Предложения.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Реквизит1
	               |	),
	               |	Номенклатура.длин,
	               |	Номенклатура.шир,
	               |	Номенклатура.выс,
	               |	Номенклатура.ЭтоНоваяЗапчасть,
	               |	Номенклатура.ЗапросыПоисковиков.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Название
	               |	),
	               |	Номенклатура.podkat2,
	               |	Номенклатура.ДопКат.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		кат,
	               |		подкат,
	               |		кат2
	               |	),
	               |	Номенклатура.Подкатегория2,
	               |	Номенклатура.ЦенаПроверена,
	               |	Номенклатура.DirectNazvanie,
	               |	Номенклатура.DirectText,
	               |	Номенклатура.DirectSlova,
	               |	Номенклатура.DirectZapolneno
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	               |		ПО Номенклатура.Ссылка = РегистрНакопления1Остатки.Товар
	               |ГДЕ
	               |	Номенклатура.Код = &Код";
	Запрос.УстановитьПараметр("Код",код);			   
	результат = Запрос.Выполнить();
	таблица = результат.Выгрузить();
	Текст = Новый ЗаписьТекста("D:\DropBox_DT\Dropbox\PublicDT\updateone_"+код+".xml", КодировкаТекста.UTF8);
	док = "<?xml version='1.0' encoding='UTF-8'?><info><items>";
	Текст.ЗаписатьСтроку(док);
	Для Каждого номстрока из таблица Цикл
		Компл = "";
		Компл2 = "";
		компл21 = "";
		комплН = "";
		запросП = "";
		dz = 0;
		Если номстрока.DirectZapolneno = ИСТИНА Тогда
			dz = 1
		КонецЕсли;
		direct  = "<direct><ok>"+dz+"</ok><name><![CDATA["+номстрока.DirectNazvanie+"]]></name><text><![CDATA["+номстрока.DirectText+"]]></text><slova>"+номстрока.DirectSlova+"</slova></direct>";
		Для Каждого кпл из номстрока.Комплектность Цикл
			Компл = Компл + "/"+кпл.НомерПоиск;
			компл21 = компл21 + "<komplitem><nomer>"+кпл.Артикул+"</nomer><name><![CDATA["+кпл.Наименование+"]]></name><predl>"+кпл.Предложение.Код+"</predl><kolvo>"+кпл.Количество+"</kolvo></komplitem>";
		КонецЦикла;
		Для Каждого кпл из номстрока.НомераЗамен Цикл
			Компл = Компл + "/"+кпл.НомерЗамены;
			комплН = комплН + "<n><![CDATA["+кпл.НомерЗамены+"]]></n><b><![CDATA["+кпл.Производитель.Наименование+"]]></b>"
		КонецЦикла;
		Для Каждого зпр из номстрока.ЗапросыПоисковиков Цикл
			запросП = запросП + зпр.Название + "/";
		КонецЦикла;
		Компл = Компл + "/";
		насайте = 0;
		Если номстрока.НаСайтеТракДонор = ИСТИНА Тогда
			насайте = 1
		КонецЕсли;
		допкат = "<dopkats>";
		Для Каждого дк из номстрока.ДопКат Цикл
			допкат = допкат + "<dop><kat2>"+дк.кат2.Код+"</kat2><podkat>"+дк.подкат.Код+"</podkat></dop>";
		КонецЦикла;
		допкат = допкат + "</dopkats>";
		крепеж = "<krep_info>";
		Если номстрока.Категория.код = "000000148" Тогда
			крепеж=крепеж + "<type>"+номстрока.ТипКрепеж+"</type><diametr>"+номстрока.Диаметр+"</diametr><shag>"+
			номстрока.ШагРезьбы+"</shag><dlina>"+номстрока.Длина+"</dlina><prochnost>"+номстрока.Прочность+
			"</prochnost><wd>"+номстрока.ВнутреннийДиаметр+"</wd><tol>"+номстрока.Толщина+"</tol>";
		КонецЕсли;
		крепеж=крепеж + "</krep_info>";
		цена = номстрока.РекомендованаяЦена;
		кагг = 0;
		Если номстрока.КрупныйАгрегат = Истина Тогда
			кагг = 1;
		КонецЕсли;
		ет = 0;
		Если номстрока.ЕстьТэги = Истина Тогда
			ет = 1;
		КонецЕсли;
		эт_н=0;
		Если номстрока.ЭтоНоваяЗапчасть = Истина Тогда
			эт_н=1;
		КонецЕсли;
		цп=0;
		Если номстрока.ЦенаПроверена = Истина Тогда
			цп = 1;
		КонецЕсли;
		
		
		тд=0;		

		док = "<item><id1c>"+номстрока.Код + "</id1c><name><![CDATA["+номстрока.Наименование + "]]></name><title>"+номстрока.Title+"</title><oe>"+номстрока.Артикул + "</oe>
		| <analog>"+номстрока.НомерПроизводителя + "</analog><brend>"+номстрока.Бренд + "</brend><price>"+Формат(цена,"ЧРГ=;ЧРД=.;") + "</price>
		| <warehouse>"+номстрока.МестоНаСкладе2 + "</warehouse><proizv>"+номстрока.Производитель+"</proizv><sost>"+номстрока.Состояние+"</sost><kolvo>"+номстрока.КолвоОстаток + "</kolvo><kompl>"+Компл + "</kompl><kompl2>"+компл21 + "</kompl2>
		| <cat2>"+номстрока.Подкатегория2.Код + "</cat2><sitecat>"+номстрока.произв1 + "</sitecat><bigagg>"+кагг + "</bigagg><vidlink>"+номстрока.Видео + "</vidlink>
		| <pr_exp>"+номстрока.РекомендованаяЦена + "</pr_exp><nzn>"+комплН+"</nzn>
		| <weigth>"+номстрока.Вес+"</weigth><volume>"+номстрока.Объем+"</volume><cp>"+цп+"</cp>
		| <ontd>"+насайте + "</ontd><partdescr><![CDATA["+номстрока.Описание + "]]></partdescr>"+direct+"
		| <dlin>"+номстрока.длин+"</dlin><shir>"+номстрока.шир+"</shir><isnew>"+эт_н+"</isnew><vis>"+номстрока.выс+"</vis>
		| <zapros>"+запросП+"</zapros><hastags>"+ет+"</hastags>"+крепеж;
		
		Если номстрока.ЕстьТэги = Истина Тогда
			док = док + "<tags>";
			Для каждого тэг Из номстрока.ДляТэгов Цикл
				док = док + "<tag>"+тэг.Реквизит1.код+"</tag>";
			КонецЦикла;
			док = док + "</tags>";
		КонецЕсли;
		док = док + "<predlozenia>";
			Для каждого тэг Из номстрока.Предложения Цикл
				док = док + "<predl>"+тэг.Реквизит1.код+"</predl>";
			КонецЦикла;
			док = док + "</predlozenia>";
        док = док + допкат;
		док = док + "</item>";
		док = СтрЗаменить(док,"&","&amp;");
		Текст.ЗаписатьСтроку(док);
	КонецЦикла;
	док ="</items>";
	Текст.ЗаписатьСтроку(док);
	
	
	
	
запрос.Текст = "ВЫБРАТЬ
                  |	РегистрНакопления1Остатки.Товар,
                  |	ИндНомер.Цена КАК цена,
                  |	РегистрНакопления1Остатки.КолвоОстаток,
                  |	Комментарии.Комментарий,
                  |	ИндНомер.Код КАК ИндКод,
                  |	ВЫБОР
                  |		КОГДА РегистрНакопления1Остатки.Товар.Состояние = ЗНАЧЕНИЕ(Перечисление.Состояние.БУ)
                  |			ТОГДА (ВЫРАЗИТЬ(РегистрНакопления1Остатки.Товар.РекомендованаяЦена * ИндНомер.наценка.Коофициент / 10 КАК ЧИСЛО(10, 0))) * 10
                  |		ИНАЧЕ ИндНомер.Цена
                  |	КОНЕЦ КАК наценкаФ
                  |ИЗ
                  |	РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.Комментарии КАК Комментарии
                  |		ПО (Комментарии.Товар = РегистрНакопления1Остатки.Товар)
                  |			И (Комментарии.Машина = РегистрНакопления1Остатки.машина)
                  |			И (Комментарии.индкод = РегистрНакопления1Остатки.индкод)
                  |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИндНомер КАК ИндНомер
                  |		ПО (ИндНомер.индкод = РегистрНакопления1Остатки.индкод) ГДЕ РегистрНакопления1Остатки.Товар.Код = &Код";
Запрос.УстановитьПараметр("Код",код);				  
рез = запрос.Выполнить().Выгрузить();
хмл ="<indparts>";
Для Каждого стр Из рез Цикл	
		хмл = хмл + "<indpart><id>"+стр.Товар.Код+"</id><price>"+стр.наценкаФ+"</price><kolvo>"+стр.КолвоОстаток+"</kolvo><indkod>"+стр.ИндКод+"</indkod></indpart>";
КонецЦикла;
хмл = хмл + "</indparts>";


Запрос.Текст = "ВЫБРАТЬ
               |	Категории.Код,
               |	Категории.Наименование,
               |	Категории.Порядок1,
               |	Категории.Родитель,
               |	Категории.допкат.(
               |		Ссылка,
               |		НомерСтроки,
               |		ДопКатегория
               |	),
               |	Категории.ОписаниеОбщее,
               |	Категории.ОписаниеСкания,
               |	Категории.ОписаниеДАФ,
               |	Категории.ОписаниеМАН,
               |	Категории.ОписаниеВольво,
               |	Категории.ОписаниеРено,
               |	Категории.Автолайн,
               |	Категории.допкат2.(
               |		Ссылка,
               |		НомерСтроки,
               |		код,
               |		Родитель,
               |		Название
               |	),
               |	Категории.НазваниеДляОписания,
               |	Категории.МетаОписание
               |ИЗ
               |	Справочник.Категории КАК Категории";
	рез1 = Запрос.Выполнить().Выгрузить();
	хмл = хмл + "<mainkats>";
	Для Каждого подкат из рез1 цикл
		катавто = "";
		Если подкат.Автолайн <> Справочники.Категории.ПустаяСсылка() Тогда
			катавто = подкат.Автолайн.catauto;
		КонецЕсли;
		If  подкат.Родитель = Справочники.Категории.ПустаяСсылка() Then
		  хмл = хмл + "<kat><id>"+подкат.Код+"</id><name>"+подкат.Наименование+"</name>
		  | <poryadok>"+Формат(подкат.Порядок1,"ЧРГ=;ЧРД=.;")+"</poryadok><parent>0</parent></kat>";
	    Else
		  хмл = хмл + "<kat><id>"+подкат.Код+"</id>
		  | <name>"+подкат.Наименование+"</name><poryadok>"+Формат(подкат.Порядок1,"ЧРГ=;ЧРД=.;")+"</poryadok>
		  | <parent>"+подкат.Родитель.Код+"</parent><catauto>"+катавто+"</catauto><similar2>";
		  Для Каждого симкат Из подкат.допкат2 Цикл
			  хмл = хмл+"<skat><id>"+симкат.Код+"</id><pid>"+симкат.Родитель.Код+"</pid><name>"+симкат.Название+"</name></skat>";
		  КонецЦикла;
		  хмл = хмл + "</similar2><similar>";
		  Для Каждого симкат Из подкат.допкат Цикл
			  хмл = хмл+"<skat>"+симкат.ДопКатегория.Код+"</skat>";
		  КонецЦикла; 		  
		  хмл = хмл + "</similar><fordesc>"+подкат.НазваниеДляОписания+"</fordesc><metadesc><![CDATA["+подкат.МетаОписание+"]]></metadesc><descmain><![CDATA["+подкат.ОписаниеОбщее+"]]></descmain>
		  | <descscania><![CDATA["+подкат.ОписаниеСкания+"]]></descscania>
		  | <descdaf><![CDATA["+подкат.ОписаниеДАФ+"]]></descdaf>
		  | <descman><![CDATA["+подкат.ОписаниеМАН+"]]></descman>
		  | <descvolvo><![CDATA["+подкат.ОписаниеВольво+"]]></descvolvo>
		  | <descrenault><![CDATA["+подкат.ОписаниеРено+"]]></descrenault></kat>";
		EndIf;
	КонецЦикла;
	хмл = хмл + "</mainkats>";
	док = хмл+"</info>";
	док = СтрЗаменить(док,"&","&amp;");

	Текст.ЗаписатьСтроку(док);
	Текст.Закрыть();


КонецПроцедуры


Процедура ОбновитьОдинТовар(Ссылка, ТекстСообщения, Отказ = Ложь) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	дт_НастройкиОбмена.Наименование,
		|	дт_НастройкиОбмена.АдресСайта,
		|	дт_НастройкиОбмена.Токен
		|ИЗ
		|	Справочник.дт_НастройкиОбмена КАК дт_НастройкиОбмена
		|ГДЕ
		|	НЕ дт_НастройкиОбмена.ПометкаУдаления
		|	И НЕ дт_НастройкиОбмена.АдресСайта ПОДОБНО """"
		|УПОРЯДОЧИТЬ ПО
		|	дт_НастройкиОбмена.Код";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ТекстСообщения = "Не найдены сайты для обновления";
		Отказ = Истина;
		Возврат
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	СвойстваТовара = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Ссылка, "РекомендованаяЦена,Код");
	
	Параметры = Новый Соответствие();
	Параметры.Вставить("id1c", СвойстваТовара.Код);
	Параметры.Вставить("product[price]", СвойстваТовара.РекомендованаяЦена);
	
	СчетчикОбновлено = 0;
	СчетчикВсего = 0;
	ИмяФункции = "api/v1/products/update_1c";
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.Токен) Тогда
			Параметры.Вставить("token", Выборка.Токен)
		КонецЕсли;
			
		Отказ = Ложь;
		ОтправитьЗапросPOST(Выборка.АдресСайта, ИмяФункции, Параметры, Выборка.Наименование, Отказ);
		Если Не Отказ Тогда
			СчетчикОбновлено = СчетчикОбновлено + 1;	
		КонецЕсли;
		
		СчетчикВсего = СчетчикВсего + 1;
		
	КонецЦикла;

	Отказ = Ложь;
	Если СчетчикОбновлено = СчетчикВсего Тогда
		ТекстСообщения = СтрШаблон("Выполнено обновление цены товара %1 на всех сайтах (%2)", СвойстваТовара.Код, СчетчикВсего);
	ИначеЕсли СчетчикОбновлено = 0 Тогда	
		ТекстСообщения = СтрШаблон("Обновление цены товара %1 не выполнено", СвойстваТовара.Код);
	Иначе
		Отказ = Истина;
		ТекстСообщения = СтрШаблон("Выполнено обновление цены товара %1 на %2 из %3 сайтах", СвойстваТовара.Код, СчетчикОбновлено, СчетчикВсего);
	КонецЕсли;
КонецПроцедуры


Процедура ОтправитьЗапросPOST(АдресСайта, ИмяФункции, Параметры, ИмяСайта, Отказ)
	
	Разделитель = ?(НЕ СтрЗаканчиваетсяНа(АдресСайта, "/")
		И НЕ СтрНачинаетсяС(ИмяФункции, "/") , "/", "");
		
	URL = АдресСайта + Разделитель + ИмяФункции;
	
	СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(URL);
	ЗащСоед = Неопределено;

	
	Если ВРЕГ(СтруктураАдреса.Схема) = "HTTPS" Тогда
		ЗащСоед = Новый ЗащищенноеСоединениеOpenSSL(
			Новый СертификатКлиентаWindows(),
			Новый СертификатыУдостоверяющихЦентровWindows()
		);
	КонецЕслИ;

	Попытка
	
		Соединение = Новый HTTPСоединение(СтруктураАдреса.Хост, СтруктураАдреса.Порт, СтруктураАдреса.Логин, СтруктураАдреса.Пароль,, 20, ЗащСоед);	
	
	Исключение
		ТекстОшибки = СтрШаблон("Не удалось установить соединение с сайтом %1. %2", ИмяСайта, ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			,
			,
			Отказ
		);
			
		Возврат
	КонецПопытки;
	
	ПараметрыСтр = Новый Массив();
	Для Каждого Параметр Из Параметры Цикл
		
		ЗначениеПараметра = Параметр.Значение;
		Если ТипЗнч(ЗначениеПараметра) = Тип("Число") Тогда
			ЗначениеПараметра = Формат(ЗначениеПараметра, "ЧГ=0;");
		КонецЕсли;
		
		ПараметрыСтр.Добавить(СтрШаблон("%1=%2", Параметр.Ключ, ЗначениеПараметра)); 
	КонецЦикла;

	Запрос = Новый HTTPЗапрос;
	Запрос.АдресРесурса = СтруктураАдреса.ПутьНаСервере + "?" + СтрСоединить(ПараметрыСтр, "&");
		
	Попытка
	
		ОтветHTTP = Соединение.ОтправитьДляОбработки(Запрос);
	
	Исключение
		
		ТекстОшибки = СтрШаблон("Не удалось отправить запрос на сайт %1. %2", ИмяСайта, ОписаниеОшибки());
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			,
			,
			Отказ
		);
		
		Возврат;	
	КонецПопытки;
	
	Если ОтветHTTP.КодСостояния <> 200 Тогда
		ТекстОшибки = СтрШаблон("Не удалось обновить данные на сайте %1. Код ответа сервера: %2", ИмяСайта, ОтветHTTP.КодСостояния);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			ТекстОшибки,
			,
			,
			,
			Отказ
		);
		Возврат
	КонецЕсли;
	
		
КонецПроцедуры
