#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ПолучитьПоследнееЗначение(ВидДокумента, ИмяПоля, Отбор = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Условие = "";
	
	Если Отбор <> Неопределено Тогда
		
		Для каждого ЭлементОтбора Из Отбор Цикл
			
			Условие = Условие + Символы.ПС + СтрШаблон("И Док.%1 = &%1", ЭлементОтбора.Ключ);
			Запрос.УстановитьПараметр(ЭлементОтбора.Ключ, ЭлементОтбора.Значение);
				
		КонецЦикла;
	КонецЕсли; 
	
	
	Запрос.Текст =
		СтрШаблон("ВЫБРАТЬ ПЕРВЫЕ 1
		|	Док.%1 КАК Значение
		|ИЗ
		|	Документ.%2 КАК Док
		|ГДЕ
		|	НЕ Док.ПометкаУдаления 
		|	И Док.%1 <> &ПустоеЗначение %3
		|УПОРЯДОЧИТЬ ПО
		|	Док.Дата УБЫВ",
		ИмяПоля,
		ВидДокумента,
		Условие
	);
	
	ОписаниеТипов = Метаданные.Документы[ВидДокумента].Реквизиты[ИмяПоля].Тип;
	
	Запрос.УстановитьПараметр("ПустоеЗначение", ОписаниеТипов.ПривестиЗначение());
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Значение;
	
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли