
//Устанавливает компоненту для генерации штрих-кодов. Нужно при работе с тонким или веб-клиентом.
//Возвращает истину в случае успеха, ложь - ошибка. Описание ошибки помещаетя в параметр ТекстОшибки
//
//В реальном приложении нужно вызвать только раз. Нужно, чтобы был разрешен режим использования модальности в свойствах конфигурации
Функция УстановитьКомпонентуШтрихКодирования(ТекстОшибки="") Экспорт
	
	Попытка
		НачатьУстановкуВнешнейКомпоненты(,"ОбщийМакет.КомпонентаПечатиШтрихкодов");
		Возврат Истина;
	Исключение
		ТекстОшибки = "ОШИБКА УСТАНОВКИ ВНЕШНЕЙ КОМПОНЕНТЫ: " + ОписаниеОшибки();
		Возврат Ложь;
	КонецПопытки;
	
КонецФункции//ПолучитьКомпонентуШтрихКодирования
