#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс
Функция ВидыРасходовЗакупкаНовые(Результат = Неопределено) Экспорт

	Если Результат = Неопределено Тогда
		Результат = новый Массив();
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыРасходов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыРасходов КАК ВидыРасходов
		|ГДЕ
		|	ВидыРасходов.Наименование В(&Наименование)";
	
	
	Наименования = Новый Массив();
	Наименования.Добавить("ЗАКУПКА ЗАПЧАСТЕЙ новые");
	
	Запрос.УстановитьПараметр("Наименование", Наименования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // ВидыРасходовЗакупкаНовые()


Функция ВидыРасходовЗакупкаБУ(Результат = Неопределено)  Экспорт

	Если Результат = Неопределено Тогда
		Результат = новый Массив();
	КонецЕсли;

	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ВидыРасходов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыРасходов КАК ВидыРасходов
		|ГДЕ
		|	ВидыРасходов.Наименование В(&Наименование)";
	
	
	Наименования = Новый Массив();
	Наименования.Добавить("ЗАКУПКА ЗАПЧАСТЕЙ б/у");
	Наименования.Добавить("ЗАКУПКА ЕВРОПА");
	Наименования.Добавить("ЗАКУПКА ЗАПЧАСТЕЙ РОССИЯ");
	
	Запрос.УстановитьПараметр("Наименование", Наименования);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
	КонецЦикла;
	
	Возврат Результат;
	

КонецФункции 



#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли