
#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	//Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
	//	УстановитьНомерДоговора();
	//	СформироватьНаименованиеДоговора(ЭтаФорма);
	//КонецЕсли;
	УправлениеФормой(ЭтаФорма);
	
	///+ГомзяковаМА 20.02.2023
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ОтветственныйМенеджер = Объект.Владелец.Ответственный;	
	КонецЕсли;
	///-ГомзяковаМА 20.02.2023
	
	/////+ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	//ПоискСуществующихФайлов();
	/////-ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	
	///+ГомзМА 15.06.2023
	Если НЕ ЗначениеЗаполнено(Объект.НомерДокументаПП) Тогда
		ПоследнийНомер = ПолучитьПоследнийНомерДокументаПоПорядку();
	
		Объект.НомерДокументаПП = ПоследнийНомер + 1;
	КонецЕсли;
	///-ГомзМА 15.06.2023
	
КонецПроцедуры

&НаСервере
Процедура ПоискСуществующихФайлов()

	///+ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Файлы.ВладелецФайла КАК ВладелецФайла,
	|	Файлы.Наименование КАК Наименование,
	|	Файлы.ПутьКФайлу КАК ПутьКФайлу,
	|	Файлы.Размер КАК Размер,
	|	Файлы.Расширение КАК Расширение,
	|	Файлы.ПометкаУдаления КАК ПометкаУдаления
	|ИЗ
	|	Справочник.Файлы КАК Файлы
	|ГДЕ
	|	Файлы.ВладелецФайла = &ВладелецФайла";
	
	Запрос.УстановитьПараметр("ВладелецФайла", Объект.Ссылка);
	
	СуществующиеФайлы = Запрос.Выполнить().Выгрузить();

	Если СуществующиеФайлы.Количество() > 0 Тогда
		Объект.СтатусСкана = Перечисления.СтатусыДоговоровСкан.СканПолучен;
	Иначе
		Объект.СтатусСкана = Неопределено;
	КонецЕсли;
	///-ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)

КонецПроцедуры


&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.НомерДоговора) Тогда
		
		УстановитьНомерДоговора();
		СформироватьНаименованиеДоговора(ЭтаФорма);
		
	ИначеЕсли Не ЗначениеЗаполнено(Объект.Наименование) Тогда
		
		СформироватьНаименованиеДоговора(ЭтаФорма);
		
	КонецЕсли;
	
	///+ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	//ПоискСуществующихФайлов();
	///-ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	///+ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	//ПоискСуществующихФайлов();
	///-ГомзМА 21.02.2023 (Задача 000002814 от 20.02.2023)
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ОрганизацияПриИзменении(Элемент)
	
	УстановитьНомерДоговора();
	СформироватьНаименованиеДоговора(ЭтаФорма);
	
КонецПроцедуры



&НаКлиенте
Процедура ДатаДоговораПриИзменении(Элемент)
	
	УстановитьНомерДоговора();
	СформироватьНаименованиеДоговора(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура НомерДоговораПриИзменении(Элемент)
	
	СформироватьНаименованиеДоговора(ЭтаФорма);
	
КонецПроцедуры


&НаКлиенте
Процедура ТипДоговораПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


#КонецОбласти


#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура УстановитьНомерДоговора()

	Если Объект.ТипДоговора <> ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем") Тогда
		Возврат
	КонецЕсли;
	
	ПараметрыДоговора = Новый Структура("Ссылка, Организация, ДатаДоговора");	
	ЗаполнитьЗначенияСвойств(ПараметрыДоговора, Объект);
	

	//Объект.НомерДоговора = дт_ОбщегоНазначения.УникальныйНомерДоговора(ПараметрыДоговора);
	///+ГомзМА 16.06.2023
	НомерДоговора = дт_ОбщегоНазначения.УникальныйНомерДоговора(ПараметрыДоговора);
	Объект.НомерДоговора = "" + Формат(Объект.НомерДокументаПП, "ЧГ=0") + НомерДоговора;
	///-ГомзМА 16.06.2023
	

КонецПроцедуры // УстановитьНомерДоговора()


// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиентеНаСервереБезКонтекста
Процедура СформироватьНаименованиеДоговора(Форма)

	ПараметрыДоговора = Новый Структура("ДатаДоговора, НомерДоговора");	
	ЗаполнитьЗначенияСвойств(ПараметрыДоговора, Форма.Объект);
	
	Форма.Объект.Наименование = дт_ОбщегоНазначенияКлиентСервер.НаименованиеДоговора(ПараметрыДоговора);

КонецПроцедуры // СформироватьНаименованиеДоговора()

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	Элементы.ВидДоговора.Видимость = Объект.ТипДоговора = ПредопределенноеЗначение("Перечисление.ТипыДоговоров.СПокупателем");

КонецПроцедуры // УправлениеФормой()

&НаСервере
Процедура СтатусОригиналаПриИзмененииНаСервере()
	
	/////+ГомзМА 17.02.2023 (Задача 000002747 от 16.02.2023)
	//Если Объект.СтатусОригинала = Перечисления.СтатусыДоговоровОригинал.ОтданЛичноВРуки Тогда
	//	Элементы.ГруппаКомуПереданДокумент.Видимость = Истина;
	//Иначе
	//	Элементы.ГруппаКомуПереданДокумент.Видимость = Ложь;
	//КонецЕсли;
	/////-ГомзМА 17.02.2023 (Задача 000002747 от 16.02.2023)
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусОригиналаПриИзменении(Элемент)
	СтатусОригиналаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВладелецПриИзмененииНаСервере()
	
	///+ГомзяковаМА 20.02.2023
	Если Объект.Ссылка.Пустая() Тогда
		Объект.ОтветственныйМенеджер = Объект.Владелец.Ответственный;	
	КонецЕсли;
	///-ГомзяковаМА 20.02.2023
	
КонецПроцедуры

&НаКлиенте
Процедура ВладелецПриИзменении(Элемент)
	ВладелецПриИзмененииНаСервере();
КонецПроцедуры


Функция ПолучитьПоследнийНомерДокументаПоПорядку()

	///+ГомзМА 15.06.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ДоговорыКонтрагентов.Ссылка КАК Ссылка,
		|	ДоговорыКонтрагентов.НомерДокументаПП КАК НомерДокументаПП
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерДокументаПП УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.НомерДокументаПП;
	///-ГомзМА 15.06.2023

КонецФункции


#КонецОбласти