#Область ОбработчикиСобытийФормы



&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// ++ obrv 12.11.18
	ЭтаФорма.Год = Год(ТекущаяДата());
	ЭтаФорма.Месяц = Месяц(ТекущаяДата());
	// -- obrv 12.11.18
	
	// ++ obrv 16.01.18
    //СписокПродаж.Параметры.УстановитьЗначениеПараметра("КтоПродал",Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь()));
	//Пользователь = Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь());
	Пользователь = ПользователиКлиентСервер.ТекущийПользователь();
    СписокПродаж.Параметры.УстановитьЗначениеПараметра("КтоПродал", Пользователь);
	
	ЭтоПолноправныйПользователь = Пользователи.ЭтоПолноправныйПользователь()
		ИЛИ РольДоступна("дт_Зарплата");
		
	УправлениеФормой(ЭтаФорма);	
	// -- obrv 16.01.18
	ОбновитьСуммы();
	
	
КонецПроцедуры
#КонецОбласти

&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура Месяц1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура Год1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСуммы();
КонецПроцедуры


&НаСервере
Процедура ОбновитьСуммы()  
	
	НачалоПериода = Дата(Год, Месяц, 1);
	КонецПериода = КонецМесяца(НачалоПериода);
	СписокПродаж.Параметры.УстановитьЗначениеПараметра("НачалоПериода", НачалоПериода);
    СписокПродаж.Параметры.УстановитьЗначениеПараметра("КонецПериода", КонецПериода);
	
	
	 податам = ложь;
	 // ++ obrv 03.12.19
	 Текст2 = СписокПродаж.ТекстЗапроса;
	 // -- obrv 03.12.19
	 
	 Если Год >= 2011 ИЛИ  Месяц > 0 Тогда
		 податам = истина;
		 Если Месяц  > 0 И Год < 2011 Тогда
			 Год = Год(ТекущаяДата());
		 КонецЕсли;
	 КонецЕсли;
	 Запрос = Новый Запрос;
	 // ++ obrv 03.12.19
	 Текст = СписокПродаж.ТекстЗапроса;
	 // -- obrv 03.12.19
	 
	 Если податам Тогда				
		Если Месяц > 0 Тогда
			Дат1 = Дата(Год,Месяц,1);
			Дат2 = КонецМесяца(Дат1);
		Иначе
		   Дат1 = Дата(Год,1,1);
		   Дат2 = КонецГода(Дат1);
	   КонецЕсли;
	   // ++ obrv 03.12.19
	   //Текст = Текст + " И ПродажаЗапчастей.Дата >= &Дата1 И ПродажаЗапчастей.Дата < &Дата2";
	   //Текст2 = Текст2 + " И ПродажаЗапчастей.Дата >= &Дата1 И ПродажаЗапчастей.Дата < &Дата2";
	   // -- obrv 03.12.19
	   Запрос.Текст = Текст;
	   // ++ obrv 03.12.19
	   //СписокПродаж.ТекстЗапроса = Текст2;
	   //СписокПродаж.Параметры.УстановитьЗначениеПараметра("Дата1",Дат1);
	   //СписокПродаж.Параметры.УстановитьЗначениеПараметра("Дата2",Дат2);
	   // -- obrv 03.12.19
	   Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	   Запрос.УстановитьПараметр("КонецПериода", КонецПериода);
   Иначе
	   Запрос.Текст = Текст;
	   СписокПродаж.ТекстЗапроса = Текст2;
   КонецЕсли; 
   //СписокПродаж.Параметры.УстановитьЗначениеПараметра("КтоПродал",Пользователь);
   Запрос.УстановитьПараметр("КтоПродал",Пользователь);
   Итого = Запрос.Выполнить().Выгрузить().Итог("Заработано");
   
	Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	        |	Расходы.Сумма
	        |ИЗ
	        |	Документ.Расходы КАК Расходы
	        |ГДЕ
	        |	Расходы.Зарплата = ИСТИНА
	        |	И Расходы.Работник = &Пользователь";
	Запрос.Текст = Текст;		
	Если податам Тогда
		Если Месяц > 0 Тогда		
	    	Текст = Текст + " И Расходы.Месяц = " + Месяц + " И Расходы.Год = &Год";
		Иначе
			Текст = Текст + " И Расходы.Год = &Год";
		КонецЕсли;
		Запрос.Текст = Текст;
		Запрос.УстановитьПараметр("Год",Год);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	Выдано = Запрос.Выполнить().Выгрузить().Итог("Сумма");
	Если Итого > 0 Тогда
		Осталось = Итого - Выдано;
	Иначе
		Осталось = 0;
	КонецЕсли;
	// ++ obrv 12.11.18
	//Сообщить( податам);
	//Сообщить( Месяц);
	//Сообщить( Пользователь.ФиксированаяЧастьЗарплаты);
	// -- obrv 12.11.18
	Если податам И Месяц  > 0 Тогда 
		Осталось = Осталось + Пользователь.ФиксированаяЧастьЗарплаты;
	КонецЕсли;

	
КонецПроцедуры

&НаКлиенте
Процедура ПоказателиРаботы(Команда)
	ОткрытьФорму("Обработка.УстановкаПоказателейСотрудников.Форма");
КонецПроцедуры


&НаКлиенте
Процедура СписокПродажСсылкаНажатие(Элемент, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	КонецПроцедуры


&НаКлиенте
Процедура ОткрытьПродажу(Команда)
	// Вставить содержимое обработчика.
	стр = Элементы.СписокПродаж.ТекущиеДанные;
	стр.Ссылка.ПолучитьФорму().ОткрытьМодально();
КонецПроцедуры



#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Элементы.Пользователь.ТолькоПросмотр = НЕ Форма.ЭтоПолноправныйПользователь;

КонецПроцедуры // УправлениеФормой()



#КонецОбласти


