Функция СформироватьСтруктуруОшибки(Message, Details)

	СтруктураОтвета = Новый Структура;

	СтруктураОтвета.Вставить("message", Message);
	СтруктураОтвета.Вставить("details", Details);

	Возврат СтруктураОтвета;
КонецФункции

Функция Авторизацияauth(Запрос)
	
	Тело = Запрос.ПолучитьТелоКакстроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);
	СтруктураТела = ПрочитатьJSON(ЧтениеJSON);
	
	НомерТелефона				= СтруктураТела.phone; 
	Имя							= СтруктураТела.name;
	Структура = АвторизацияУчастниковАкции10. СоздатьНовогоучастникаАкции(Имя,НомерТелефона); 
	
	Если Структура.ДобавленУчастник = Истина Тогда 
		СтрокаДляОтвета = Структура.Сообщение; 
		Ответ = Новый HTTPСервисОтвет(200); //401 - не авторизован , 500 - ошибка сервера , 404 - не найдено
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	Иначе 
		СтрокаДляОтвета = Структура.Сообщение; 
		Ответ = Новый HTTPСервисОтвет(200); //401 - не авторизован , 500 - ошибка сервера , 404 - не найдено
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
	КонецЕсли; 
	
КонецФункции

Функция КоличествоУчастниковАкцииКоличествоУчастниковАкции(Запрос)
	
	Количество = АвторизацияУчастниковАкции10. КоличествоУчастникаАкции(); 
	
	СтрокаДляОтвета = Количество; 
	Ответ = Новый HTTPСервисОтвет(200); //401 - не авторизован , 500 - ошибка сервера , 404 - не найдено
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

КонецФункции

Функция СписокТоваровlistOfProducts(Запрос)
	
	Массив = ОперативныйУчетАкция10.СписокТоваровАкция10(); 
	Если ЗначениеЗаполнено(Массив) Тогда 
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		Информация = ИнформацияОбОшибке();
		ЗаписатьJSON(ЗаписьJSON, Массив);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);

		Возврат Ответ;

	Иначе
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		
		//Информация = ИнформацияОбОшибке();

		ЗаписатьJSON(ЗаписьJSON, СформироватьСтруктуруОшибки("Товар не найден",
			"Ошибка при вызове чего - там"));
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();

		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

		Ответ.УстановитьТелоИзСтроки( СтрокаДляОтвета);
	КонецЕсли;

КонецФункции

Функция ПолучитьТоварыКарточкиGetCardProducts(Запрос)
	
	//==================================================================================================================
	Тело = Запрос.ПолучитьТелоКакстроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);
	СтруктураТела = ПрочитатьJSON(ЧтениеJSON);
	АйдиКарточки = СтруктураТела.cardId; 
	//==================================================================================================================
	
	Массив = ОперативныйУчетАкция10.ПолучитьТоварыКарточкиАкция10(АйдиКарточки); 
	Если ЗначениеЗаполнено(Массив) Тогда 
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		Информация = ИнформацияОбОшибке();
		ЗаписатьJSON(ЗаписьJSON, Массив);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);

		Возврат Ответ;

	Иначе
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		//Информация = ИнформацияОбОшибке();
		ЗаписатьJSON(ЗаписьJSON, СформироватьСтруктуруОшибки("Товар не найден",
			"Ошибка при вызове чего - там"));
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();

		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

		Ответ.УстановитьТелоИзСтроки( СтрокаДляОтвета);
	КонецЕсли;
	
	
КонецФункции

Функция Забронироватьreserve(Запрос)
	
	//==================================================================================================================
	Тело = Запрос.ПолучитьТелоКакстроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);
	СтруктураТела = ПрочитатьJSON(ЧтениеJSON);
	
	АйдиТовара 		= СтруктураТела.tovId; 
	НомерТелефона	= СтруктураТела.phone; 
	//==================================================================================================================
	
	Массив = ОперативныйУчетАкция10.ЗабронироватьТовар(АйдиТовара,НомерТелефона); 
	Если ЗначениеЗаполнено(Массив) Тогда 
		
		Ответ = Новый HTTPСервисОтвет(200);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		Информация = ИнформацияОбОшибке();
		ЗаписатьJSON(ЗаписьJSON, Массив);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);

		Возврат Ответ;

	Иначе
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();

		ЗаписатьJSON(ЗаписьJSON, СформироватьСтруктуруОшибки("Товар не найден",
			"Ошибка при вызове чего - там"));
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();

		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

		Ответ.УстановитьТелоИзСтроки( СтрокаДляОтвета);
	КонецЕсли;
КонецФункции
