
Функция Авторизацияauth(Запрос)
	
	Тело = Запрос.ПолучитьТелоКакстроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);
	СтруктураТела = ПрочитатьJSON(ЧтениеJSON);
	
	НомерТелефона				= СтруктураТела.phone; 
	Имя							= СтруктураТела.name;
	Структура = АвторизацияУчастниковАкции10. СоздатьНовогоучастникаАкции(Имя,НомерТелефона); 
	
	Если Структура.ДобавленУчастник = Истина Тогда 
		СтрокаДляОтвета = Структура.Сообщение; 
		Ответ = Новый HTTPСервисОтвет(200); //401 - не авторизован , 500 - ошибка сервера , 404 - не найдено
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
		Возврат Ответ;
	Иначе 
		СтрокаДляОтвета = Структура.Сообщение; 
		Ответ = Новый HTTPСервисОтвет(200); //401 - не авторизован , 500 - ошибка сервера , 404 - не найдено
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;
	КонецЕсли; 
	
КонецФункции

Функция КоличествоУчастниковАкцииКоличествоУчастниковАкции(Запрос)
	
	Количество = АвторизацияУчастниковАкции10. КоличествоУчастникаАкции(); 
	
	СтрокаДляОтвета = Количество; 
	Ответ = Новый HTTPСервисОтвет(200); //401 - не авторизован , 500 - ошибка сервера , 404 - не найдено
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
	Возврат Ответ;

КонецФункции
