

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

#КонецОбласти



&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ Элементы.ГруппаДетально.Видимость Тогда
		Объект.Наименование = Объект.VIN;
	КонецЕсли;
КонецПроцедуры


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.Модель) Тогда
		МодельПриИзмененииСервер();
	КонецЕсли;
	
КонецПроцедуры

// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
&НаСервере
Процедура МодельПриИзмененииСервер()

	Объект.Наименование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Модель, "Наименование");

КонецПроцедуры
 // МодельПриИзмененииСервер()


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	//Элементы = Форма.Элементы;
	//ИспользоватьРазборку = Форма.ПолучитьФункциональнуюОпциюФормы("дт_ИспользоватьРазборку");
	//ИспользоватьАвтосервис = Форма.ПолучитьФункциональнуюОпциюФормы("дт_ИспользоватьАвтосервис");
	//
	//Элементы.ГруппаДетально.Видимость = ИспользоватьАвтосервис И НЕ ИспользоватьРазборку;
	//
КонецПроцедуры


#КонецОбласти