
&НаКлиенте
Процедура Печать(Команда)
	ТабДок = Новый ТабличныйДокумент;
	Попытка
	ПечатьНаСервере(ТабДок, Объект.Ссылка);
	Исключение
	КонецПопытки;
	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	
КонецПроцедуры

&НаСервере
Процедура ПечатьНаСервере(ТабДок, Ссылка)
	
	ЭтаФорма.Записать();

	
	Документы.Расписка.Печать(ТабДок, Ссылка );
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	СотрудникПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура СотрудникПриИзмененииНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.ПаспортСерияНомер,
		|	Сотрудники.ПаспортКемВыдан,
		|	Сотрудники.ПаспортДатаВыдачи,
		|	Сотрудники.ПаспортКодПодразделения,
		|	Сотрудники.КонтактнаяИнформация.(
		|		Представление) КАК Адрес
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Объект.СерияИНомер = Выборка.ПаспортСерияНомер;
		Объект.Выдан = Выборка.ПаспортКемВыдан;
		Объект.КодПодразделения = Выборка.ПаспортКодПодразделения;
		Объект.ДатаВыдачи = Выборка.ПаспортДатаВыдачи;
		
	КонецЦикла;
	
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиКонтактнаяИнформация.Представление КАК Адресрегистрации,
		|	СотрудникиКонтактнаяИнформация.Представление КАК АдресФактический
		|ИЗ
		|	Справочник.Сотрудники.КонтактнаяИнформация КАК СотрудникиКонтактнаяИнформация
		|ГДЕ
		|	(СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресРегистрации)
		|	ИЛИ СотрудникиКонтактнаяИнформация.Вид = ЗНАЧЕНИЕ(Справочник.ВидыКонтактнойИнформации.АдресСотрудникаФактический))
		|	И СотрудникиКонтактнаяИнформация.Ссылка = &Ссылка";
		
	Запрос.УстановитьПараметр("Ссылка", Объект.Сотрудник);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.Адресрегистрации <> "" Тогда 
			Объект.АдресРегистрации = Выборка.Адресрегистрации;
		Иначе
			Объект.АдресРегистрации = Выборка.АдресФактический;
		КонецЕсли;
	КонецЦикла;
	
	
КонецПроцедуры
