
Процедура ПослеЗаписью(Отказ)
	
//Если НЕ Родитель = Справочники.ФОТ.ПустаяСсылка() Тогда
//	РодительОбъект = Родитель.ПолучитьОбъект();
//
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗПФакт), 0) КАК СредняяЗПФакт,
//		|	ЕСТЬNULL(СУММА(ФОТ.ОкладФакт), 0) КАК ОкладФакт,
//		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияФакт), 0) КАК МотивацияФакт,
//		|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗППлан), 0) КАК СредняяЗППлан,
//		|	ЕСТЬNULL(СУММА(ФОТ.ОкладПлан), 0) КАК ОкладПлан,
//		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияПлан), 0) КАК МотивацияПлан,
//		|	ЕСТЬNULL(СУММА(ФОТ.НижнийУровеньЗП), 0) КАК НижнийУровеньЗП,
//		|	ЕСТЬNULL(СУММА(ФОТ.СреднийУровеньЗП), 0) КАК СреднийУровеньЗП,
//		|	ЕСТЬNULL(СУММА(ФОТ.ВерхнийУровеньЗП), 0) КАК ВерхнийУровеньЗП
//		|ИЗ
//		|	Справочник.ФОТ КАК ФОТ
//		|ГДЕ
//		|	ФОТ.Родитель = &Родитель";
//	
//	Запрос.УстановитьПараметр("Родитель", Родитель);
//	
//	РезультатЗапроса = Запрос.Выполнить().Выбрать();
//	
//	РезультатЗапроса.Следующий();
//	
//	РодительОбъект.СредняяЗПФакт = РезультатЗапроса.СредняяЗПФакт;
//	РодительОбъект.ОкладФакт = РезультатЗапроса.ОкладФакт;
//	РодительОбъект.МотивацияФакт = РезультатЗапроса.МотивацияФакт;
//	РодительОбъект.СредняяЗППлан = РезультатЗапроса.СредняяЗППлан;
//	РодительОбъект.ОкладПлан = РезультатЗапроса.ОкладПлан;
//	РодительОбъект.МотивацияПлан = РезультатЗапроса.МотивацияПлан;
//	РодительОбъект.НижнийУровеньЗП = РезультатЗапроса.НижнийУровеньЗП;
//	РодительОбъект.СреднийУровеньЗП = РезультатЗапроса.СреднийУровеньЗП;
//	РодительОбъект.ВерхнийУровеньЗП = РезультатЗапроса.ВерхнийУровеньЗП;
//	
//	РодительОбъект.Записать();
//	
//КонецЕсли

КонецПроцедуры
