
Процедура ПередЗаписью(Отказ)
	
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ЦентрРасхода.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ЦентрРасхода КАК ЦентрРасхода
	|ГДЕ
	|	ЦентрРасхода.ФОТ = &ФОТ";

Запрос.УстановитьПараметр("ФОТ", Ссылка);

РезультатЗапроса = Запрос.Выполнить().Выбрать();

Если РезультатЗапроса.Количество() > 0 Тогда
	Пока РезультатЗапроса.Следующий() Цикл
		СправочникОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		СправочникОбъект.Зарплата = ЗПФакт;
		СправочникОбъект.Записать();
	КонецЦикла;
КонецЕсли;

КонецПроцедуры


