
&НаКлиенте
Процедура ПриОткрытии(Отказ)
    
    Штрихкод = Получитькомпоненту();  
	Элементы.QRКод.РазмерКартинки = РазмерКартинки.АвтоРазмер;

КонецПроцедуры  
&НаСервере
Функция Получитькомпоненту()
	
	ТекстОшибки = "";
	
	Штрихкод =  ГенераторШтрихКода.ПолучитьКомпонентуШтрихКодирования(ТекстОшибки); 
	Штрихкод.Ширина = 260; 
	Штрихкод.Высота = 260;
	Штрихкод.ТипКода = 16;
	Штрихкод.УголПоворота = 0;
	Штрихкод.ЗначениеКода = Объект.Номер;
	Штрихкод.ПрозрачныйФон = Истина;
	Штрихкод.ОтображатьТекст = Ложь;
	
	ДвоичныйШтрихКод = штрихкод.ПолучитьШтрихКод();
	КартинкаШтрихКод = Новый Картинка(ДвоичныйШтрихКод, Истина);
	
	QRкод = ПоместитьВоВременноеХранилище(КартинкаШтрихКод,УникальныйИдентификатор);
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьПродажу(Команда)
	ОбновитьПродажуНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьПродажуНаСервере()
	
	Если Объект.Продажа <> Документы.ПродажаЗапчастей.ПустаяСсылка() Тогда
		ОбъектПродажа = Объект.Продажа.ПолучитьОбъект();
		ОбъектПродажа.Таблица.Очистить();
		Для Каждого СтрокаТЧЗаявки Из Объект.Товары Цикл
			НоваяСтрока = ОбъектПродажа.Таблица.Добавить();
			НоваяСтрока.Партия = СтрокаТЧЗаявки.Партия;
			//НоваяСтрока.Код = СтрокаТЧЗаявки.Номенклатура.Код;
			//НоваяСтрока.Артикул = СтрокаТЧЗаявки.Номенклатура.Артикул;
			НоваяСтрока.Товар = СтрокаТЧЗаявки.Номенклатура;
			НоваяСтрока.Количество = СтрокаТЧЗаявки.Количество;
			НоваяСтрока.Цена = СтрокаТЧЗаявки.Цена;
			НоваяСтрока.СуммаНДС = СтрокаТЧЗаявки.СуммаНДС;
			НоваяСтрока.Сумма = СтрокаТЧЗаявки.Сумма;	
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
Если Объект.ТипСделки = Перечисления.ТипСделки.Продажа И Объект.Продажа = Документы.ПродажаЗапчастей.ПустаяСсылка() Тогда
	НовыйДокумент = Документы.ПродажаЗапчастей.СоздатьДокумент();
	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	НовыйДокумент.Клиент = Объект.Клиент;
	
	Для Каждого СтрокаТЧЗаявки Из Объект.Товары Цикл
		НоваяСтрока = НовыйДокумент.Таблица.Добавить();
		НоваяСтрока.Партия = СтрокаТЧЗаявки.Партия;
		//НоваяСтрока.Код = СтрокаТЧЗаявки.Номенклатура.Код;
		//НоваяСтрока.Артикул = СтрокаТЧЗаявки.Номенклатура.Артикул;
		НоваяСтрока.Товар = СтрокаТЧЗаявки.Номенклатура;
		НоваяСтрока.Количество = СтрокаТЧЗаявки.Количество;
		НоваяСтрока.Цена = СтрокаТЧЗаявки.Цена;
		НоваяСтрока.СуммаНДС = СтрокаТЧЗаявки.СуммаНДС;
		НоваяСтрока.Сумма = СтрокаТЧЗаявки.Сумма;	
	КонецЦикла;
	
	НовыйДокумент.Записать();
	
	ОбъектЗаявка = Объект.Ссылка.ПолучитьОбъект();
	ОбъектЗаявка.Продажа = Документы.ПродажаЗапчастей.НайтиПоНомеру(НовыйДокумент.Номер);
	ОбъектЗаявка.Записать();
	
КонецЕсли;

КонецПроцедуры
