
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		
		Дата		   = ТекущаяДата();
		Склад 		   = ДанныеЗаполнения.Склад;
		Клиент 	       = ДанныеЗаполнения.Клиент;
		Продажа 	   = ДанныеЗаполнения.Ссылка;
		Ответственный  = ДанныеЗаполнения.КтоПродал;
		СлужбаДоставки = ДанныеЗаполнения.Доставка;
		Инициатор 	   = Пользователи.ТекущийПользователь();
		
		Для Каждого ТекСтрокаТаблица Из ДанныеЗаполнения.Таблица Цикл
			Если ТекСтрокаТаблица.Отменено Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Комментарий = ТекСтрокаТаблица.Комментарий;
				НоваяСтрока.Количество  = ТекСтрокаТаблица.Количество;
				НоваяСтрока.Отменено 	= ТекСтрокаТаблица.Отменено;
				НоваяСтрока.ПродНак 	= ТекСтрокаТаблица.ПродНак;
				НоваяСтрока.машина 		= ТекСтрокаТаблица.машина;
				НоваяСтрока.Партия 		= ТекСтрокаТаблица.Партия;
				НоваяСтрока.Скидка 		= ТекСтрокаТаблица.Скидка;
				НоваяСтрока.Склад 		= ДанныеЗаполнения.Склад;
				НоваяСтрока.Сумма 		= ТекСтрокаТаблица.Сумма;
				НоваяСтрока.Товар 		= ТекСтрокаТаблица.Товар;
				НоваяСтрока.укод 		= ТекСтрокаТаблица.укод;
				НоваяСтрока.Цена		= ТекСтрокаТаблица.Цена;	
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Состояние = Перечисления.СтатусыАктаВозврата.Разнесено Тогда	
		Движения.РегистрНакопления1.Записывать = Истина;
		
		Для Каждого ТекСтрокаТаблица Из Таблица Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Колво  	 = ТекСтрокаТаблица.Количество;
			Движение.машина 	 = ТекСтрокаТаблица.машина;
			Движение.индкод 	 = ТекСтрокаТаблица.партия;
			Движение.Товар 	  	 = ТекСтрокаТаблица.Товар;
			Движение.Склад  	 = Склад;
			Движение.Период 	 = Дата;					
		КонецЦикла;	
	КонецЕсли
	
	
КонецПроцедуры
