
&НаКлиенте
Процедура ПоказатьРезультаты(Команда)
	ТабДокумент = ПечатьСервер();
	ТабДокумент.Показать();
КонецПроцедуры


&НаСервере
Функция ПечатьСервер()

	рез = ПриготовитьДляОтчета();
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	обл = Макет.ПолучитьОбласть("шапка");
	обл.Параметры.месяц = Формат(Дата(Год,Месяц,1), "ДФ=""ММММ гггг""");
	ТабДокумент.Вывести(обл);
	обл = Макет.ПолучитьОбласть("строка");
	а = 0;
	ав = 0;
	под = 0;
	подв = 0;
	прем = 0;
	другое = 0;
	всего = 0;
	всегов = 0;
	ост = 0;
	Для Каждого стр из рез Цикл
		обл.Параметры.н = стр.н;
		обл.Параметры.фио = стр.фио;
		обл.Параметры.а = стр.а;
		обл.Параметры.ав = стр.аВыдано;
		обл.Параметры.под = стр.под;
		обл.Параметры.подв = стр.подВыдано;
		обл.Параметры.прем = стр.прем;
		обл.Параметры.другое = стр.другое;
		обл.Параметры.всего = стр.всего;
		обл.Параметры.всегов = стр.всегоВыдано;
		обл.Параметры.ост = стр.ост;
		ТабДокумент.Вывести(обл);
		а = а + стр.а;
		ав = ав + стр.аВыдано;
		под = под + стр.под;
		подв = подв + стр.подВыдано;
		прем = прем + стр.прем;
		другое = другое + стр.другое;
		всего = всего + стр.всего;
		всегов = всегов + стр.всегоВыдано;
		ост = ост + стр.ост;
	КонецЦикла;
	обл = Макет.ПолучитьОбласть("подвал");
	обл.Параметры.а = а;
	обл.Параметры.ав = ав;
	обл.Параметры.под = под;
	обл.Параметры.подв = подв;
	обл.Параметры.прем = прем;
	обл.Параметры.другое = другое;
	обл.Параметры.всего = всего;
	обл.Параметры.всегов = всегов;
	обл.Параметры.ост = ост;
	ТабДокумент.Вывести(обл);
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Месяц = Месяц(ТекущаяДата());
	Год = Год(ТекущаяДата());
КонецПроцедуры

&НаСервере
Функция ПриготовитьДляОтчета()
	запрос = Новый Запрос;
	рез = Новый Массив;
	
	запрос.Текст="ВЫБРАТЬ
	             |	Пользователи.Ссылка,
	             |	Пользователи.ВерсияДанных,
	             |	Пользователи.ПометкаУдаления,
	             |	Пользователи.Предопределенный,
	             |	Пользователи.Код,
	             |	Пользователи.Наименование,
	             |	Пользователи.ФИО,
	             |	Пользователи.ФиксированаяЧастьЗарплаты,
	             |	Пользователи.Аванс,
	             |	Пользователи.ПоказыватьВПланировании
	             |ИЗ
	             |	Справочник.Пользователи КАК Пользователи
	             |ГДЕ
	             |	Пользователи.ПоказыватьВПланировании = ИСТИНА";
	Пользователи = запрос.Выполнить().Выгрузить();
	н = 1;
	Для каждого п из Пользователи Цикл
		з2 = Новый запрос;
		з2.Текст="ВЫБРАТЬ РАЗРЕШЕННЫЕ
		         |	Расходы.Сумма,
		         |	Расходы.ВидВыдачи
		         |ИЗ
		         |	Документ.Расходы КАК Расходы
		         |ГДЕ
		         |	Расходы.Работник = &Работник
		         |	И Расходы.Проведен = ИСТИНА
		         |	И Расходы.Месяц = &Месяц
		         |	И Расходы.Год = &Год";
		з2.УстановитьПараметр("Месяц",Месяц);
		з2.УстановитьПараметр("Год",Год);
		з2.УстановитьПараметр("Работник",п.Ссылка);
		зп = з2.Выполнить().Выгрузить();
		премВыдано = 0;
		авансВыдано = 0;
		подсчетВыдано = 0;
		другое = 0;
		Для Каждого з Из зп Цикл
			Если з.ВидВыдачи = Перечисления.ВидВыдачиДенег.Аванс Тогда
				авансВыдано = авансВыдано + з.Сумма;
			КонецЕсли;
			Если з.ВидВыдачи = Перечисления.ВидВыдачиДенег.Подсчет Тогда
				подсчетВыдано = подсчетВыдано + з.Сумма;
			КонецЕсли;
			Если з.ВидВыдачи = Перечисления.ВидВыдачиДенег.Премия Тогда
				премВыдано = премВыдано + з.Сумма;
			КонецЕсли;
			Если з.ВидВыдачи <> Перечисления.ВидВыдачиДенег.Аванс И 
				з.ВидВыдачи <> Перечисления.ВидВыдачиДенег.Подсчет И 
				з.ВидВыдачи <> Перечисления.ВидВыдачиДенег.Премия Тогда
				другое = другое + з.Сумма;
			КонецЕсли
		КонецЦикла;

		рез1 = Новый Структура;
		рез1.Вставить("н",н);
		рез1.Вставить("фио",п.ФИО);
		рез1.Вставить("а",п.Аванс);
		рез1.Вставить("аВыдано",авансВыдано);
		рез1.Вставить("под",п.ФиксированаяЧастьЗарплаты - п.Аванс);
		рез1.Вставить("подВыдано",подсчетВыдано);
		рез1.Вставить("прем",премВыдано);	
		рез1.Вставить("другое",другое);
		рез1.Вставить("всего",п.ФиксированаяЧастьЗарплаты);
		рез1.Вставить("всегоВыдано",зп.Итог("Сумма")-премВыдано-другое);
		рез1.Вставить("ост",п.ФиксированаяЧастьЗарплаты-подсчетВыдано-авансВыдано);

		рез.Добавить(рез1);
		н=н+1;
	КонецЦикла;
	Возврат рез;
КонецФункции

&НаСервере
Процедура УстановитьМесяцГод()
	ВыдачаДенег.Параметры.УстановитьЗначениеПараметра("Месяц",Месяц);
	ВыдачаДенег.Параметры.УстановитьЗначениеПараметра("Год",Год);
КонецПроцедуры


&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.ПланированиеРасходовНаЗарплату.ПолучитьМакет(название);
КонецФункции

&НаКлиенте
Процедура ПоказатьРасходы(Команда)
	// Вставить содержимое обработчика.
	УстановитьМесяцГод();
	Элементы.ВыдачаДенег.Видимость = Истина;
КонецПроцедуры
