#Область ПрограммныйИнтерфейс

// Определяет разделы, в которых доступна команда вызова дополнительных обработок.
// В Разделы необходимо добавить метаданные тех разделов,
// в которых размещены команды вызова.
// 
// Для рабочего стола вместо Метаданных необходимо добавлять
// ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных обработок.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
Процедура ОпределитьРазделыСДополнительнымиОбработками(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.Отчеты);
	//Разделы.Добавить(Метаданные.Подсистемы.Продажа);
	//Разделы.Добавить(Метаданные.Подсистемы.Поступления);
	Разделы.Добавить(Метаданные.Подсистемы.Склад);
	Разделы.Добавить(Метаданные.Подсистемы.дт_Автосервис);
	Разделы.Добавить(Метаданные.Подсистемы.дт_Грузоперевозки);
	Разделы.Добавить(Метаданные.Подсистемы.РасходыРазборки);
	Разделы.Добавить(Метаданные.Подсистемы.дт_Зарплата);
	//Разделы.Добавить(Метаданные.Подсистемы.РасходыРазборки);
	//Разделы.Добавить(Метаданные.Подсистемы.Зарплата);
	//Разделы.Добавить(Метаданные.Подсистемы.Касса);
	//Разделы.Добавить(Метаданные.Подсистемы.Справочники);
	
КонецПроцедуры

// Определяет разделы, в которых доступна команда вызова дополнительных отчетов.
// В Разделы необходимо добавить метаданные тех разделов, 
// в которых размещены команды вызова.
// 
// Для рабочего стола вместо Метаданных необходимо добавлять
// ДополнительныеОтчетыИОбработкиКлиентСервер.ИдентификаторРабочегоСтола().
//
// Параметры:
//   Разделы - Массив - Разделы, в которых размещены команды вызова дополнительных отчетов.
//       * ОбъектМетаданных: Подсистема - Метаданные раздела (подсистемы).
//       * Строка - Для рабочего стола.
//
Процедура ОпределитьРазделыСДополнительнымиОтчетами(Разделы) Экспорт
	
	Разделы.Добавить(Метаданные.Подсистемы.Отчеты);
	//Разделы.Добавить(Метаданные.Подсистемы.Продажа);
	//Разделы.Добавить(Метаданные.Подсистемы.Поступления);
	Разделы.Добавить(Метаданные.Подсистемы.Склад);
	Разделы.Добавить(Метаданные.Подсистемы.дт_Автосервис);
	Разделы.Добавить(Метаданные.Подсистемы.дт_Грузоперевозки);
	Разделы.Добавить(Метаданные.Подсистемы.РасходыРазборки);
	Разделы.Добавить(Метаданные.Подсистемы.дт_Зарплата);
	//Разделы.Добавить(Метаданные.Подсистемы.Касса);
	//Разделы.Добавить(Метаданные.Подсистемы.Справочники);
	
	
КонецПроцедуры

#КонецОбласти
