//
//  https://nov-soft.ru
//

#Область ПрограммныйИнтерфейс


Процедура ВыполнитьКоманду(Форма, ИмяКоманды, ИмяСправочника, ИмяПоляОсновной) Экспорт

	Объект = Форма.Объект;
	
	Если СтрНачинаетсяС(ИмяКоманды, "ПодчиненныеСправочникиУстановитьОсновной") Тогда
		
		ТекущийЭлемент = Форма.ТекущийЭлемент;
		ЭлементРодитель = ТекущийЭлемент.Родитель;
		УИ = ЭлементРодитель.Имя; //СтрЗаменить(ТекущийЭлемент.Имя, "КнопкаОсновной", "");
		УИ = дт_ОбщегоНазначенияКлиентСервер.Строка_в_ГУИД(УИ);
		ТекущаяСсылка = дт_ОбщегоНазначенияВызовСервера.ПолучитьСсылкуПоУИ(УИ, ИмяСправочника);
		
		Объект[ИмяПоляОсновной] = ТекущаяСсылка;
		
		//ТекущийЭлемент.Пометка = Истина;
		ТекущийЭлемент.Картинка = БиблиотекаКартинок.Успешно;
		
		// Отжать остальные кнопки
		ИмяТаблицыФормы = ПолучитьИмяТаблицыФормы(ИмяСправочника);
		Для Индекс = 0 По Форма[ИмяТаблицыФормы].Количество() - 1 Цикл
			
			//дт_ОбщегоНазначенияКлиентСервер.ГУИД_в_строку(СтрокаТаблицы.Ссылка.УникальныйИдентификатор());
			Кнопка = Форма.Элементы.Найти(ЭлементРодитель.Родитель.Имя + "КнопкаОсновной" + Индекс);
			Если Кнопка <> Неопределено
				И Кнопка <> ТекущийЭлемент Тогда
				
				//Кнопка.Пометка = Ложь;
				Кнопка.Картинка = БиблиотекаКартинок.УспешноЖелтый;
				
			КонецЕсли;
		
		КонецЦикла;
		
	ИначеЕсли СтрНачинаетсяС(ИмяКоманды, "ПодчиненныеСправочникиУдалить") Тогда	
		ТекущийЭлемент = Форма.ТекущийЭлемент;
		Индекс = СтрЗаменить(ТекущийЭлемент.Имя, ТекущийЭлемент.Родитель.Родитель.Имя + "КнопкаУдалить", "");
		Индекс = Число(Индекс);
		
		
		ИмяТаблицыФормы = ПолучитьИмяТаблицыФормы(ИмяСправочника);
		СтрокаТаблицы = Форма[ИмяТаблицыФормы][Индекс];
		Отказ = Ложь;
		
		дт_ПодчиненныеСправочникиВызовСервера.УдалитьЭлемент(СтрокаТаблицы.Ссылка, Отказ);
		
		// Скрыть группу, чтобы не сбилась нумерация
		Если Не Отказ Тогда
			ИмяГруппы = дт_ОбщегоНазначенияКлиентСервер.ГУИД_в_строку(СтрокаТаблицы.Ссылка.УникальныйИдентификатор());
			
			Группа = Форма.Элементы.Найти(ИмяГруппы);
			
			Если Группа <> Неопределено Тогда
				Группа.Видимость = Ложь;
			КонецЕсли;
			
		КонецЕсли;	
	КонецЕсли;	
	

КонецПроцедуры

Процедура ПриИзменении(Форма, Элемент, ИмяСправочника) Экспорт

	// Установить признак Модицицирован
	ИндексСтроки = Число(Прав(Элемент.Имя, 1));
	ИмяТаблицы = ПолучитьИмяТаблицыФормы(ИмяСправочника);
    Форма[ИмяТаблицы][ИндексСтроки].Модифицирован = Истина;
	
КонецПроцедуры






#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьИмяТаблицыФормы(ИмяСправочника)

	Возврат дт_ПодчиненныеСправочникиКлиентСервер.ПолучитьИмяТаблицыФормы(ИмяСправочника);	

КонецФункции // ПолучитьИмяТаблицыФормы()


#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти