
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из ПлановыеРемонты Цикл
	
		Если НЕ СтрокаТаблицы.ВидПланированияПоВыработке 
			И Не ЗначениеЗаполнено(СтрокаТаблицы.Периодичность) Тогда
			
			Путь = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("ПлановыеРемонты", СтрокаТаблицы.НомерСтроки, "Периодичность");
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Не заполнена колонка Периодичность в строке %1 списка ""Плановые ремонты""",
					СтрокаТаблицы.НомерСтроки),
				,
				Путь,
				"Объект",
				Отказ
			);
				
			
		КонецЕсли;
	
	КонецЦикла;
	
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли