Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТИПЗНЧ(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаЗакупкаТовара")  Тогда
		
		Основание =  ДанныеЗаполнения; 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Товар КАК Товар,
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Количество КАК Количество
			|ИЗ
			|	Документ.ЗаявкаЗакупкаТовара.ЗакупленныйТовар КАК ЗаявкаЗакупкаТовараЗакупленныйТовар
			|ГДЕ
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ЗакупленныйТовар.Загрузить(Запрос.Выполнить().Выгрузить());
		
	КонецЕСли; 
	
КонецПроцедуры




Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(Основание) Тогда 
		ДокОбъект = Основание.ПолучитьОбъект(); 
		ДокОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.ВРаботе; 
		ДокОбъект.Записать();
	КонецЕСли; 
КонецПроцедуры


Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ЗначениеЗаполнено(Основание) Тогда 
		ДокОбъект = Основание.ПолучитьОбъект(); 
		ДокОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.Ожидание; 
		ДокОбъект.Записать();
	КонецЕсли; 
КонецПроцедуры
