Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТИПЗНЧ(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаЗакупкаТовара")  Тогда
		
		Основание =  ДанныеЗаполнения; 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Товар КАК Товар,
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Количество КАК Количество
			|ИЗ
			|	Документ.ЗаявкаЗакупкаТовара.ЗакупленныйТовар КАК ЗаявкаЗакупкаТовараЗакупленныйТовар
			|ГДЕ
			|	ЗаявкаЗакупкаТовараЗакупленныйТовар.Ссылка = &Ссылка";
		
		Запрос.УстановитьПараметр("Ссылка", Основание);
		ЗакупленныйТовар.Загрузить(Запрос.Выполнить().Выгрузить()); 
		
		Для Каждого Строка Из ЗакупленныйТовар Цикл 
			Если НЕ ЗначениеЗаполнено(Строка.СтатусПоступления ) Тогда 
				Строка.СтатусПоступления = Перечисления.СтатусЗакупкиТовара.ОжидаемПоступление; 
			КонецЕсли; 
		КонецЦикла;
	КонецЕСли; 
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ЗначениеЗаполнено(Основание) Тогда 
		Если СтатусЗакупки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.ВРаботе Тогда  
			ДокОбъект = Основание.ПолучитьОбъект(); 
			ДокОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.ВРаботе; 
			ДокОбъект.Записать();
		КонецЕсли; 
	КонецЕСли; 
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	Если ЗначениеЗаполнено(Основание) Тогда 
		ДокОбъект = Основание.ПолучитьОбъект(); 
		ДокОбъект.СтатусЗаявки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.Ожидание; 
		ДокОбъект.Записать();
	КонецЕсли; 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
     Возврат;
	КонецЕсли;
	
	ФлагСтатусаДокумента = Истина;
	Для Каждого Строка Из ЗакупленныйТовар Цикл 
		Если Строка.СтатусПоступления = Перечисления.СтатусЗакупкиТовара.ОжидаемПоступление ИЛИ Строка.СтатусПоступления = Перечисления.СтатусЗакупкиТовара.ПустаяСсылка() ТОгда 
			ФлагСтатусаДокумента = Ложь;
		КонецЕсли; 
	КонецЦикла; 
	
	Если ФлагСтатусаДокумента = Истина Тогда 
		СтатусЗакупки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.Отработанно; 
		Если ЗначениеЗаполнено(Основание) тогда 
			СменитьСтатусЗаявки(Основание); 
		КонецЕсли; 
	КонецЕсли; 
	
КонецПроцедуры

Функция СменитьСтатусЗаявки(Основание)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаявкаЗакупкаТовара.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаявкаЗакупкаТовара КАК ЗаявкаЗакупкаТовара
		|ГДЕ
		|	ЗаявкаЗакупкаТовара.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Основание);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	СсылкаЗаявка =  ВыборкаДетальныеЗаписи.Ссылка; 
	
	ОбъектЗаявка = СсылкаЗаявка.ПолучитьОбъект();
	ОбъектЗаявка.СтатусЗаявки = Перечисления.СтатусыЗаявкаЗакупкаТоваров.Отработанно;
	ОбъектЗаявка.Записать(); 
	
КонецФункции
	
















