&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Комлев АА 11/11/24 +++
	ДатаНачала30 = Дата(ТекущаяДата()) - (24 * 60 * 60) * 30;
	ДатаОкончания30 = Дата(ТекущаяДата());
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаНачала30", ДатаНачала30);
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаОкончания30", ДатаОкончания30);

	ДатаНачала90 = Дата(ТекущаяДата()) - (24 * 60 * 60) * 90;
	ДатаОкончания90 = Дата(ТекущаяДата());
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаНачала90", ДатаНачала90);
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаОкончания90", ДатаОкончания90);
	
	ДатаНачала180 = Дата(ТекущаяДата()) - (24 * 60 * 60) * 180;
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаНачала180", ДатаНачала180);

//	ДатаНачалаГод = Дата(ТекущаяДата()) - (24 * 60 * 60) * 365;
//	ДатаОкончанияГод = Дата(ТекущаяДата());
//	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаНачалаГод", ДатаНачалаГод);
//	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияГод", ДатаОкончанияГод);
//	
	РассчитатьИтогиСписокНоменклатурыПоКатегориям();
	// Комлев АА 11/11/24 ---
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиСписокНоменклатурыПоКатегориям() 
	// Комлев АА 11/11/24 +++
	СКД = Элементы.СписокНоменклатурыПоКатегориям.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы.СписокНоменклатурыПоКатегориям.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикКД.Выполнить(СКД, НастройкиКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД);
	ПроцессорВыводаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	РезультатКД_ТЗ = ПроцессорВыводаКД.Вывести(ПроцессорКД);
	
	НовыйТовар = РезультатКД_ТЗ.Итог("НовыйТовар");
	Элементы.СписокНоменклатурыПоКатегориямНовыйТовар.ТекстПодвала = НовыйТовар;
	Элементы.СписокНоменклатурыПоКатегориямНовыйТовар.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	ОдинРазСпросили = РезультатКД_ТЗ.Итог("ОдинРазСпросили");
	Элементы.СписокНоменклатурыПоКатегориямОдинРазСпросили.ТекстПодвала = ОдинРазСпросили;
	Элементы.СписокНоменклатурыПоКатегориямОдинРазСпросили.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	ВысокоЛиквидный = РезультатКД_ТЗ.Итог("ВысокоЛиквидный");
	Элементы.СписокНоменклатурыПоКатегориямВысокоЛиквидный.ТекстПодвала = ВысокоЛиквидный;
	Элементы.СписокНоменклатурыПоКатегориямВысокоЛиквидный.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	Ликвид = РезультатКД_ТЗ.Итог("Ликвид");
	Элементы.СписокНоменклатурыПоКатегориямЛиквид.ТекстПодвала = Ликвид;
	Элементы.СписокНоменклатурыПоКатегориямЛиквид.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	НизкийСпрос = РезультатКД_ТЗ.Итог("НизкийСпрос"); 
	Элементы.СписокНоменклатурыПоКатегориямНизкийСпрос.ТекстПодвала = НизкийСпрос;
	Элементы.СписокНоменклатурыПоКатегориямНизкийСпрос.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	Неликвид = РезультатКД_ТЗ.Итог("Неликвид");
	Элементы.СписокНоменклатурыПоКатегориямНеликвид.ТекстПодвала = Неликвид;
	Элементы.СписокНоменклатурыПоКатегориямНеликвид.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	Мусор = РезультатКД_ТЗ.Итог("Мусор");
	Элементы.СписокНоменклатурыПоКатегориямМусор.ТекстПодвала = Мусор;
	Элементы.СписокНоменклатурыПоКатегориямМусор.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;	
	
	ИтогоТоваров = Мусор + Неликвид + НизкийСпрос + Ликвид + ВысокоЛиквидный + ОдинРазСпросили + НовыйТовар ;
	Элементы.СписокНоменклатурыПоКатегориямСтандартнаяКартинка.ТекстПодвала = "Всего: " + ИтогоТоваров;
	Элементы.СписокНоменклатурыПоКатегориямСтандартнаяКартинка.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		
// Комлев АА 11/11/24 ---
КонецПроцедуры