&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Комлев АА 11/11/24 +++
	ДатаНачала30 = Дата(ТекущаяДата()) - (24 * 60 * 60) * 30;
	ДатаОкончания30 = Дата(ТекущаяДата());
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаНачала30", ДатаНачала30);
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаОкончания30", ДатаОкончания30);

	ДатаНачала90 = Дата(ТекущаяДата()) - (24 * 60 * 60) * 90;
	ДатаОкончания90 = Дата(ТекущаяДата());
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаНачала90", ДатаНачала90);
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаОкончания90", ДатаОкончания90);

	ДатаНачалаГод = Дата(ТекущаяДата()) - (24 * 60 * 60) * 365;
	ДатаОкончанияГод = Дата(ТекущаяДата());
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаНачалаГод", ДатаНачалаГод);
	СписокНоменклатурыПоКатегориям.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияГод", ДатаОкончанияГод);
	
	РассчитатьИтогиСписокНоменклатурыПоКатегориям();
	// Комлев АА 11/11/24 ---
КонецПроцедуры

&НаСервере
Процедура РассчитатьИтогиСписокНоменклатурыПоКатегориям() 
	// Комлев АА 11/11/24 +++
	СКД = Элементы.СписокНоменклатурыПоКатегориям.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы.СписокНоменклатурыПоКатегориям.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикКД.Выполнить(СКД, НастройкиКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД);
	ПроцессорВыводаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	РезультатКД_ТЗ = ПроцессорВыводаКД.Вывести(ПроцессорКД);
	Элементы.СписокНоменклатурыПоКатегориямВысокоЛиквидный.ТекстПодвала =  РезультатКД_ТЗ.Итог("ВысокоЛиквидный");
	Элементы.СписокНоменклатурыПоКатегориямВысокоЛиквидный.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;

	Элементы.СписокНоменклатурыПоКатегориямЛиквид.ТекстПодвала =   РезультатКД_ТЗ.Итог("Ликвид");
	Элементы.СписокНоменклатурыПоКатегориямЛиквид.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;

	Элементы.СписокНоменклатурыПоКатегориямНеликвид.ТекстПодвала = РезультатКД_ТЗ.Итог("Неликвид");
	Элементы.СписокНоменклатурыПоКатегориямНеликвид.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;

	Элементы.СписокНоменклатурыПоКатегориямМусор.ТекстПодвала = РезультатКД_ТЗ.Итог("Мусор");
	Элементы.СписокНоменклатурыПоКатегориямМусор.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;		
// Комлев АА 11/11/24 ---
КонецПроцедуры