

&НаКлиенте
Процедура СкопироватьИзБЗ(Команда)
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборБЗ",ЭтаФорма);
	//ОткрытьФорму("");
	ОткрытьФорму("Документ.ЧекЛист.ФормаВыбора",,,,,,
	ОписаниеВыбора,
	РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	//Элементы.СписокЧек.Обновить();
КонецПроцедуры


&НаКлиенте
Процедура ОбработатьВыборБЗ(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	//Таблица = ПолучитьЧеклисты(,);
	ЗаписьРегистраЧек(РезультатЗакрытия);
	//Элементы.СписокЧек.Обновить();
КонецПроцедуры

Процедура ЗаписьРегистраЧек(Результат)
	Таблица = ПолучитьЧеклисты(,Результат);
	
	Выборка = таблица.Выбрать();
	Если Выборка.Количество() > 0 Тогда
		Пока Выборка.Следующий() Цикл
			Запись = объект.ТаблицаСодержание.Добавить();
			Запись.Название 	 = Выборка.Описание;
			//ПаузаИсполнения(1);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция  ПолучитьЧеклисты(Сорт = "",Чек)
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЧекЛистЧекЛист.НомерСтроки КАК НомерСтроки,
	               |	ЧекЛистЧекЛист.Описание КАК Описание
	               |ИЗ
	               |	Документ.ЧекЛист.ЧекЛист КАК ЧекЛистЧекЛист
	               |ГДЕ
	               |	ЧекЛистЧекЛист.Ссылка = &Ссылка";
	
	Если Сорт = "Убыв" тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "упорядочить по"+ Символы.ПС +"Порядок убыв";
	ИначеЕсли Сорт = "Возр" тогда
		Запрос.Текст = Запрос.Текст + Символы.ПС + "упорядочить по"+ Символы.ПС +"Порядок ";
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Ссылка", Чек);
	Таблица = Запрос.Выполнить();
	Возврат Таблица;		   
	
КонецФункции