
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр РегистрНакопления1 Расход
	Движения.РегистрНакопления1.Записывать = Истина;
	Для Каждого ТекСтрокаТаблица Из Таблица Цикл
		Движение = Движения.РегистрНакопления1.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТаблица.Товар;
		Движение.машина = ТекСтрокаТаблица.машина;
		Движение.Цена = ТекСтрокаТаблица.цена1;
		Движение.Колво = ТекСтрокаТаблица.Количество;
	КонецЦикла;

	// регистр Резерв Приход
	Движения.Резерв.Записывать = Истина;
	Для Каждого ТекСтрокаТаблица Из Таблица Цикл
		Движение = Движения.Резерв.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТаблица.Товар;
		Движение.машина = ТекСтрокаТаблица.машина;
		Движение.Цена = ТекСтрокаТаблица.цена1;
		Движение.Колво = ТекСтрокаТаблица.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
