
&НаКлиенте
Процедура Список1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	  Message("hello");
	  ОповеститьОВыборе(ВыбраннаяСтрока) ;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если НовыеЗП = Истина Тогда
		//ЭтаФорма.Элементы.Группа2.Видимость = Ложь;
		ЭтаФорма.Элементы.ГруппаСтраницы.ТекущаяСтраница = ЭтаФорма.Элементы.Группа3;
	Иначе
		//ЭтаФорма.Элементы.Группа3.Видимость = Ложь;
    КонецЕсли
КонецПроцедуры

&НаКлиенте
Процедура Создать1(Команда)
	// Вставить содержимое обработчика.
	ФормаСписка = ПолучитьФорму("Документ.ПоступлениеЗапчастей.ФормаОбъекта");
	ФормаСписка.ВладелецФормы = ЭтаФорма;
	Если ЭтаФорма.Элементы.ГруппаСтраницы.ТекущаяСтраница = ЭтаФорма.Элементы.Группа3 Тогда
		ФормаСписка.Объект.Новые=Истина;
	КонецЕсли;
	Если Не ФормаСписка.Открыта() Тогда
    	ФормаСписка.ОткрытьМодально();
	КонецЕсли;  

КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ГруппаРазборка.Видимость = ПолучитьФункциональнуюОпцию("дт_ИспользоватьРазборку");
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)

	Элементы = Форма.Элементы;
	Список = Форма.Список;
	
	
	Если НЕ Элементы.ГруппаРазборка.Видимость Тогда
		Элементы.ГруппаСтраницы.ОтображениеСтраниц = ОтображениеСтраницФормы.Нет;
	КонецЕсли;
	

КонецПроцедуры // УправлениеФормой()
