
#Область ОбработчикиСобытийФормы

Процедура ОбработкаПроведения(Отказ, Режим)
	
	///+ГомзМА 07.04.2023
	// регистр ДвижениеТМЦВорктрак Приход
	Движения.ДвижениеТМЦВорктрак.Записывать = Истина;
	
	Для каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
			Запрос = Новый Запрос;
			Запрос.Текст = 
			"ВЫБРАТЬ
			|	ИнвентарныеНомера.Владелец КАК ТМЦ,
			|	ИнвентарныеНомера.Наименование КАК Наименование,
			|	ИнвентарныеНомера.СерийныйНомер КАК СерийныйНомер,
			|	ИнвентарныеНомера.ДатаПоступления КАК ДатаПоступления,
			|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления,
			|	ИнвентарныеНомера.Ссылка КАК Ссылка,
			|	ИнвентарныеНомера.Стоимость КАК Цена
			|ИЗ
			|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
			|ГДЕ
			|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления
			|	И ИнвентарныеНомера.Владелец = &Владелец";
			
			Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
			Запрос.УстановитьПараметр("Владелец", 			 ТекСтрокаСписокТМЦ.ТМЦ);
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			
			Если ТекСтрокаСписокТМЦ.ТипУчета = Перечисления.ТипУчетаТМЦ.УчестьПоштучно Тогда
				Пока РезультатЗапроса.Следующий() Цикл
					Движение 							= Движения.ДвижениеТМЦВорктрак.Добавить();
					Движение.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					Движение.Период 					= Дата;
					Движение.ТМЦ 						= РезультатЗапроса.ТМЦ;
					Движение.МестоХранения 				= ТекСтрокаСписокТМЦ.Склад;
					Движение.ИнвентарныйНомер 			= РезультатЗапроса.Ссылка;
					Движение.Количество 				= 1;
					Движение.Цена 						= РезультатЗапроса.Цена;
				КонецЦикла;
			Иначе
				Пока РезультатЗапроса.Следующий() Цикл
					Движение 							= Движения.ДвижениеТМЦВорктрак.Добавить();
					Движение.ВидДвижения 				= ВидДвиженияНакопления.Приход;
					Движение.Период 					= Дата;
					Движение.ТМЦ 						= РезультатЗапроса.ТМЦ;
					Движение.МестоХранения 				= ТекСтрокаСписокТМЦ.Склад;
					Движение.ИнвентарныйНомер 			= РезультатЗапроса.Ссылка;
					Движение.Количество 				= ТекСтрокаСписокТМЦ.Количество;
					Движение.Цена 						= РезультатЗапроса.Цена;
				КонецЦикла;
			КонецЕсли;
			КонецЦикла;
	
	///-ГомзМА 07.04.2023
			
	/// +++ Запись в регистр БюджетТМЦ 
		Сек = 0; 
	ЕСли ЗначениеЗаполнено(Расход) И ЗначениеЗаполнено(Статья) И СписокТМЦ.Количество() <> 0 Тогда 
	

	
//	+++Движение РЕГИСТР накопления БЮДЖЕТТМЦ
	Движения.БюджетТМЦ.Записывать = Истина;
	
	Для каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
			Запрос1 = Новый Запрос;
			Запрос1.Текст = 
			"ВЫБРАТЬ
			|	ИнвентарныеНомера.Владелец КАК ТМЦ,
			|	ИнвентарныеНомера.Наименование КАК Наименование,
			|	ИнвентарныеНомера.СерийныйНомер КАК СерийныйНомер,
			|	ИнвентарныеНомера.ДатаПоступления КАК ДатаПоступления,
			|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления,
			|	ИнвентарныеНомера.Ссылка КАК Ссылка,
			|	ИнвентарныеНомера.Стоимость КАК Цена
			|ИЗ
			|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
			|ГДЕ
			|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления
			|	И ИнвентарныеНомера.Владелец = &Владелец";
			
			Запрос1.УстановитьПараметр("ДокументПоступления", Ссылка);
			Запрос1.УстановитьПараметр("Владелец", 			 ТекСтрокаСписокТМЦ.ТМЦ);
			
			РезультатЗапроса = Запрос1.Выполнить().Выбрать();
			
			Если ТекСтрокаСписокТМЦ.ТипУчета = Перечисления.ТипУчетаТМЦ.УчестьПоштучно Тогда
				Пока РезультатЗапроса.Следующий() Цикл
					
					Движение 					= Движения.БюджетТМЦ.Добавить();
					//Измерения
					Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
					Движение.Период				= ТекущаяДата(); 
					Движение.Регистратор		= Ссылка; 
					
					Движение.Статья				= Статья;
					Движение.Категрия			= Категория;
					Движение.ВидыРасхода_3		= ВидыРасхода_3;
					Движение.Отдел				= Отдел;
					Движение.Филиал 			= Филиал;
					//Ресурсы
					Движение.ИнвентарныйНомер	= РезультатЗапроса.Ссылка;
					Движение.Коментарий			= Комментарий;
					Движение.Расход				= Расход;
					Движение.Сумма				= ТекСтрокаСписокТМЦ.Цена; 	 
					Движение.ТМЦ				= РезультатЗапроса.ТМЦ;
					Движение.Количество			= 1;
					Движение.Цена				= ТекСтрокаСписокТМЦ.Цена;
					Движение.ДатаРасхода		= Расход.ДатаРасхода; 
					Движение.ДокРег				= Ссылка;  
				КонецЦикла;
			Иначе
				Пока РезультатЗапроса.Следующий() Цикл
					
					Движение 					= Движения.БюджетТМЦ.Добавить();
					//Измерения
					Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
					Движение.Период				= ТекущаяДата(); 
					Движение.Регистратор		= Ссылка; 
					
					
					Движение.Статья				= Статья;
					Движение.Категрия			= Категория;
					Движение.ВидыРасхода_3		= ВидыРасхода_3;
					Движение.Отдел				= Отдел;
					Движение.Филиал 			= Филиал;
					//Ресурсы
					Движение.ИнвентарныйНомер	= РезультатЗапроса.Ссылка;
					Движение.Коментарий			= Комментарий;
					Движение.Расход				= Расход;
					Движение.Сумма				= ТекСтрокаСписокТМЦ.Цена * ТекСтрокаСписокТМЦ.Количество; 				
					Движение.ТМЦ				= РезультатЗапроса.ТМЦ;
					Движение.Количество			= ТекСтрокаСписокТМЦ.Количество;
					Движение.Цена				= ТекСтрокаСписокТМЦ.Цена;
					Движение.ДатаРасхода		= Расход.ДатаРасхода; 
					Движение.ДокРег				= Ссылка; 
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;


	КонецЕсли;
	
	// --- Движение РЕГИСТР накопления БЮДЖЕТТМЦ
			
КонецПроцедуры


Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	
	Склад 			= Справочники.МестаХраненияТМЦ.НайтиПоКоду("000000001");
	Организация 	= Справочники.Организация.НайтиПоКоду	  ("000000005");
	
		///+ГомзМА 27.04.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасход") Тогда
		Ответственный 	= ПользователиКлиентСервер.ТекущийПользователь();
		Поставщик 		= ДанныеЗаполнения.Получатель;
		ЗаявкаНаРасход 	= ДанныеЗаполнения.Ссылка;
		/// Комлев 19/06/24 +++
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.ТМЦ Цикл
			НоваяСтрока 				= СписокТМЦ.Добавить();
			НоваяСтрока.Количество 		= ТекСтрокаТовары.Количество;
			НоваяСтрока.Код = ТекСтрокаТовары.НоменклатураТМЦ.Код;
			НоваяСтрока.ТМЦ = ТекСтрокаТовары.НоменклатураТМЦ;
			
			НоваяСтрока.Сумма 			= ТекСтрокаТовары.Сумма;
			НоваяСтрока.ТМЦПоНакладной 	= ТекСтрокаТовары.НаименованиеПоНакладной;
			НоваяСтрока.Цена 			= ТекСтрокаТовары.Цена;
			НоваяСтрока.ТипУчета 		= Перечисления.ТипУчетаТМЦ.УчестьКомплектом;
			НоваяСтрока.Склад = Склад;
		КонецЦикла;
		/// Комлев 19/06/24 ---
	КонецЕсли;
	///-ГомзМА 27.04.2023
	
	
//++МазинЕС	 20-11-24
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасход") Тогда
		

		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	Расходы.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.Расходы КАК Расходы
			|ГДЕ
			|	Расходы.ЗаявкаНаРасход = &ЗаявкаНаРасход";
		
		Запрос.УстановитьПараметр("ЗаявкаНаРасход", ЗаявкаНаРасход);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		СсылкаРасход = ПолучитьПустуюСсылку(); 
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			СсылкаРасход = ВыборкаДетальныеЗаписи.Ссылка; 
		КонецЦикла;
		РаспоряжениенаРасход				=ДанныеЗаполнения.Ссылка;  
		Расход 								= СсылкаРасход; 
		Филиал 						= Справочники.ВидыРасходов_3.НайтиПоКоду("000000117"); 
		Отдел 					= Справочники.ВидыРасходов_3.НайтиПоКоду("000000449"); 
		ВидыРасхода_3		= Справочники.ВидыРасходов_3.НайтиПоКоду("000000555"); 
		Категория		= Справочники.ВидыРасходов_3.НайтиПоКоду("000000453"); 
		Статья		= Справочники.ВидыРасходов_3.НайтиПоКоду("000000837"); 
	
	КонецЕсли; 
//--МазинЕС	 20-11-24
КонецПроцедуры

Функция ПолучитьПустуюСсылку()

	СсылкаРасход = Справочники.ВидыРасходов_3.ПустаяСсылка();
	Возврат СсылкаРасход;
	 	
КонецФункции

Процедура ПриЗаписи(Отказ)
	
	///+ГомзМА 14.04.2023
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат
	КонецЕсли;
	///-ГомзМА 14.04.2023
	
	///+ГомзМА 25.04.2023
	Если Проведен Тогда
		Для каждого СтрокаСписокТМЦ Из СписокТМЦ Цикл
			ЗаполнитьИнвентарныеНомераНаСервере(Отказ, СтрокаСписокТМЦ);
		КонецЦикла;
		///-ГомзМА 25.04.2023
	Иначе 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления";
		
		Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Если РезультатЗапроса.Количество() > 0 Тогда
			Пока РезультатЗапроса.Следующий() Цикл
				ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
				
				ТоварСписанИлиПеремещен = ТоварЕстьВСписанииИлиПеремещении(РезультатЗапроса.Ссылка);
				
				Если ТоварСписанИлиПеремещен = 0 Тогда
					УстановитьПривилегированныйРежим(Истина);
					ДокОбъект.Удалить();
				Иначе
					Отказ = Истина;
					Сообщить("Невозможно отменить проведение документа, так как товар используется в списании или перемещении!");
					Возврат;
				КонецЕсли;
				
				
			КонецЦикла;
			УстановитьПривилегированныйРежим(Ложь);
		КонецЕсли;
	КонецЕсли;
	
		
	
КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = СписокТМЦ.Итог("Сумма");

Если ОбменДанными.Загрузка Тогда
     Возврат;
КонецЕсли;
	
//	ЕСли РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда 
//
//		Для каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
//			Запрос = Новый Запрос;
//			Запрос.Текст = 
//			"ВЫБРАТЬ
//			|	ИнвентарныеНомера.Владелец КАК ТМЦ,
//			|	ИнвентарныеНомера.Наименование КАК Наименование,
//			|	ИнвентарныеНомера.СерийныйНомер КАК СерийныйНомер,
//			|	ИнвентарныеНомера.ДатаПоступления КАК ДатаПоступления,
//			|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления,
//			|	ИнвентарныеНомера.Ссылка КАК Ссылка,
//			|	ИнвентарныеНомера.Стоимость КАК Цена
//			|ИЗ
//			|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
//			|ГДЕ
//			|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления
//			|	И ИнвентарныеНомера.Владелец = &Владелец";
//			
//			Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
//			Запрос.УстановитьПараметр("Владелец", 	 ТекСтрокаСписокТМЦ.ТМЦ);
//			
//			РезультатЗапроса = Запрос.Выполнить().Выбрать();
//			
//				Пока РезультатЗапроса.Следующий() Цикл
//				
//			// +++ Очищаем регистр от записей сделаных конкретным документом поступления
//					НаборЗаписей = РегистрыСведений.БюджетТМЦ.СоздатьНаборЗаписей();
//					НаборЗаписей.Отбор.ИнвентарныйНомер.Установить(РезультатЗапроса.Ссылка); 
//					НаборЗаписей.Очистить();
//					НаборЗаписей.Записать(); 
//			// --- Очищаем регистр от записей сделаных конкретным документом поступления
//				
//				КонецЦикла;
//		КонецЦикла; 	
//	КонецЕСли; 
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьИнвентарныеНомераНаСервере(Отказ = Ложь, СтрокаСписокТМЦ)
	
	///+ГомзМА 14.04.2023
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("ДокументПоступления", Ссылка);
	ДанныеЗаполнения.Вставить("ДатаПоступления", 	 Дата);
	
	КоличествоИнвНомеровПоТМЦ = ПолучитьКоличествоИнвентарныхНомеровПоТМЦ(СтрокаСписокТМЦ);
	
	//Для каждого СтрокаТаблицы Из СписокТМЦ Цикл
	Если КоличествоИнвНомеровПоТМЦ.Количество() = 0 Тогда
		Если СтрокаСписокТМЦ.ТипУчета = Перечисления.ТипУчетаТМЦ.УчестьПоштучно Тогда
			Для Сч = 1 По СтрокаСписокТМЦ.Количество Цикл
				ДанныеЗаполнения.Вставить("ТМЦ",  			СтрокаСписокТМЦ.ТМЦ);
				ДанныеЗаполнения.Вставить("Цена", 			СтрокаСписокТМЦ.Цена);
				ДанныеЗаполнения.Вставить("ТМЦПоНакладной", СтрокаСписокТМЦ.ТМЦПоНакладной);
				НовыйКод = Справочники.ИнвентарныеНомера.СоздатьНовыйЭлемент(ДанныеЗаполнения, Отказ);
			КонецЦикла;
		Иначе
			ДанныеЗаполнения.Вставить("ТМЦ",  			СтрокаСписокТМЦ.ТМЦ);
			ДанныеЗаполнения.Вставить("Цена", 			СтрокаСписокТМЦ.Цена);
			ДанныеЗаполнения.Вставить("ТМЦПоНакладной", СтрокаСписокТМЦ.ТМЦПоНакладной);
			НовыйКод = Справочники.ИнвентарныеНомера.СоздатьНовыйЭлемент(ДанныеЗаполнения, Отказ);
		КонецЕсли;
	КонецЕсли;
		
		Для каждого СтрокаИнвНомеров Из КоличествоИнвНомеровПоТМЦ Цикл
			Если СтрокаСписокТМЦ.ТипУчета 	= Перечисления.ТипУчетаТМЦ.УчестьПоштучно И
				 СтрокаСписокТМЦ.ТМЦ 		= СтрокаИнвНомеров.Владелец И 
				 Ссылка 					= СтрокаИнвНомеров.ДокументПоступления И 
				 СтрокаСписокТМЦ.Количество > СтрокаИнвНомеров.Количество Тогда

					Для Сч = 1 По СтрокаСписокТМЦ.Количество - СтрокаИнвНомеров.Количество Цикл
						ДанныеЗаполнения.Вставить("ТМЦ",  			СтрокаСписокТМЦ.ТМЦ);
						ДанныеЗаполнения.Вставить("Цена", 			СтрокаСписокТМЦ.Цена);
						ДанныеЗаполнения.Вставить("ТМЦПоНакладной", СтрокаСписокТМЦ.ТМЦПоНакладной);
						НовыйКод = Справочники.ИнвентарныеНомера.СоздатьНовыйЭлемент(ДанныеЗаполнения, Отказ); 
					КонецЦикла;
					
				ИначеЕсли СтрокаСписокТМЦ.ТипУчета 	= Перечисления.ТипУчетаТМЦ.УчестьПоштучно И
						  СтрокаСписокТМЦ.ТМЦ 		= СтрокаИнвНомеров.Владелец И
						  Ссылка 					= СтрокаИнвНомеров.ДокументПоступления И
						  СтрокаСписокТМЦ.Количество < СтрокаИнвНомеров.Количество Тогда
					
							ДанныеЗаполнения.Вставить("ТМЦ", СтрокаСписокТМЦ.ТМЦ);
							УдалитьЛишниеИнвентарныеНомера(ДанныеЗаполнения, Отказ, СтрокаИнвНомеров.Количество - СтрокаСписокТМЦ.Количество);
				КонецЕсли;
			КонецЦикла;
			
			//КонецЦикла;
			///-ГомзМА 14.04.2023	

КонецПроцедуры


&НаСервере
Процедура УдалитьЛишниеИнвентарныеНомера(ДанныеЗаполнения, Отказ, Количество)
	
	///+ГомзМА 20.04.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Код КАК Код,
		|	ИнвентарныеНомера.Ссылка КАК Ссылка,
		|	ИнвентарныеНомера.Владелец КАК Владелец,
		|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления
		|	И ИнвентарныеНомера.Владелец = &Владелец
		|
		|УПОРЯДОЧИТЬ ПО
		|	Код УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
	Запрос.УстановитьПараметр("Владелец", ДанныеЗаполнения.ТМЦ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для Сч = 0 По Количество - 1 Цикл
		//Удаление наименования по накладной из регистра сведений
		Запись 					= РегистрыСведений.НаименованиеТМЦПоНакладной.СоздатьМенеджерЗаписи();
		Запись.ТМЦ 				= РезультатЗапроса[Сч].Владелец;
		Запись.ИнвентарныйНомер = РезультатЗапроса[Сч].Ссылка;
		Запись.Удалить();
		
		//Удаление инвентарного номера
		СправочникОбъект = РезультатЗапроса[Сч].Ссылка.ПолучитьОбъект();
		СправочникОбъект.Удалить();

	КонецЦикла;
	///-ГомзМА 20.04.2023

КонецПроцедуры


&НаСервере
Функция ПолучитьКоличествоИнвентарныхНомеровПоТМЦ(СтрокаСписокТМЦ)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Владелец КАК Владелец,
		|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления,
		|	СУММА(1) КАК Количество
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления
		|	И ИнвентарныеНомера.Владелец = &Владелец
		|
		|СГРУППИРОВАТЬ ПО
		|	ИнвентарныеНомера.Владелец,
		|	ИнвентарныеНомера.ДокументПоступления";
	
	Запрос.УстановитьПараметр("ДокументПоступления", Ссылка);
	Запрос.УстановитьПараметр("Владелец", 			 СтрокаСписокТМЦ.ТМЦ);
	
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();

	Возврат РезультатЗапроса;
	
КонецФункции 

Функция ТоварЕстьВСписанииИлиПеремещении(ИнвентарныйНомер)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПеремещениеТМЦВорктракСписокТМЦ.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПеремещениеТМЦВорктрак.СписокТМЦ КАК ПеремещениеТМЦВорктракСписокТМЦ
		|ГДЕ
		|	ПеремещениеТМЦВорктракСписокТМЦ.ИнвентарныйНомер = &ИнвентарныйНомер
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СписаниеТМЦВорктракСписокТМЦ.Ссылка
		|ИЗ
		|	Документ.СписаниеТМЦВорктрак.СписокТМЦ КАК СписаниеТМЦВорктракСписокТМЦ
		|ГДЕ
		|	СписаниеТМЦВорктракСписокТМЦ.ИнвентарныйНомер = &ИнвентарныйНомер";
	
	Запрос.УстановитьПараметр("ИнвентарныйНомер", ИнвентарныйНомер);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.Количество();


КонецФункции // ()

#КонецОбласти



















