Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Площадь) и ЗначениеЗаполнено(СтавкаЗаМетр) Тогда 
		
		МенеджерЗаписи = РегистрыСведений.АрендаСтавка.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.Объект 			= Ссылка;
		МенеджерЗаписи.СтавкаМетр 		= СтавкаЗаМетр; 
		МенеджерЗаписи.ОбщаяПлощадь 	= Площадь;
		МенеджерЗаписи.Период = ТекущаяДатаСеанса(); 
		
		МенеджерЗаписи.Записать();
	
	КонецЕсли; 

	Для Каждого Строка ИЗ Отделы Цикл
		Если ЗначениеЗаполнено(Строка.Отдел) и ЗначениеЗаполнено(Строка.ЗанимаемаяПлощадь) Тогда 
			
			МенеджерЗаписи = РегистрыСведений.АрендаПлощадьОтдела.СоздатьМенеджерЗаписи();
		
			МенеджерЗаписи.Отдел 				= Строка.Отдел;
			МенеджерЗаписи.ИспользуемаяПлощадь 	= Строка.ЗанимаемаяПлощадь;
			МенеджерЗаписи.ОбъектАренды 		= Ссылка; 
			
			МенеджерЗаписи.Период = ТекущаяДатаСеанса() + 1; 
			МенеджерЗаписи.Записать();
		
		КонецЕсли; 
	КонецЦикла; 
	
КонецПроцедуры
