
&НаКлиенте
Процедура СуммаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПодсчетОстатка()	
КонецПроцедуры

&НаКлиенте
Процедура ПодсчетОстатка()
	Объект.Остаток = Объект.Сумма;
	Объект.Остаток = Объект.Остаток - ПодсчетПоТаблице();	
КонецПроцедуры

&НаСервере
Функция ПодсчетПоТаблице()
	СуммаПоТаблице = 0;
	Для Каждого Строка Из Объект.Таблица Цикл
		СуммаПоТаблице = СуммаПоТаблице + Строка.Сумма;
	КонецЦикла;
	Возврат СуммаПоТаблице; 
КонецФункции


&НаКлиенте
Процедура ТаблицаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ПодсчетОстатка();
КонецПроцедуры


&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	ПодсчетОстатка();
КонецПроцедуры

