
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	СписокСотрудникиПоДолжности.Параметры.УстановитьЗначениеПараметра("Ссылка", объект.ссылка);
	СписокСотрудникиПоДолжности.Параметры.УстановитьЗначениеПараметра("Типдоговора", Справочники.ТипыКадровыхДоговоров.НайтиПоКоду("000000004"));
	
	СписокЗадачиДолжности.Параметры.УстановитьЗначениеПараметра("Обязанность", объект.ссылка);

КонецПроцедуры

&НаКлиенте
Процедура СписокСотрудникиПоДолжностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	СсылкаДляОткрытия    = Элементы.СписокСотрудникиПоДолжности.ТекущиеДанные[СтрЗаменить(Поле.Имя,Элемент.имя,"")];
	ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
	Если ТипЗнч(СсылкаДляОткрытия)=тип("справочникСсылка.Сотрудники") Тогда
		ИмяФормыДокумента="справочник.Сотрудники.Форма.ФормаЭлемента";
	ИначеЕсли ТипЗнч(СсылкаДляОткрытия)=тип("справочникСсылка.ДолжностиПредприятия") Тогда
		ИмяФормыДокумента="справочник.ДолжностиПредприятия.Форма.ФормаЭлемента";
		Иначе
		Возврат;
	КонецЕсли;
	ФормаДокумента = ПолучитьФорму(ИмяФормыДокумента, ПараметрыФормы);
	ФормаДокумента.Открыть();
КонецПроцедуры

&НаКлиенте
Процедура СписокЗадачиДолжностиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СтандартнаяОбработка = Ложь;
	СсылкаДляОткрытия    = Элементы.СписокЗадачиДолжности.ТекущиеДанные[СтрЗаменить(Поле.Имя,Элемент.имя,"")];
	ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
	Если ТипЗнч(СсылкаДляОткрытия)=тип("ДокументСсылка.ЧекЛист") Тогда
		ИмяФормыДокумента="Документ.чекЛист.Форма.ФормаДокумента";
		Иначе
		Возврат;
	КонецЕсли;
	ФормаДокумента = ПолучитьФорму(ИмяФормыДокумента, ПараметрыФормы);
	ФормаДокумента.Открыть();

КонецПроцедуры
