#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Печать

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РаспискаОСогласии_WORD";
	КомандаПечати.Представление = НСтр("ru = 'Расписка о согласии'");
	КомандаПечати.Порядок = 1;
КонецПроцедуры


Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	// Расписка О Согласии
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "РаспискаОСогласии_WORD");
	Если ПечатнаяФорма <> Неопределено Тогда
		МакетИДанныеОбъекта = УправлениеПечатьюВызовСервера.МакетыИДанныеОбъектовДляПечати("Справочник.Сотрудники", 
																																"ПФ_DOC_РаспискаОСогласии", МассивОбъектов);
		ОфисныеДокументы = Новый Соответствие;	
		Для Каждого Ссылка Из МассивОбъектов Цикл
			
		КонецЦикла;																													
	КонецЕсли;
КонецПроцедуры


Функция ПолучитьДанныеПечати( Знач МассивДокументов, Знач МассивИменМакетов) Экспорт
	ДанныеПоВсемОбъектам = Новый Соответствие;
	
	Для Каждого ОбъектСсылка Из МассивДокументов Цикл
		ДанныеОбъектаПоМакетам = Новый Соответствие;
		Для Каждого ИмяМакета Из МассивИменМакетов Цикл
			ДанныеОбъектаПоМакетам.Вставить(ИмяМакета, ПолучитьДанныеОбъекта(ОбъектСсылка));
		КонецЦикла;
		ДанныеПоВсемОбъектам.Вставить(ОбъектСсылка, ДанныеОбъектаПоМакетам);
	КонецЦикла;
	
	ОписаниеОбластей = Новый Соответствие;
	ДвоичныеДанныеМакетов = Новый Соответствие;
	
	
	Для Каждого ИмяМакета Из МассивИменМакетов Цикл
		ДвоичныеДанныеМакетов.Вставить(ИмяМакета, ПолучитьМакет(ИмяМакета));
		ОписаниеОбластей.Вставить(ИмяМакета, ПолучитьОписаниеОбластейМакетаОфисногоДокумента());
	КонецЦикла;
		
	Макеты = Новый Структура;
	Макеты.Вставить("ОписаниеОбластей", ОписаниеОбластей);
	Макеты.Вставить("ДвоичныеДанныеМакетов", ДвоичныеДанныеМакетов);
	
	Результат = Новый Структура;
	Результат.Вставить("Данные", ДанныеПоВсемОбъектам);
	Результат.Вставить("Макеты", Макеты);
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьДанныеОбъекта(ОбъектСсылка)
	Результат = ПолучитьРеквизиты(ОбъектСсылка);
	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("ОрганизацияПолноеНаименование", Результат.ОрганизацияПолноеНаименование);
	ДанныеОбъекта.Вставить("ПаспортСерияНомер", Результат.ПаспортСерияНомер);
	ДанныеОбъекта.Вставить("Должность", Результат.Должность);
	ДанныеОбъекта.Вставить("ПаспортКемВыдан", Результат.ПаспортКемВыдан);
	Возврат ДанныеОбъекта;
КонецФункции

Функция ПолучитьОписаниеОбластейМакетаОфисногоДокумента() 
	ОписаниеОбластей = Новый Структура;
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "ВерхнийКолонтитул", "ВерхнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "НижнийКолонтитул", "НижнийКолонтитул");
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Расписка", "Общая");
КонецФункции




#КонецОбласти

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьРеквизиты(Ссылка) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник,
	|	ДолжностиСотрудниковСрезПоследних.Организация КАК ОрганизацияПолноеНаименование,
	|	ДолжностиСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	|	ДолжностиСотрудниковСрезПоследних.Должность КАК Должность,
	|	ДолжностиСотрудниковСрезПоследних.ТипДоговора КАК ТипДоговора,
	|	ДолжностиСотрудниковСрезПоследних.Период КАК Период
	|ПОМЕСТИТЬ втДолжности
	|ИЗ
	|	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Ссылка,
	|	Сотрудники.Наименование,
	|	Сотрудники.Фамилия,
	|	Сотрудники.Имя,
	|	Сотрудники.Отчество,
	|	Сотрудники.ДатаРождения,
	|	Сотрудники.ПаспортСерияНомер,
	|	Сотрудники.ПаспортКемВыдан,
	|	Сотрудники.ПаспортДатаВыдачи,
	|	Сотрудники.ПаспортКодПодразделения,
	|	втДолжности.ОрганизацияПолноеНаименование,
	|	втДолжности.Подразделение,
	|	втДолжности.Должность,
	|	втДолжности.ТипДоговора
	|ПОМЕСТИТЬ втСотрудники
	|ИЗ
	|	Справочник.Сотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ втДолжности КАК втДолжности
	|		ПО втДолжности.Сотрудник = Сотрудники.Ссылка
	|ГДЕ
	|	Сотрудники.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Сотрудники.Фамилия,
	|	Сотрудники.Имя,
	|	Сотрудники.Отчество,
	|	Сотрудники.Наименование,
	|	Сотрудники.ПаспортСерияНомер,
	|	Сотрудники.ПаспортКемВыдан,
	|	Сотрудники.ПаспортДатаВыдачи,
	|	Сотрудники.ПаспортКодПодразделения,
	|	КИФактическийАдрес.Представление КАК ФактическийАдрес,
	|	КИТелефон.Представление КАК Телефоны,
	|	КИEmail.Представление КАК Email,
	|	Сотрудники.ОрганизацияПолноеНаименование,
	|	Сотрудники.Подразделение,
	|	Сотрудники.Должность,
	|	Сотрудники.ТипДоговора
	|ИЗ
	|	втСотрудники КАК Сотрудники
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК КИФактическийАдрес
	|		ПО КИФактическийАдрес.Ссылка = Сотрудники.Ссылка
	|		И КИФактическийАдрес.Вид = &ВидКИ1
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК КИТелефон
	|		ПО КИТелефон.Ссылка = Сотрудники.Ссылка
	|		И КИТелефон.Вид = &ВидКИ2
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники.КонтактнаяИнформация КАК КИEmail
	|		ПО КИEmail.Ссылка = Сотрудники.Ссылка
	|		И КИEmail.Вид = &ВидКИ3";

	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидКИ1", Справочники.ВидыКонтактнойИнформации.АдресСотрудникаФактический);
	Запрос.УстановитьПараметр("ВидКИ2", Справочники.ВидыКонтактнойИнформации.ТелефонСотрудникаЛичный);
	Запрос.УстановитьПараметр("ВидКИ3", Справочники.ВидыКонтактнойИнформации.EmailСотрудника);

	РезультатЗапроса = Запрос.Выполнить();

	Если РезультатЗапроса.Пустой() Тогда
		Возврат Новый Структура;
	КонецЕсли;
	Результат = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса.Выгрузить()[0]);

	ФИО = Новый Массив;
	РеквизитыФИО = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок("Фамилия,Имя,Отчество");
	Для Каждого Реквизит Из РеквизитыФИО Цикл
		Если ЗначениеЗаполнено(Результат[Реквизит]) Тогда
			ФИО.Добавить(Результат[Реквизит]);
		КонецЕсли;
	КонецЦикла;

	ФИО = СтрСоединить(ФИО, " ");

	Результат.Вставить("НаименованиеДляПечатныхФорм", ФИО);
	Результат.Вставить("НаименованиеПолное", ФИО);
	Результат.Вставить("ФамилияИнициалы", ФизическиеЛицаКлиентСервер.ФамилияИнициалы(ФИО));

	Результат.Вставить("Паспорт", СтрШаблон("Паспорт %1 выдан %2 г. %3", Результат.ПаспортСерияНомер, Формат(
		Результат.ПаспортДатаВыдачи, "ДЛФ=D;"), Результат.ПаспортКемВыдан));
	Возврат Результат;

КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли
