
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
  ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
  ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Расход");
  ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.НеЗаполнено;
  ЭлементОтбора.ПравоеЗначение = Истина;
  ЭлементОтбора.Использование = Истина;
  ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.СветлоКоралловый);

КонецПроцедуры
