
&НаСервере
Процедура НомерПроизводителяПриИзмененииНаСервере(НомерПроизводителя)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиентаТовары.Ссылка) КАК КоличествоСпросили,
	|	ЗаказКлиентаТовары.Номенклатура КАК Номенклатура
	|ПОМЕСТИТЬ ВТ_Спрос
	|ИЗ
	|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
	|ГДЕ
	|	ЗаказКлиентаТовары.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|	И ЗаказКлиентаТовары.Номенклатура.НомерПроизводителя = &НомерПроизводителя
	|
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиентаТовары.Номенклатура
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	СпрНоменклатура.Ссылка КАК Деталь,
	|	СпрНоменклатура.ДатаСоздания КАК ДатаСоздания,
	|	ЕСТЬNULL(РегистрНакопления1Остатки.КолвоОстаток, 0) КАК КолвоОстаток,
	|	(ЕСТЬNULL(Продажи.Количество, 0) + ЕСТЬNULL(ВТ_Спрос.КоличествоСпросили, 0)) * 2 КАК НеобходимыйОстаток
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО (РегистрНакопления1Остатки.Товар = СпрНоменклатура.Ссылка)
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи КАК Продажи
	|		ПО (Продажи.Номенклатура = СпрНоменклатура.Ссылка)
	|			И (ВЫРАЗИТЬ(Продажи.Регистратор КАК Документ.ПродажаЗапчастей).Дата МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Спрос КАК ВТ_Спрос
	|		ПО (ВТ_Спрос.Номенклатура = СпрНоменклатура.Ссылка)
	|ГДЕ
	|	СпрНоменклатура.НомерПроизводителя = &НомерПроизводителя
	|
	|УПОРЯДОЧИТЬ ПО
	|	ДатаСоздания,
	|	НеобходимыйОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("НомерПроизводителя", НомерПроизводителя);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - 31536000));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Элементы.Результат.Заголовок =  "Можно учесть. Детали с таким номером производителя нет.";
		Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	Номенклатура = Выборка.Деталь;
	ОстатокНаСкладах  = Строка(Выборка.КолвоОстаток);
	МинимальныйЗапас = Строка(Выборка.НеобходимыйОстаток);
	
	Если (ТекущаяДата() - Выборка.ДатаСоздания) <= (31536000 * 2) Тогда
		Элементы.Результат.Заголовок = "Можно учесть.";
		Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
	Иначе 
		Если Выборка.КолвоОстаток > Выборка.НеобходимыйОстаток И Выборка.НеобходимыйОстаток <> 0 Тогда
			Элементы.Результат.Заголовок =  "Нельзя учесть. Количество на складе превышает необходимый запас.";
			Элементы.Результат.ЦветТекста = WebЦвета.Красный;
		ИначеЕсли Выборка.НеобходимыйОстаток = 0 И Выборка.КолвоОстаток < 10 Тогда 
			Элементы.Результат.Заголовок =  "Можно учесть. Необходимый запас 0, но нужно минимум 10 шт.";
			Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		ИначеЕсли Выборка.КолвоОстаток <  Выборка.НеобходимыйОстаток И Выборка.НеобходимыйОстаток <> 0 Тогда
			Элементы.Результат.Заголовок =  "Можно учесть. Остаток на складе меньше необходимого запаса."; 
			Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		Иначе 
			Элементы.Результат.Заголовок =  "Нельзя учесть. Необходимый запас 0. А количество на складе - " + Выборка.КолвоОстаток;
			Элементы.Результат.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПроизводителяПриИзменении(Элемент)
	Элементы.Результат.Заголовок = "";
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ОстатокНаСкладах = 0;
	МинимальныйЗапас = 0;
	Если НомерПроизводителя = "" Тогда  
		Возврат;
	КонецЕсли;
	НомерПроизводителяПриИзмененииНаСервере(НомерПроизводителя);
КонецПроцедуры
