
&НаСервере
Процедура НомерПроизводителяПриИзмененииНаСервере(НомерПроизводителя)
	Запрос = Новый Запрос;
	Запрос.Текст = дт_Склад.ТекстЗапросаПоискНоменклатурыПоНомеруПроизводителяИлиНомеруЗамены();
	
	Запрос.УстановитьПараметр("НомерПроизводителя", НомерПроизводителя);
	Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата() - 31536000));
	Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Элементы.Результат.Заголовок =  "Можно учесть. Детали с таким номером производителя нет.";
		Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Выборка.Следующий();
	Номенклатура = Выборка.Деталь;
	ОстатокНаСкладах  = Строка(Выборка.КолвоОстаток);
	МинимальныйЗапас = Строка(Выборка.НеобходимыйОстаток);
	
	Если (ТекущаяДата() - Выборка.ДатаСоздания) <= (31536000 * 2) Тогда
		Элементы.Результат.Заголовок = "Можно учесть.";
		Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
	Иначе 
		Если Выборка.КолвоОстаток > Выборка.НеобходимыйОстаток И Выборка.НеобходимыйОстаток <> 0 Тогда
			Элементы.Результат.Заголовок =  "Нельзя учесть. Количество на складе превышает необходимый запас.";
			Элементы.Результат.ЦветТекста = WebЦвета.Красный;
		ИначеЕсли Выборка.НеобходимыйОстаток = 0 И Выборка.КолвоОстаток < 10 Тогда 
			Элементы.Результат.Заголовок =  "Можно учесть. Необходимый запас 0, но нужно минимум 10 шт.";
			Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		ИначеЕсли Выборка.КолвоОстаток <  Выборка.НеобходимыйОстаток И Выборка.НеобходимыйОстаток <> 0 Тогда
			Элементы.Результат.Заголовок =  "Можно учесть. Остаток на складе меньше необходимого запаса."; 
			Элементы.Результат.ЦветТекста = WebЦвета.Зеленый;
		Иначе 
			Элементы.Результат.Заголовок =  "Нельзя учесть. Необходимый запас 0. А количество на складе - " + Выборка.КолвоОстаток;
			Элементы.Результат.ЦветТекста = WebЦвета.Красный;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НомерПроизводителяПриИзменении(Элемент)
	Элементы.Результат.Заголовок = "";
	Номенклатура = ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка");
	ОстатокНаСкладах = 0;
	МинимальныйЗапас = 0;
	Если НомерПроизводителя = "" Тогда  
		Возврат;
	КонецЕсли;
	НомерПроизводителяПриИзмененииНаСервере(НомерПроизводителя);
КонецПроцедуры
