
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
КонецПроцедуры

&НаСервере
Процедура устСтарВлад()
	владел = Объект.Владелец;
КонецПроцедуры


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	// Вставить содержимое обработчика.
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Ссылка
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |ГДЕ
	               |	Номенклатура.podkategoria = &podkategoria";
    запрос.УстановитьПараметр("podkategoria",Объект.Ссылка);
	Если владел <> Объект.Владелец Тогда
		рез = запрос.Выполнить().Выгрузить();
		Для Каждого стр Из Рез Цикл
			об = стр.Ссылка.ПолучитьОбъект();
			об.Категория = Объект.Владелец;
			об.Записать();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

