


&НаКлиенте
Процедура УстановитьДанныеПоИнвентарномуНомеру(ТекСтрока) Экспорт

	///+ГомзМА 13.04.2023
	//Заполнение данных по инвентарному номеру
	СерийныйНомер = РаботаСДокументамиТМЦВызовСервера.ПолучитьСерийныйНомер (ТекСтрока.ИнвентарныйНомер);
	ТМЦ 		  = РаботаСДокументамиТМЦВызовСервера.ПолучитьТМЦ		    (ТекСтрока.ИнвентарныйНомер);
	СтоимостьТМЦ  = РаботаСДокументамиТМЦВызовСервера.ПолучитьСтоимостьТМЦ  (ТекСтрока.ИнвентарныйНомер);
	СкладСписания = РаботаСДокументамиТМЦВызовСервера.ПолучитьМестоХранения (ТекСтрока.ИнвентарныйНомер);
	КоличествоТМЦ = РаботаСДокументамиТМЦВызовСервера.ПолучитьКоличествоТМЦ	(ТекСтрока.ИнвентарныйНомер);
	
	ТекСтрока.СерийныйНомер  = СерийныйНомер;
	ТекСтрока.ТМЦ 			 = ТМЦ;
	ТекСтрока.Цена 			 = СтоимостьТМЦ;
	ТекСтрока.Количество	 = КоличествоТМЦ;
	ТекСтрока.СкладСписания  = СкладСписания;
	///-ГомзМА 13.04.2023

КонецПроцедуры

