
#Область ОбработчикиСобытийФормы

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

	///+ГомзМА 21.06.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПоступлениеТМЦСкладСнабжение") Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИнвентарныеНомера.Ссылка КАК Ссылка,
		|	ИнвентарныеНомера.ДокументПоступления КАК ДокументПоступления,
		|	ИнвентарныеНомера.Владелец КАК Владелец,
		|	ИнвентарныеНомера.СерийныйНомер КАК СерийныйНомер
		|ИЗ
		|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
		|ГДЕ
		|	ИнвентарныеНомера.ДокументПоступления = &ДокументПоступления";
		
		Запрос.УстановитьПараметр("ДокументПоступления", ДанныеЗаполнения.Ссылка);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		Пока РезультатЗапроса.Следующий() Цикл
			
			//Проверка на дубли в регистре накопления ДвижениеТМЦВорктрак
			Количество = РаботаСДокументамиТМЦВызовСервера.ПолучитьСуммуКоличестваЗадубленныхСтрок(РезультатЗапроса.ДокументПоступления, РезультатЗапроса.Ссылка);
			
			НоваяСтрока = СписокТМЦ.Добавить();
			НоваяСтрока.ИнвентарныйНомер 	= РезультатЗапроса.Ссылка;
			НоваяСтрока.ТМЦ 				= РезультатЗапроса.Владелец;
			НоваяСтрока.СерийныйНомер 		= РезультатЗапроса.СерийныйНомер;
			ДокументПоступленияТЧ = ПолучитьТабличнуюЧастьДокументаПоступление(РезультатЗапроса.Владелец, РезультатЗапроса.ДокументПоступления);
			
			Если ДокументПоступленияТЧ.ТипУчета = Перечисления.ТипУчетаТМЦ.УчестьПоштучно Тогда
				НоваяСтрока.Количество 			= 1;
				НоваяСтрока.Сумма 				= ДокументПоступленияТЧ.Цена;
			Иначе
				Если Количество = 0 Тогда
					НоваяСтрока.Количество 		= ДокументПоступленияТЧ.Количество;
				Иначе
					НоваяСтрока.Количество 		= Количество;
				КонецЕсли;
				НоваяСтрока.Сумма 				= ДокументПоступленияТЧ.Сумма;
			КонецЕсли;
			
			НоваяСтрока.Цена 					= ДокументПоступленияТЧ.Цена;
			НоваяСтрока.СкладСписания 			= ДокументПоступленияТЧ.Склад;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 21.06.2023
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	///+ГомзМА 18.04.2023
	Движения.ДвижениеТМЦСкладСнабжение.Записывать = Истина;
		
		// регистр ДвижениеТМЦСкладСнабжение Расход
		Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
			Движение 					= Движения.ДвижениеТМЦСкладСнабжение.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Расход;
			Движение.Период 	 		= Дата;
			Движение.ТМЦ 		 		= ТекСтрокаСписокТМЦ.ТМЦ;
			Движение.МестоХранения 		= ТекСтрокаСписокТМЦ.СкладСписания;
			Движение.ИнвентарныйНомер 	= ТекСтрокаСписокТМЦ.ИнвентарныйНомер;
			Движение.Количество 		= ТекСтрокаСписокТМЦ.Количество;
			Движение.Цена 				= ТекСтрокаСписокТМЦ.Цена;
		КонецЦикла;
		
		// регистр ДвижениеТМЦСкладСнабжение Приход
		Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
			Движение 					= Движения.ДвижениеТМЦСкладСнабжение.Добавить();
			Движение.ВидДвижения 		= ВидДвиженияНакопления.Приход;
			Движение.Период 			= Дата;
			Движение.ТМЦ 				= ТекСтрокаСписокТМЦ.ТМЦ;
			Движение.МестоХранения 		= ТекСтрокаСписокТМЦ.Склад;
			Движение.ИнвентарныйНомер 	= ТекСтрокаСписокТМЦ.ИнвентарныйНомер;
			Движение.Количество 		= ТекСтрокаСписокТМЦ.Количество;
			Движение.Цена 				= ТекСтрокаСписокТМЦ.Цена;
		КонецЦикла;
	
	Движения.Записать();
	
	Отказ = РегистрыНакопления.ДвижениеТМЦСкладСнабжение.ЕстьОтрицательныеОстатки(Ссылка, Дата, ТекСтрокаСписокТМЦ.СкладСписания);
	///-ГомзМА 18.04.2023

КонецПроцедуры


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	///+ГомзМА 27.04.2023
	СуммаДокумента = СписокТМЦ.Итог("Сумма");
	///-ГомзМА 27.04.2023
		
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы



#КонецОбласти


#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьТабличнуюЧастьДокументаПоступление(ТМЦ, ДокументПоступления)
	
	///+ГомзМА 21.06.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Количество КАК Количество,
		|	ПоступлениеТМЦСкладСнабжениеСписокТМЦ.ТипУчета КАК ТипУчета,
		|	ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Цена КАК Цена,
		|	ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Сумма КАК Сумма,
		|	ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Склад КАК Склад
		|ИЗ
		|	Документ.ПоступлениеТМЦСкладСнабжение.СписокТМЦ КАК ПоступлениеТМЦСкладСнабжениеСписокТМЦ
		|ГДЕ
		|	ПоступлениеТМЦСкладСнабжениеСписокТМЦ.ТМЦ = &ТМЦ
		|	И ПоступлениеТМЦСкладСнабжениеСписокТМЦ.Ссылка.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("ТМЦ", 	ТМЦ);
	Запрос.УстановитьПараметр("Ссылка", ДокументПоступления);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса;
	///-ГомзМА 21.06.2023


КонецФункции // ПолучитьТабличнуюЧастьДокументаПоступление()





#КонецОбласти



