
#Область ТекстЗапроса

Функция ПолучитьТекстДляТоваровАвитоЧастник()
	
	///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|		КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|			ТОГДА НЕ (РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|			ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|		ИНАЧЕ
	|		НЕ (ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление,
	|	1 КАК КолвоДублей
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции

Функция ПолучитьТекстДляТоваровАвитоМенее19кг()
	
	///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 9
	|	И ИндНомер.Цена < 150000
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|				ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|	И ИндНомер.индкод.Владелец.Вес <> 0
	|	И ИндНомер.индкод.Владелец.длин <> 0
	|	И ИндНомер.индкод.Владелец.шир <> 0
	|	И ИндНомер.индкод.Владелец.выс <> 0
	|	И ИндНомер.индкод.Владелец.Вес < 19
	|	И ИндНомер.индкод.Владелец.длин < 120
	|	И ИндНомер.индкод.Владелец.шир < 80
	|	И ИндНомер.индкод.Владелец.выс < 50
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции 

Функция ПолучитьТекстДляТоваровАвитоБолее19кг()
	
	///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|							ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И (ИндНомер.Цена > 149999 ИЛИ (ИндНомер.индкод.Владелец.Вес >= 19
	|	ИЛИ ИндНомер.индкод.Владелец.длин >= 120
	|	ИЛИ ИндНомер.индкод.Владелец.шир >= 80
	|	ИЛИ ИндНомер.индкод.Владелец.выс >= 50
	|	ИЛИ ИндНомер.индкод.Владелец.Вес = 0
	|	ИЛИ ИндНомер.индкод.Владелец.длин = 0
	|	ИЛИ ИндНомер.индкод.Владелец.шир = 0
	|	ИЛИ ИндНомер.индкод.Владелец.выс = 0))
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции

Функция ПолучитьТекстДляТоваровДром()

	///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|							ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И ИндНомер.Стеллаж.Владелец В (&Склад)
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции 

Функция ПолучитьТекстДляИззап()

	///+ГомзМА 14.05.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.индкод.Владелец.Производитель КАК Производитель,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|		КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|			ТОГДА НЕ (РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|			ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|		ИНАЧЕ
	|		НЕ (ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Производитель КАК Производитель,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 14.05.2024

КонецФункции

Функция ПолучитьТекстДляЗзап()

	///+ГомзМА 16.05.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.индкод.Владелец.Производитель КАК Производитель,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|		КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|			ТОГДА НЕ (РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|			ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|		ИНАЧЕ
	|		НЕ (ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ
	|	И ИндНомер.Стеллаж.Владелец В (&Склад)
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Производитель КАК Производитель,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 16.05.2024

КонецФункции

Функция ПолучитьТекстДляТоваровАвитоЧасть1()
	
	///+ГомзМА 02.09.2024
	Результат = "ВЫБРАТЬ
	            |	ИндНомер.индкод КАК индкод,
	            |	ИндНомер.индкод.Владелец КАК Товар,
	            |	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	            |	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	            |	ИндНомер.Состояние КАК Состояние,
	            |	ИндНомер.Цена КАК Цена,
	            |	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	            |	РегистрНакопления1Остатки.машина КАК машина,
	            |	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	            |	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	            |	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	            |	ИндНомер.индкод.Владелец.длин КАК Длина,
	            |	ИндНомер.индкод.Владелец.шир КАК Ширина,
	            |	ИндНомер.индкод.Владелец.выс КАК Высота,
	            |	ИндНомер.Комментарий КАК Комментарий,
	            |	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	            |	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	            |	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	            |	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	            |	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	            |	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	            |	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	            |	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	            |	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	            |	ИндНомер.Стеллаж.Владелец КАК Склад,
	            |	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	            |	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	            |	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	            |	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	            |ПОМЕСТИТЬ ВТ_Данные
	            |ИЗ
	            |	РегистрСведений.ИндНомер КАК ИндНомер
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	            |		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	            |ГДЕ
	            |	ИндНомер.АвитоЧастник
	            |	И РегистрНакопления1Остатки.КолвоОстаток > 0
	            |	И ИндНомер.Цена > 0
	            |	И ИндНомер.Цена >= 5000
	            |	И ИндНомер.ЕстьФото = ИСТИНА
	            |	И ИндНомер.Стеллаж <> &Стеллаж
	            |	И ВЫБОР
	            |			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	            |				ТОГДА НЕ РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	            |			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	            |						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	            |		КОНЕЦ
	            |	И ИндНомер.Поддон <> &Поддон
	            |	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	            |	ВТ_Данные.индкод КАК индкод,
	            |	ВТ_Данные.Товар.Код КАК КодТовара,
	            |	ВТ_Данные.Товар КАК Товар,
	            |	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	            |	ВТ_Данные.Бренд КАК Бренд,
	            |	ВТ_Данные.Состояние КАК Состояние,
	            |	ВТ_Данные.Цена КАК Цена,
	            |	ВТ_Данные.Вес КАК Вес,
	            |	ВТ_Данные.машина КАК машина,
	            |	ВТ_Данные.Серия КАК Серия,
	            |	ВТ_Данные.Модель КАК Модель,
	            |	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	            |	ВТ_Данные.Длина КАК Длина,
	            |	ВТ_Данные.Ширина КАК Ширина,
	            |	ВТ_Данные.Высота КАК Высота,
	            |	ВТ_Данные.Комментарий КАК Комментарий,
	            |	ВТ_Данные.Категории КАК Категории,
	            |	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	            |	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	            |	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	            |	ВТ_Данные.ОсьШин КАК ОсьШин,
	            |	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	            |	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	            |	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	            |	ВТ_Данные.МодельШин КАК МодельШин,
	            |	ВТ_Данные.Склад КАК Склад,
	            |	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	            |	ВТ_Данные.Артикул КАК Артикул,
	            |	ВТ_Данные.индкодПредставление КАК индкодПредставление,
	            |	1 КАК КолвоДублей
	            |ИЗ
	            |	ВТ_Данные КАК ВТ_Данные
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 02.09.2024
	
КонецФункции 

Функция ПолучитьТекстДляТоваровАвитоЧасть2()
	
	// 1 вариант габариты нулевые или больше подходящих, до 5 тыс
	// 2 вариант габариты подходят и дороже 2 тыс
	///+ГомзМА 02.09.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0   
	|	И ИндНомер.Цена > 0
	|	И ((ИндНомер.Цена < 5000 И (ИндНомер.индкод.Владелец.Вес >= 19
	|								ИЛИ ИндНомер.индкод.Владелец.длин >= 120
	|								ИЛИ ИндНомер.индкод.Владелец.шир >= 80
	|								ИЛИ ИндНомер.индкод.Владелец.выс >= 50
	|								ИЛИ ИндНомер.индкод.Владелец.Вес = 0
	|								ИЛИ ИндНомер.индкод.Владелец.длин = 0
	|								ИЛИ ИндНомер.индкод.Владелец.шир = 0
	|								ИЛИ ИндНомер.индкод.Владелец.выс = 0)) 
	|		ИЛИ
	|	(ИндНомер.Цена >= 2000 И (ИндНомер.индкод.Владелец.Вес < 19
	|							  И ИндНомер.индкод.Владелец.длин < 120
	|							  И ИндНомер.индкод.Владелец.шир < 80
	|							  И ИндНомер.индкод.Владелец.выс < 50
	|							  И ИндНомер.индкод.Владелец.Вес <> 0
	|							  И ИндНомер.индкод.Владелец.длин <> 0
	|							  И ИндНомер.индкод.Владелец.шир <> 0
	|							  И ИндНомер.индкод.Владелец.выс <> 0)))
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И ИндНомер.индкод.Владелец.Вес = 0
	|	И ИндНомер.индкод.Владелец.длин = 0
	|	И ИндНомер.индкод.Владелец.шир = 0
	|	И ИндНомер.индкод.Владелец.выс = 0))
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление,
	|	1 КАК КолвоДублей
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 02.09.2024
	
КонецФункции 

Функция ПолучитьТекстДляТоваровАвитоЧасть3()
	
	///+ГомзМА 02.09.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0 
	|	И ИндНомер.Цена > 0
	|	И (ИндНомер.Цена <= 2000 И (ИндНомер.индкод.Владелец.Вес < 19
	|							  И ИндНомер.индкод.Владелец.длин < 120
	|							  И ИндНомер.индкод.Владелец.шир < 80
	|							  И ИндНомер.индкод.Владелец.выс < 50
	|							  И ИндНомер.индкод.Владелец.Вес <> 0
	|							  И ИндНомер.индкод.Владелец.длин <> 0
	|							  И ИндНомер.индкод.Владелец.шир <> 0
	|							  И ИндНомер.индкод.Владелец.выс <> 0))
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление,
	|	1 КАК КолвоДублей
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 02.09.2024
	
КонецФункции 

Функция ПолучитьТекстДляТоваровАвитоНН()
	
	///+ГомзМА 02.09.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0 
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения   
	|	И ИндНомер.Стеллаж.Владелец В (&Склад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление,
	|	1 КАК КолвоДублей
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 02.09.2024
	
КонецФункции

Функция ПолучитьТекстДляТоваровАвитоМСК()
	
	///+ГомзМА 02.09.2024
	Результат = "ВЫБРАТЬ 
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0 
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И ИндНомер.Поддон <> &Поддон
	|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения   
	|	И ИндНомер.Стеллаж.Владелец В (&Склад)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление,
	|	1 КАК КолвоДублей
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 02.09.2024
	
КонецФункции 

Функция ПолучитьТекстДляТоваровАвитоЕКБ()
	
	///+ГомзМА 02.09.2024
	Результат = "ВЫБРАТЬ 
	            |	ИндНомер.индкод КАК индкод,
	            |	ИндНомер.индкод.Владелец КАК Товар,
	            |	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	            |	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	            |	ИндНомер.Состояние КАК Состояние,
	            |	ИндНомер.Цена КАК Цена,
	            |	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	            |	РегистрНакопления1Остатки.машина КАК машина,
	            |	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	            |	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	            |	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	            |	ИндНомер.индкод.Владелец.длин КАК Длина,
	            |	ИндНомер.индкод.Владелец.шир КАК Ширина,
	            |	ИндНомер.индкод.Владелец.выс КАК Высота,
	            |	ИндНомер.Комментарий КАК Комментарий,
	            |	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	            |	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	            |	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	            |	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	            |	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	            |	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	            |	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	            |	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	            |	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	            |	ИндНомер.Стеллаж.Владелец КАК Склад,
	            |	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	            |	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	            |	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	            |	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	            |ПОМЕСТИТЬ ВТ_Данные
	            |ИЗ
	            |	РегистрСведений.ИндНомер КАК ИндНомер
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	            |		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	            |ГДЕ
	            |	ИндНомер.АвитоЧастник
	            |	И РегистрНакопления1Остатки.КолвоОстаток > 0
	            |	И ИндНомер.Цена > 0
	            |	И ИндНомер.ЕстьФото = ИСТИНА
	            |	И ИндНомер.Стеллаж <> &Стеллаж
	            |	И ВЫБОР
	            |			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	            |				ТОГДА НЕ РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	            |			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	            |						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	            |		КОНЕЦ
	            |	И ИндНомер.Поддон <> &Поддон
	            |	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	            |	И ИндНомер.Стеллаж.Владелец В(&Склад)	           
				|;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	            |	ВТ_Данные.индкод КАК индкод,
	            |	ВТ_Данные.Товар.Код КАК КодТовара,
	            |	ВТ_Данные.Товар КАК Товар,
	            |	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	            |	ВТ_Данные.Бренд КАК Бренд,
	            |	ВТ_Данные.Состояние КАК Состояние,
	            |	ВТ_Данные.Цена КАК Цена,
	            |	ВТ_Данные.Вес КАК Вес,
	            |	ВТ_Данные.машина КАК машина,
	            |	ВТ_Данные.Серия КАК Серия,
	            |	ВТ_Данные.Модель КАК Модель,
	            |	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	            |	ВТ_Данные.Длина КАК Длина,
	            |	ВТ_Данные.Ширина КАК Ширина,
	            |	ВТ_Данные.Высота КАК Высота,
	            |	ВТ_Данные.Комментарий КАК Комментарий,
	            |	ВТ_Данные.Категории КАК Категории,
	            |	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	            |	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	            |	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	            |	ВТ_Данные.ОсьШин КАК ОсьШин,
	            |	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	            |	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	            |	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	            |	ВТ_Данные.МодельШин КАК МодельШин,
	            |	ВТ_Данные.Склад КАК Склад,
	            |	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	            |	ВТ_Данные.Артикул КАК Артикул,
	            |	ВТ_Данные.индкодПредставление КАК индкодПредставление,
	            |	1 КАК КолвоДублей
	            |ИЗ
	            |	ВТ_Данные КАК ВТ_Данные
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 02.09.2024
	
КонецФункции 

Функция ПолучитьТекстДляОзон()

	///+ТатарМА 09.09.2024
	Результат = "ВЫБРАТЬ
	            |	ИндНомер.индкод КАК индкод,
	            |	ИндНомер.индкод.Владелец КАК Товар,
	            |	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	            |	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	            |	ИндНомер.Состояние КАК Состояние,
	            |	ИндНомер.Цена КАК Цена,
	            |	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	            |	РегистрНакопления1Остатки.машина КАК машина,
	            |	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	            |	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	            |	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	            |	ИндНомер.индкод.Владелец.длин КАК Длина,
	            |	ИндНомер.индкод.Владелец.шир КАК Ширина,
	            |	ИндНомер.индкод.Владелец.выс КАК Высота,
	            |	ИндНомер.Комментарий КАК Комментарий,
	            |	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	            |	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	            |	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	            |	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	            |	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	            |	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	            |	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	            |	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	            |	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	            |	ИндНомер.Стеллаж.Владелец КАК Склад,
	            |	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	            |	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	            |	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	            |	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	            |ПОМЕСТИТЬ ВТ_Данные
	            |ИЗ
	            |	РегистрСведений.ИндНомер КАК ИндНомер
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	            |		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	            |ГДЕ
	            |	ИндНомер.АвитоЧастник
	            |	И РегистрНакопления1Остатки.КолвоОстаток > 0
	            |	И ИндНомер.Цена > 0
	            |	И ИндНомер.ЕстьФото = ИСТИНА
	            |	И ИндНомер.Стеллаж <> &Стеллаж
	            |	И ВЫБОР
	            |			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	            |				ТОГДА НЕ РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
				|						И ИндНомер.индкод.Владелец.Вес <> 0
				|						И ИндНомер.индкод.Владелец.длин <> 0
				|						И ИндНомер.индкод.Владелец.шир <> 0
				|						И ИндНомер.индкод.Владелец.выс <> 0
	            |			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	            |						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	            |		КОНЕЦ
				|	И ИндНомер.Стеллаж.Владелец В (&Склад)
	            |	И ИндНомер.Поддон <> &Поддон
	            |	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	            |	И ИндНомер.Состояние = ЗНАЧЕНИЕ(Перечисление.Состояние.Новый)
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	            |	ВТ_Данные.индкод КАК индкод,
	            |	ВТ_Данные.Товар.Код КАК КодТовара,
	            |	ВТ_Данные.Товар КАК Товар,
	            |	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	            |	ВТ_Данные.Бренд КАК Бренд,
	            |	ВТ_Данные.Состояние КАК Состояние,
	            |	ВТ_Данные.Цена КАК Цена,
	            |	ВТ_Данные.Вес КАК Вес,
	            |	ВТ_Данные.машина КАК машина,
	            |	ВТ_Данные.Серия КАК Серия,
	            |	ВТ_Данные.Модель КАК Модель,
	            |	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	            |	ВТ_Данные.Длина КАК Длина,
	            |	ВТ_Данные.Ширина КАК Ширина,
	            |	ВТ_Данные.Высота КАК Высота,
	            |	ВТ_Данные.Комментарий КАК Комментарий,
	            |	ВТ_Данные.Категории КАК Категории,
	            |	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	            |	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	            |	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	            |	ВТ_Данные.ОсьШин КАК ОсьШин,
	            |	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	            |	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	            |	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	            |	ВТ_Данные.МодельШин КАК МодельШин,
	            |	ВТ_Данные.Склад КАК Склад,
	            |	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	            |	ВТ_Данные.Артикул КАК Артикул,
	            |	ВТ_Данные.индкодПредставление КАК индкодПредставление,
	            |	1 КАК КолвоДублей
	            |ИЗ
	            |	ВТ_Данные КАК ВТ_Данные
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	НомерЗаписи";
	
	Возврат Результат;
	///-ТатарМА 09.09.2024

КонецФункции 

#КонецОбласти

#Область АвитоЧастник 

Процедура АвтозагрузкаАвитоЧастник() Экспорт
	
	///+ГомзМА 15.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоЧастник();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); //П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	
	//+++ Убрать дубли по индкодам +++
	ПоискДублей = ДеталиТЗ.Скопировать(, "индкод, КолвоДублей");
	ПоискДублей.Свернуть("индкод", "КолвоДублей");
	
	Дубли = ПоискДублей.НайтиСтроки(Новый Структура("КолвоДублей", 2)); 
	Если Дубли <> Неопределено Тогда  
		Для каждого Дубль Из Дубли Цикл
		НайденныйИндкод = Дубль.индкод;	
		СтрокиДляУдаления = ДеталиТЗ.НайтиСтроки(Новый Структура("индкод", НайденныйИндкод));
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДеталиТЗ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	
	КоличествоДеталей = ДеталиТЗ.Количество();
	Сообщить("Всего " + КоличествоДеталей + " деталей");
	//--- Убрать дубли по индкодам ---

	////Добавляем степень износа +
	ДеталиТЗ.Колонки.Добавить("СтепеньИзноса");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "КодТовара, Товар, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("КодТовара, Товар", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("КодТовара", СтрокаТЗ.КодТовара);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		СтепеньИзноса = 5;
		Индекс = 0;
		
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			НайденнаяСтрока.СтепеньИзноса = СтепеньИзноса + (Индекс * 0.1);
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЦикла;
	////Добавляем степень износа -
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito_chastnik\avito_chastnik.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоЧастник(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 15.02.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоЧастник(ТЗРезультат) 
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
					НайденныеФотки = СтрокаФото.xml;
					Прервать;  
				КонецЕсли;
			КонецЦикла;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ", 51);
				Если СтрДлина(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
			
			Если РезультатЗапроса.Комментарий <> "" Тогда
				Комментарий = "" + Символы.ПС + "<p>" + РезультатЗапроса.Комментарий + "</p>";	
			Иначе
				Комментарий = "";		
			КонецЕсли;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Вес = РезультатЗапроса.Вес;
			
			СтепеньИзноса = РезультатЗапроса.СтепеньИзноса;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + " 
				|<p>️Состояние: Хорошее <br>
				|Размеры: " + РазмерыШин + "</p>
				|Степень износа  " + СтепеньИзноса + "%</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Подходит для " + МодельСерия + "</p>
				|<p>Экспресс доставка до терминала в день покупки (габариты обговариваются)<br>
				|Бесплатная консультация и заказ - доступны 24/7<br>
				|Прием звонков: с 9 до 18<br>
				|Любой способ оплаты</p>
				|<p>️Ассортимент включает 200000 деталей scania</p>
				|<p>️Нас так же можно найти по таким запросам:</p>
				|<p>️запчасти скания, запчасти скания 5, купить запчасти на сканию, запчасти скания 5 серии, запчасти скания тягач, запчасти скания 6,  запчасти скания 6 серии</p>
				|<p>️запчасти scania, запчасти scania серии, запчасти scania r,  запчасти scania купить, запчасти scania 5, запчасти автомобиля scania, запчасти scania 6</p]]></Description>
				|<Price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</Price>
				|" + НайденныеФотки + "
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";

			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>Запчасти Scania: Оригинальные Детали для Надежности Вашего Грузовика!</p>
				|<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + " 
				|<p>С Авито Доставкой</p>
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + Размеры + "<br>
				|<p>️Вес: " + Вес + " кг</p>
				|Степень износа  " + СтепеньИзноса + "%</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Большой выбор запчастей для грузовиков Scania, обеспечиваем высокое качество и надежность. Наши запчасти подходят для всех моделей, включая Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.</p> 
				|<p>Почему мы?</p>
				|<p>- Быстрая и надежная доставка по всей России.</p>
				|<p>Почему стоит выбрать нас?<br>
				|- Опытные специалисты помогут вам подобрать нужные детали.<br>
				|- Онлайн-консультации: отправим фото и видео по запросу.</p>
				|<p>Доставка и Оплата:<br>
				|- Быстрая доставка по всей России.<br>
				|- Удобные способы оплаты: наличные, карта, безналичный расчет.</p>
				|<p>scania, скания, scania R, scania 5, запчасти Scania, купить Scania, Scania тягач, Scania б/у</p>
				|<p>Закажите оригинальные запчасти Scania прямо сейчас и обеспечьте вашему грузовику надежность и долгий срок службы!</p]]></Description>
				|<Price>" + Формат(РезультатЗапроса.Цена * 1.12, "ЧДЦ=0; ЧГ=0") + "</Price>
				|" + НайденныеФотки + "
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в сборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>В наличии</Availability>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 15.02.2024
	
КонецФункции

#КонецОбласти

#Область АвитоМенее19кг

Процедура АвтозагрузкаАвитоМенее19кг() Экспорт
	
	///+ГомзМА 15.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоМенее19кг();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
////Добавляем степень износа +
	ДеталиТЗ.Колонки.Добавить("СтепеньИзноса");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "КодТовара, Товар, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("КодТовара, Товар", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("КодТовара", СтрокаТЗ.КодТовара);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		СтепеньИзноса = 5;
		Индекс = 0;
		
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			НайденнаяСтрока.СтепеньИзноса = СтепеньИзноса + (Индекс * 0.1);
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЦикла;
	////Добавляем степень износа -
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito-19kg\avito-19kg.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоМенее19кг(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 15.02.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоМенее19кг(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml; 
				Прервать;  
			конецЕсли;
		КонецЦикла;
			
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ", 51);
				Если СтрДлина(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
			
			Если РезультатЗапроса.Комментарий <> "" Тогда
				Комментарий = "" + Символы.ПС + "<p>" + РезультатЗапроса.Комментарий + "</p>";	
			Иначе
				Комментарий = "";		
			КонецЕсли;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
				РезультатЗапроса.Ширина = 0 	ИЛИ 
				РезультатЗапроса.Высота = 0)	Тогда
				Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
			Иначе
				Размеры = "По запросу";
			КонецЕсли;
			
			Вес = РезультатЗапроса.Вес;
			
			Цена = Формат(РезультатЗапроса.Цена * 1.1, "ЧДЦ=0; ЧГ=0");
			//Скидка в выходной день
//			Если ДеньНедели(ТекущаяДатаСеанса()) = 6 ИЛИ (ДеньНедели(ТекущаяДатаСеанса()) И ТекущаяДатаСеанса() < КонецДня(ТекущаяДатаСеанса()) - 3600) = 7 Тогда
//				ЦенаСкидки = Цена * 0.2;
//				Цена = Формат(Цена - ЦенаСкидки, "ЧДЦ=0; ЧГ=0");
//			КонецЕсли;
			
			Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
				ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
				"<Make>Scania</Make>" + Символы.ПС +  
				"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
			Иначе
				ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
			КонецЕсли;
			
			СтепеньИзноса = РезультатЗапроса.СтепеньИзноса;
			
			ТекстФайла = ТекстФайла + " 
			|<Ad>
			|<Id>" + АйдиКод + "</Id> 
			|<ContactPhone>8 953 554 29 93</ContactPhone>
			|<Address>" + Адрес + "</Address> 
			|<ContactMethod>По телефону и в сообщениях</ContactMethod>
			|<Category>Запчасти и аксессуары</Category>
			|<Title>" + Название + "</Title>
			|<Description><![CDATA[<p>Запчасти Scania: Оригинальные Детали для Надежности Вашего Грузовика!</p>
			|<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + " 
			|<p>С Авито Доставкой</p>
			|<p>️Состояние: " + Состояние + "<br>
			|Размеры: " + Размеры + "<br>
			|<p>️Вес: " + Вес + " кг<br>
			|Степень износа " + СтепеньИзноса + "%</p>
			|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
			|Аналоги: " + Аналог + "<br>
			|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
			|<p>Большой выбор запчастей для грузовиков Scania, обеспечиваем высокое качество и надежность. Наши запчасти подходят для всех моделей, включая Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.</p> 
			|<p>Почему мы?</p>
			|<p>- Быстрая и надежная доставка по всей России.</p>
			|<p>Почему стоит выбрать нас?<br>
			|- Опытные специалисты помогут вам подобрать нужные детали.<br>
			|- Онлайн-консультации: отправим фото и видео по запросу.</p>
			|<p>Доставка и Оплата:<br>
			|- Быстрая доставка по всей России.<br>
			|- Удобные способы оплаты: наличные, карта, безналичный расчет.</p>
			|<p>scania, скания, scania R, scania 5, запчасти Scania, купить Scania, Scania тягач, Scania б/у</p>
			|<p>Закажите оригинальные запчасти Scania прямо сейчас и обеспечьте вашему грузовику надежность и долгий срок службы!</p]]></Description>
			|<Price>" + Цена + "</Price>
			|" + НайденныеФотки + "
			|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw&amp;list=PLnbjYzzECnGHE829ffFQf6l-FS5CA8hAm&amp;index=8</VideoURL>
			|<GoodsType>Запчасти</GoodsType>
			|<AdType>Товар приобретен на продажу</AdType>
			|<ProductType>Для грузовиков и спецтехники</ProductType>
			|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
			|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в разборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
			|<Availability>В наличии</Availability>
			|<Originality>Оригинал</Originality>
			|<Brand>" + Бренд + "</Brand>
			|" + ЗаменаТекстаДетали + "
			|<Condition>" + Состояние + "</Condition>
			|</Ad>";			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 15.02.2024
	
КонецФункции

#КонецОбласти

#Область АвитоБолее19кг

Процедура АвтозагрузкаАвитоБолее19кг() Экспорт
	
	///+ГомзМА 15.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоБолее19кг();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	////Добавляем степень износа +
	ДеталиТЗ.Колонки.Добавить("СтепеньИзноса");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "КодТовара, Товар, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("КодТовара, Товар", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("КодТовара", СтрокаТЗ.КодТовара);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		СтепеньИзноса = 5;
		Индекс = 0;
		
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			НайденнаяСтрока.СтепеньИзноса = СтепеньИзноса + (Индекс * 0.1);
			Индекс = Индекс + 1;
		КонецЦикла;
	КонецЦикла;
	////Добавляем степень износа -
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito+19kg\avito+19kg.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоБолее19кг(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 15.02.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоБолее19кг(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml; 
				Прервать;  
			конецЕсли;
		КонецЦикла;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ", 51);
				Если СтрДлина(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
			
			Если РезультатЗапроса.Комментарий <> "" Тогда
				Комментарий = "" + Символы.ПС + "<p>" + РезультатЗапроса.Комментарий + "</p>";	
			Иначе
				Комментарий = "";		
			КонецЕсли;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Цена = Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0");
			Цена = Формат(Цена * 1.05, "ЧДЦ=0; ЧГ=0");
			
			СтепеньИзноса = РезультатЗапроса.СтепеньИзноса;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + " 
				|<p>️Состояние: Хорошее <br>
				|Размеры: " + РазмерыШин + "<br>
				|Степень износа " + СтепеньИзноса + "%</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Подходит для " + МодельСерия + "</p>
				|<p>Экспресс доставка до терминала в день покупки (габариты обговариваются)<br>
				|Бесплатная консультация и заказ - доступны 24/7<br>
				|Прием звонков: с 9 до 18<br>
				|Любой способ оплаты</p>
				|<p>️Ассортимент включает 200000 деталей scania</p>
				|<p>️Нас так же можно найти по таким запросам:</p>
				|<p>️запчасти скания, запчасти скания 5, купить запчасти на сканию, запчасти скания 5 серии, запчасти скания тягач, запчасти скания 6,  запчасти скания 6 серии</p>
				|<p>️запчасти scania, запчасти scania серии, запчасти scania r,  запчасти scania купить, запчасти scania 5, запчасти автомобиля scania, запчасти scania 6</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw&amp;list=PLnbjYzzECnGHE829ffFQf6l-FS5CA8hAm&amp;index=8</VideoURL>
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + "  
				|<p>️Состояние: Хорошее <br>
				|Размеры: " + Размеры + "<br>
				|Степень износа " + СтепеньИзноса + "%</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗапроса.индкод + "</p> 
				|<p>Подходит для " + МодельСерия + "</p>
				|<p>Экспресс доставка до терминала в день покупки (габариты обговариваются)<br>
				|Бесплатная консультация и заказ - доступны 24/7<br>
				|Прием звонков: с 9 до 18<br>
				|Любой способ оплаты</p>
				|<p>️Ассортимент включает 200000 деталей scania</p>
				|<p>️Нас так же можно найти по таким запросам:</p>
				|<p>️запчасти скания, запчасти скания 5, купить запчасти на сканию, запчасти скания 5 серии, запчасти скания тягач, запчасти скания 6,  запчасти скания 6 серии</p>
				|<p>️запчасти scania, запчасти scania серии, запчасти scania r,  запчасти scania купить, запчасти scania 5, запчасти автомобиля scania, запчасти scania 6</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw&amp;list=PLnbjYzzECnGHE829ffFQf6l-FS5CA8hAm&amp;index=8</VideoURL>
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в разборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>В наличии</Availability>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 15.02.2024
	
КонецФункции

#КонецОбласти

#Область ДромНН

Процедура АвтозагрузкаДромНН() Экспорт

	///+ГомзМА 07.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровДром();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000019")); //АВИТО ЧАСТНИК
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000002")); //Нижний Новгород WorkTruck
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_dromNN\dromnn.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + "<offers>");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
				
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереДромНН(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
			
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</offers>");
	///-ГомзМА 07.02.2024

КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереДромНН(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml; 
				Прервать;  
			конецЕсли;
		КонецЦикла;
			
			//НайденныеФотки = Фотки[Итер].xml;
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "<Images>", "<picture>");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "</Images>", "</picture>");
			
			Итер = Итер +1;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
			Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
				НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
				Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
				ДлинаСтроки 		 = СтрДлина(Название);
				КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
				ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
				Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
					Название = Лев(Название, ДлинаСтроки - 1);
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			АйдиКод = "new_" + РезультатЗапроса.индкод;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<available>true</available>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + РазмерыШин + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p> 
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + Размеры + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 05.02.2023
	
КонецФункции

#КонецОбласти

#Область ДромМСК

Процедура АвтозагрузкаДромМСК() Экспорт

	///+ГомзМА 07.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровДром();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000005")); //Москва
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_dromMSK\drommsk.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + "<offers>");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
				
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереДромМСК(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
			
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</offers>");
	///-ГомзМА 07.02.2024

КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереДромМСК(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml; 
				Прервать;  
			конецЕсли;
		КонецЦикла; 
			
			//НайденныеФотки = Фотки[Итер].xml;
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "<Images>", "<picture>");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "</Images>", "</picture>");
			
			Итер = Итер +1;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
			Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
				НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
				Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
				ДлинаСтроки 		 = СтрДлина(Название);
				КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
				ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
				Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
					Название = Лев(Название, ДлинаСтроки - 1);
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			АйдиКод = "new_" + РезультатЗапроса.индкод;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + РазмерыШин + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p> 
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + Размеры + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 05.02.2023
	
КонецФункции

#КонецОбласти

#Область ДромЕКБ

Процедура АвтозагрузкаДромЕКБ() Экспорт

	///+ГомзМА 07.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровДром();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000008")); //Екатеринбург
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_dromEKB\dromekb.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + "<offers>");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
				
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереДромЕКБ(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
			
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</offers>");
	///-ГомзМА 07.02.2024

КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереДромЕКБ(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml; 
				Прервать;  
			конецЕсли;
		КонецЦикла; 
			//НайденныеФотки = Фотки[Итер].xml;
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "<Images>", "<picture>");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "</Images>", "</picture>");
			
			Итер = Итер +1;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
			Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
				НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
				Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
				ДлинаСтроки 		 = СтрДлина(Название);
				КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
				ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
				Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
					Название = Лев(Название, ДлинаСтроки - 1);
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			АйдиКод = "new_" + РезультатЗапроса.индкод;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + РазмерыШин + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p> 
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + Размеры + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 05.02.2023
	
КонецФункции

#КонецОбласти

#Область Иззап

Процедура АвтозагрузкаИззап() Экспорт
	
	///+ГомзМА 16.05.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляИззап();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КонечныйНомер = ДеталиТЗ.Количество();
	
	//Подключение к Excel
	Excel = Новый COMОбъект("Excel.Application"); 
	
	Excel.DisplayAlerts = 0;
	Excel.Visible = 0;
	
	//Открытие существующей книги
	ПутьКФайлу = "\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_izzap\izzap.xlsx";
	Книга = Excel.Workbooks.Open(ПутьКФайлу);
	
	//Получаем первый лист
	Лист = Книга.Worksheets(1);
	
	//Очистить ячейки
	ПоследняяСтрока = Лист.Cells(Лист.Rows.Count, 14).End(-4162).Row;
	Диапазон = Лист.Range("A2:N" + Строка(Формат(ПоследняяСтрока, "ЧГ=")));
	Диапазон.ClearContents();
	
	//Заполняем строки
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ВыгрузитьДанныеНаСервереИззап(ЧастьДеталей, Лист);
	КонецЦикла;
		
	//Сохраняем книгу
	Попытка
		//Книга.SaveCopyAs(ПутьКФайлу);
		Книга.SaveAs(ПутьКФайлу);
		//Закрываем Excel
		Excel.Workbooks.Close();
		Excel.Application.Quit();
	Исключение
		//Закрываем Excel
		Excel.Workbooks.Close();
		Excel.Application.Quit();
	КонецПопытки;
	///-ГомзМА 16.05.2024
	
КонецПроцедуры

Процедура ВыгрузитьДанныеНаСервереИззап(ТЗРезультат, Лист)
	
	///+ГомзМА 16.05.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	
	Фотки = ПолучитьФото(МассивИндкодов);
	Итер = 0;
		
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml; 
				Прервать;  
			конецЕсли;
		КонецЦикла; 
			//НайденноеФото = Фотки[Итер].xml;
			НайденноеФото = Сред(НайденноеФото, 22);
			КонечныйСимвол = СтрНайти(НайденноеФото, ">");
			НайденноеФото = Лев(НайденноеФото, КонечныйСимвол - 3);
			
			Производитель = Строка(РезультатЗапроса.Производитель);
			Производитель = СтрЗаменить(Производитель, "&", " ");
			
			Товар = Строка(РезультатЗапроса.Товар);
			Товар = СтрЗаменить(Товар, "&", " ");
			
			Строка = РезультатЗапроса.НомерЗаписи + 1;
			
			Лист.Cells(Строка, 1).Value  = Строка(РезультатЗапроса.индкод);
			Лист.Cells(Строка, 2).Value  = Строка(РезультатЗапроса.Артикул);
			Лист.Cells(Строка, 3).Value  = Строка(РезультатЗапроса.НомерПроизводителя);
			Лист.Cells(Строка, 4).Value  = Строка(РезультатЗапроса.Бренд);
			Лист.Cells(Строка, 5).Value  = Производитель;
			Лист.Cells(Строка, 6).Value  = Товар;
			Лист.Cells(Строка, 7).Value  = РезультатЗапроса.КолвоОстаток;
			Лист.Cells(Строка, 8).Value  = РезультатЗапроса.Цена;
			Лист.Cells(Строка, 9).Value  = ПолучитьАналогиТовара(РезультатЗапроса.Товар);
			Лист.Cells(Строка, 10).Value = Строка(РезультатЗапроса.Состояние);
			Лист.Cells(Строка, 11).Value = ""; //"Категория";
			Лист.Cells(Строка, 12).Value = ""; //"Ссылка на деталь на сайте";
			Лист.Cells(Строка, 13).Value = НайденноеФото;
			Лист.Cells(Строка, 14).Value = ""; //"Ссылка на фото детали на сайте";
			
			Итер = Итер +1;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 16.05.2024
	
КонецПроцедуры



#КонецОбласти

#Область Ззап

Процедура АвтозагрузкаЗзап() Экспорт

	///+ГомзМА 14.05.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляЗзап();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000019")); //АВИТО ЧАСТНИК
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000002")); //Нижний Новгород WorkTruck
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КонечныйНомер = ДеталиТЗ.Количество();
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_zzip\zzip.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + "<items>");

	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереЗзап(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</items>");
	///-ГомзМА 14.05.2024

КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереЗзап(ТЗРезультат)
	
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	
	Фотки = ПолучитьФото(МассивИндкодов);
	Итер = 0;
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml; 
				Прервать;  
			конецЕсли;
		КонецЦикла; 
			//НайденноеФото = Фотки[Итер].xml;
			НайденноеФото = Сред(НайденноеФото, 22);
			КонечныйСимвол = СтрНайти(НайденноеФото, ">");
			НайденноеФото = Лев(НайденноеФото, КонечныйСимвол - 3);
			
			Аналоги = ПолучитьАналогиТовара(РезультатЗапроса.Товар);
			
			Производитель = Строка(РезультатЗапроса.Производитель);
			Производитель = СтрЗаменить(Производитель, "&", " ");
			
			Товар = Строка(РезультатЗапроса.Товар);
			Товар = СтрЗаменить(Товар, "&", " ");
			
			ТекстФайла = ТекстФайла + " 
			|<item>
			|<Id1c>" + Строка(РезультатЗапроса.индкод) + "</Id1c> 
			|<VendorCode>" + Строка(РезультатЗапроса.Артикул) + "</VendorCode>
			|<nproizv>" + Строка(РезультатЗапроса.НомерПроизводителя) + "</nproizv>
			|<brand>" + Строка(РезультатЗапроса.Бренд) + "</brand> 
			|<Vendor>" + Производитель + "</Vendor>
			|<Title>" + Товар + "</Title>
			|<kolvo>" + РезультатЗапроса.КолвоОстаток + "</kolvo>
			|<Price>" + РезультатЗапроса.Цена + "</Price>
			|<analogs>" + Аналоги + "</analogs>
			|<condition>" + Строка(РезультатЗапроса.Состояние) + "</condition>
			|<category></category>
			|<url></url> 
			|<Image_path>" + НайденноеФото + "</Image_path>
			|<Image></Image>
			|</item>";
			
			Итер = Итер +1;
		КонецЦикла;
	КонецЕсли;
	Возврат ТекстФайла;
	
КонецФункции

#КонецОбласти

#Область АвитоЧасть1

Процедура АвтозагрузкаАвитоЧасть1() Экспорт
	
	///+ГомзМА 02.09.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоЧасть1();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	
	//+++ Убрать дубли по индкодам +++
	ПоискДублей = ДеталиТЗ.Скопировать(, "индкод, КолвоДублей");
	ПоискДублей.Свернуть("индкод", "КолвоДублей");
	
	Дубли = ПоискДублей.НайтиСтроки(Новый Структура("КолвоДублей", 2)); 
	Если Дубли <> Неопределено Тогда  
		Для каждого Дубль Из Дубли Цикл
		НайденныйИндкод = Дубль.индкод;	
		СтрокиДляУдаления = ДеталиТЗ.НайтиСтроки(Новый Структура("индкод", НайденныйИндкод));
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДеталиТЗ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	КоличествоДеталей = ДеталиТЗ.Количество();
	//--- Убрать дубли по индкодам ---
	
	//+++ Добавляем модель, степень и город +++
	ДанныеДляАртикуловТЗ = ЗагрузитьДанныеИзExcel();
	
	ДеталиТЗ.Колонки.Добавить("МодельИзЭксель");
	ДеталиТЗ.Колонки.Добавить("Степень");
	ДеталиТЗ.Колонки.Добавить("Город");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "Артикул, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("Артикул", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("Артикул", СтрокаТЗ.Артикул);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		Индекс = 0;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			Индекс = Индекс + 1;
			Если Индекс > 97 Тогда
				Индекс = 1;	
			КонецЕсли;
			ПараметрыОтбораДанныеДляАртикуловТЗ = Новый Структура("Номер", Индекс);
			СтрокаДанныеДляАртикуловТЗ = ДанныеДляАртикуловТЗ.НайтиСтроки(ПараметрыОтбораДанныеДляАртикуловТЗ);
			НайденнаяСтрока.Город = СтрокаДанныеДляАртикуловТЗ[0].Город;
			НайденнаяСтрока.МодельИзЭксель = СтрокаДанныеДляАртикуловТЗ[0].МодельИзЭксель;
		КонецЦикла;
	КонецЦикла;
	//--- Добавляем модель, степень и город ---
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito_chast1\avito_chast1.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоЧасть1(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 02.09.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоЧасть1(ТЗРезультат)
	
	///+ГомзМА 02.09.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрЗаменить(СтрокаФото.xml, "</", "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/1.png""/>" + Символы.ПС + 
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/2.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/3.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/4.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/5.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/6.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/7.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/8.png""/>" + Символы.ПС +
																   "</"); 
				Прервать;  
			конецЕсли;
		КонецЦикла;
			Итер = Итер +1;
			
			Адрес = РезультатЗапроса.Город;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
						
			Аналоги = НайтиАналогиДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналоги = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналоги = "";
					Иначе
						Аналоги = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналоги = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналоги = Аналоги;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Цена = Формат(РезультатЗапроса.Цена, "ЧДЦ=0; ЧГ=0");
			
			СтепеньИзноса = РезультатЗапроса.Степень;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 831 420 42 48</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + РазмерыШин + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Availability>Под заказ</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Вес 	= Окр(РезультатЗапроса.Вес);
				Длина 	= Окр(РезультатЗапроса.Длина);
				Высота 	= Окр(РезультатЗапроса.Высота);
				Ширина 	= Окр(РезультатЗапроса.Ширина);
						
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 831 420 42 48</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + Размеры + "<br>
				|Вес " + Вес + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<WeightForDelivery>" + Вес + "</WeightForDelivery>
				|<LengthForDelivery>" + Длина + "</LengthForDelivery>
				|<HeightForDelivery>" + Высота + "</HeightForDelivery>
				|<WidthForDelivery>" + Ширина + "</WidthForDelivery>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в сборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>Под заказ</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 02.09.2024
	
КонецФункции

#КонецОбласти

#Область АвитоЧасть2

Процедура АвтозагрузкаАвитоЧасть2() Экспорт
	
	///+ГомзМА 02.09.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоЧасть2();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	
	//+++ Убрать дубли по индкодам +++
	ПоискДублей = ДеталиТЗ.Скопировать(, "индкод, КолвоДублей");
	ПоискДублей.Свернуть("индкод", "КолвоДублей");
	
	Дубли = ПоискДублей.НайтиСтроки(Новый Структура("КолвоДублей", 2)); 
	Если Дубли <> Неопределено Тогда  
		Для каждого Дубль Из Дубли Цикл
		НайденныйИндкод = Дубль.индкод;	
		СтрокиДляУдаления = ДеталиТЗ.НайтиСтроки(Новый Структура("индкод", НайденныйИндкод));
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДеталиТЗ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	КоличествоДеталей = ДеталиТЗ.Количество();
	//--- Убрать дубли по индкодам ---
	
	//+++ Добавляем модель, степень и город +++
	ДанныеДляАртикуловТЗ = ЗагрузитьДанныеИзExcel();
	
	ДеталиТЗ.Колонки.Добавить("МодельИзЭксель");
	ДеталиТЗ.Колонки.Добавить("Степень");
	ДеталиТЗ.Колонки.Добавить("Город");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "Артикул, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("Артикул", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("Артикул", СтрокаТЗ.Артикул);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		Индекс = 0;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			Индекс = Индекс + 1;
			Если Индекс > 97 Тогда
				Индекс = 1;	
			КонецЕсли;
			ПараметрыОтбораДанныеДляАртикуловТЗ = Новый Структура("Номер", Индекс);
			СтрокаДанныеДляАртикуловТЗ = ДанныеДляАртикуловТЗ.НайтиСтроки(ПараметрыОтбораДанныеДляАртикуловТЗ);
			НайденнаяСтрока.Город = СтрокаДанныеДляАртикуловТЗ[0].Город;
			НайденнаяСтрока.МодельИзЭксель = СтрокаДанныеДляАртикуловТЗ[0].МодельИзЭксель;
		КонецЦикла;
	КонецЦикла;
	//--- Добавляем модель, степень и город ---
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito_chast2\avito_chast2.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоЧасть2(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;

	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 02.09.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоЧасть2(ТЗРезультат)
	
	///+ГомзМА 02.09.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрЗаменить(СтрокаФото.xml, "</", "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/1.png""/>" + Символы.ПС + 
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/2.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/3.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/4.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/5.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/6.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/7.png""/>" + Символы.ПС +
																   "<Image url=""https://nextcloud.worktruck.ru/shared/Autoloads_MarketPlace/Dop.photoAvito/8.png""/>" + Символы.ПС +
																   "</"); 
				Прервать;  
			конецЕсли;
		КонецЦикла;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
						
			Аналоги = НайтиАналогиДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналоги = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналоги = "";
					Иначе
						Аналоги = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналоги = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналоги = Аналоги;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Цена = Формат(РезультатЗапроса.Цена * 1.1, "ЧДЦ=0; ЧГ=0");
			
			СтепеньИзноса = РезультатЗапроса.Степень;
			
			Если Адрес = "Нижний Новгород" Тогда
				Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000019") ИЛИ //АВИТО ЧАСТНИК
					 РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000002") Тогда //Нижний Новгород WorkTruck						
					ЗаменаТекстаДоставка = "</Ad>";
				Иначе
					ЗаменаТекстаДоставка = "<Delivery>" + Символы.ПС +
					"<Option>Выключена</Option>" + Символы.ПС +
					"</Delivery>" + Символы.ПС +
					"</Ad>";
				КонецЕсли;
			ИначеЕсли Адрес = "Екатеринбург" Тогда
				Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда //Екатеринбург					
					ЗаменаТекстаДоставка = "</Ad>";
				Иначе
					ЗаменаТекстаДоставка = "<Delivery>" + Символы.ПС +
					"<Option>Выключена</Option>" + Символы.ПС +
					"</Delivery>" + Символы.ПС +
					"</Ad>";
				КонецЕсли;
			ИначеЕсли Адрес = "Москва" Тогда
				Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда //Москва						
					ЗаменаТекстаДоставка = "</Ad>";
				Иначе
					ЗаменаТекстаДоставка = "<Delivery>" + Символы.ПС +
					"<Option>Выключена</Option>" + Символы.ПС +
					"</Delivery>" + Символы.ПС +
					"</Ad>";
				КонецЕсли;				
			Иначе
				ЗаменаТекстаДоставка = "<Delivery>" + Символы.ПС +
				"<Option>Выключена</Option>" + Символы.ПС +
				"</Delivery>" + Символы.ПС +
				"</Ad>";
			КонецЕсли;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + РазмерыШин + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Availability>Под заказ</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|" + ЗаменаТекстаДоставка;
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Вес 	= Окр(РезультатЗапроса.Вес);
				Длина 	= Окр(РезультатЗапроса.Длина);
				Высота 	= Окр(РезультатЗапроса.Высота);
				Ширина 	= Окр(РезультатЗапроса.Ширина);
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + Размеры + "<br>
				|Вес " + Вес + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<WeightForDelivery>" + Вес + "</WeightForDelivery>
				|<LengthForDelivery>" + Длина + "</LengthForDelivery>
				|<HeightForDelivery>" + Высота + "</HeightForDelivery>
				|<WidthForDelivery>" + Ширина + "</WidthForDelivery>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в сборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>Под заказ</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|" + ЗаменаТекстаДоставка;

			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 02.09.2024
	
КонецФункции

#КонецОбласти

#Область АвитоЧасть3

Процедура АвтозагрузкаАвитоЧасть3() Экспорт
	
	///+ГомзМА 02.09.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоЧасть3();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	
	//+++ Убрать дубли по индкодам +++
	ПоискДублей = ДеталиТЗ.Скопировать(, "индкод, КолвоДублей");
	ПоискДублей.Свернуть("индкод", "КолвоДублей");
	
	Дубли = ПоискДублей.НайтиСтроки(Новый Структура("КолвоДублей", 2)); 
	Если Дубли <> Неопределено Тогда  
		Для каждого Дубль Из Дубли Цикл
		НайденныйИндкод = Дубль.индкод;	
		СтрокиДляУдаления = ДеталиТЗ.НайтиСтроки(Новый Структура("индкод", НайденныйИндкод));
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДеталиТЗ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	КоличествоДеталей = ДеталиТЗ.Количество();
	//--- Убрать дубли по индкодам ---
	
	//+++ Добавляем модель, степень и город +++
	ДанныеДляАртикуловТЗ = ЗагрузитьДанныеИзExcel();
	
	ДеталиТЗ.Колонки.Добавить("МодельИзЭксель");
	ДеталиТЗ.Колонки.Добавить("Степень");
	ДеталиТЗ.Колонки.Добавить("Город");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "Артикул, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("Артикул", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("Артикул", СтрокаТЗ.Артикул);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		Индекс = 0;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			Индекс = Индекс + 1;
			Если Индекс > 97 Тогда
				Индекс = 1;	
			КонецЕсли;
			ПараметрыОтбораДанныеДляАртикуловТЗ = Новый Структура("Номер", Индекс);
			СтрокаДанныеДляАртикуловТЗ = ДанныеДляАртикуловТЗ.НайтиСтроки(ПараметрыОтбораДанныеДляАртикуловТЗ);
			НайденнаяСтрока.Город = СтрокаДанныеДляАртикуловТЗ[0].Город;
			НайденнаяСтрока.МодельИзЭксель = СтрокаДанныеДляАртикуловТЗ[0].МодельИзЭксель;
		КонецЦикла;
	КонецЦикла;
	//--- Добавляем модель, степень и город ---
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito_chast3\avito_chast3.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоЧасть3(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 02.09.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоЧасть3(ТЗРезультат)
	
	///+ГомзМА 02.09.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml;
				Прервать;  
			конецЕсли;
		КонецЦикла;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
						
			Аналоги = НайтиАналогиДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналоги = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналоги = "";
					Иначе
						Аналоги = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналоги = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналоги = Аналоги;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Цена = Формат(РезультатЗапроса.Цена * 1.1, "ЧДЦ=0; ЧГ=0");
			
			СтепеньИзноса = РезультатЗапроса.Степень;
						
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 953 554 29 93</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + РазмерыШин + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа (для Авито) " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Availability>Под заказ</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Вес 	= Окр(РезультатЗапроса.Вес);
				Длина 	= Окр(РезультатЗапроса.Длина);
				Высота 	= Окр(РезультатЗапроса.Высота);
				Ширина 	= Окр(РезультатЗапроса.Ширина);
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 953 554 29 93</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + Размеры + "<br>
				|Вес " + Вес + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа (для Авито) " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<WeightForDelivery>" + Вес + "</WeightForDelivery>
				|<LengthForDelivery>" + Длина + "</LengthForDelivery>
				|<HeightForDelivery>" + Высота + "</HeightForDelivery>
				|<WidthForDelivery>" + Ширина + "</WidthForDelivery>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в сборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>В наличии</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";

			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 02.09.2024
	
КонецФункции

#КонецОбласти

#Область АвитоНН

Процедура АвтозагрузкаАвитоНН() Экспорт
	
	///+ГомзМА 02.09.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоНН();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000019")); //АВИТО ЧАСТНИК
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000002")); //Нижний Новгород WorkTruck
	
	Запрос.УстановитьПараметр("Стеллаж", 			Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 			МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", 			Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL 
	Запрос.УстановитьПараметр("Склад", 				МассивСкладов);
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	
	//+++ Убрать дубли по индкодам +++
	ПоискДублей = ДеталиТЗ.Скопировать(, "индкод, КолвоДублей");
	ПоискДублей.Свернуть("индкод", "КолвоДублей");
	
	Дубли = ПоискДублей.НайтиСтроки(Новый Структура("КолвоДублей", 2)); 
	Если Дубли <> Неопределено Тогда  
		Для каждого Дубль Из Дубли Цикл
		НайденныйИндкод = Дубль.индкод;	
		СтрокиДляУдаления = ДеталиТЗ.НайтиСтроки(Новый Структура("индкод", НайденныйИндкод));
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДеталиТЗ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	КоличествоДеталей = ДеталиТЗ.Количество();
	//--- Убрать дубли по индкодам ---
	
	//+++ Добавляем модель, степень и город +++
	ДанныеДляАртикуловТЗ = ЗагрузитьДанныеИзExcel();
	
	ДеталиТЗ.Колонки.Добавить("МодельИзЭксель");
	ДеталиТЗ.Колонки.Добавить("Степень");
	ДеталиТЗ.Колонки.Добавить("Город");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "Артикул, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("Артикул", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("Артикул", СтрокаТЗ.Артикул);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		Индекс = 0;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			Индекс = Индекс + 1;
			Если Индекс > 97 Тогда
				Индекс = 1;	
			КонецЕсли;
			ПараметрыОтбораДанныеДляАртикуловТЗ = Новый Структура("Номер", Индекс);
			СтрокаДанныеДляАртикуловТЗ = ДанныеДляАртикуловТЗ.НайтиСтроки(ПараметрыОтбораДанныеДляАртикуловТЗ);
			НайденнаяСтрока.Город = СтрокаДанныеДляАртикуловТЗ[0].Город;
			НайденнаяСтрока.МодельИзЭксель = СтрокаДанныеДляАртикуловТЗ[0].МодельИзЭксель;
		КонецЦикла;
	КонецЦикла;
	//--- Добавляем модель, степень и город ---
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avitoNN\avitoNN.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоНН(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 02.09.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоНН(ТЗРезультат)
	
	///+ГомзМА 02.09.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml;
				Прервать;  
			конецЕсли;
		КонецЦикла;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
						
			Аналоги = НайтиАналогиДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналоги = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналоги = "";
					Иначе
						Аналоги = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналоги = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналоги = Аналоги;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Цена = Формат(РезультатЗапроса.Цена * 1.1, "ЧДЦ=0; ЧГ=0");
			
			СтепеньИзноса = РезультатЗапроса.Степень;
						
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 953 554 29 93</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + РазмерыШин + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа (для Авито) " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Availability>Под заказ</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Вес 	= Окр(РезультатЗапроса.Вес);
				Длина 	= Окр(РезультатЗапроса.Длина);
				Высота 	= Окр(РезультатЗапроса.Высота);
				Ширина 	= Окр(РезультатЗапроса.Ширина);
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 953 554 29 93</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + Размеры + "<br>
				|Вес " + Вес + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа (для Авито) " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<WeightForDelivery>" + Вес + "</WeightForDelivery>
				|<LengthForDelivery>" + Длина + "</LengthForDelivery>
				|<HeightForDelivery>" + Высота + "</HeightForDelivery>
				|<WidthForDelivery>" + Ширина + "</WidthForDelivery>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в сборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>В наличии</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";

			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 02.09.2024
	
КонецФункции

#КонецОбласти

#Область АвитоМСК

Процедура АвтозагрузкаАвитоМСК() Экспорт
	
	///+ГомзМА 02.09.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоМСК();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000005")); //Москва
	
	Запрос.УстановитьПараметр("Стеллаж", 			Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 			МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", 			Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL 
	Запрос.УстановитьПараметр("Склад", 				МассивСкладов);
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	
	//+++ Убрать дубли по индкодам +++
	ПоискДублей = ДеталиТЗ.Скопировать(, "индкод, КолвоДублей");
	ПоискДублей.Свернуть("индкод", "КолвоДублей");
	
	Дубли = ПоискДублей.НайтиСтроки(Новый Структура("КолвоДублей", 2)); 
	Если Дубли <> Неопределено Тогда  
		Для каждого Дубль Из Дубли Цикл
		НайденныйИндкод = Дубль.индкод;	
		СтрокиДляУдаления = ДеталиТЗ.НайтиСтроки(Новый Структура("индкод", НайденныйИндкод));
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДеталиТЗ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	КоличествоДеталей = ДеталиТЗ.Количество();
	//--- Убрать дубли по индкодам ---
	
	//+++ Добавляем модель, степень и город +++
	ДанныеДляАртикуловТЗ = ЗагрузитьДанныеИзExcel();
	
	ДеталиТЗ.Колонки.Добавить("МодельИзЭксель");
	ДеталиТЗ.Колонки.Добавить("Степень");
	ДеталиТЗ.Колонки.Добавить("Город");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "Артикул, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("Артикул", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("Артикул", СтрокаТЗ.Артикул);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		Индекс = 0;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			Индекс = Индекс + 1;
			Если Индекс > 97 Тогда
				Индекс = 1;	
			КонецЕсли;
			ПараметрыОтбораДанныеДляАртикуловТЗ = Новый Структура("Номер", Индекс);
			СтрокаДанныеДляАртикуловТЗ = ДанныеДляАртикуловТЗ.НайтиСтроки(ПараметрыОтбораДанныеДляАртикуловТЗ);
			НайденнаяСтрока.Город = СтрокаДанныеДляАртикуловТЗ[0].Город;
			НайденнаяСтрока.МодельИзЭксель = СтрокаДанныеДляАртикуловТЗ[0].МодельИзЭксель;
		КонецЦикла;
	КонецЦикла;
	//--- Добавляем модель, степень и город ---
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avitoMSK\avitoMSK.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоМСК(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 02.09.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоМСК(ТЗРезультат)
	
	///+ГомзМА 02.09.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml;
				Прервать;  
			конецЕсли;
		КонецЦикла;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
						
			Аналоги = НайтиАналогиДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналоги = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналоги = "";
					Иначе
						Аналоги = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналоги = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналоги = Аналоги;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Цена = Формат(РезультатЗапроса.Цена * 1.1, "ЧДЦ=0; ЧГ=0");
			
			СтепеньИзноса = РезультатЗапроса.Степень;
						
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 953 554 29 93</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + РазмерыШин + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа (для Авито) " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Availability>Под заказ</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Вес 	= Окр(РезультатЗапроса.Вес);
				Длина 	= Окр(РезультатЗапроса.Длина);
				Высота 	= Окр(РезультатЗапроса.Высота);
				Ширина 	= Окр(РезультатЗапроса.Ширина);
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 953 554 29 93</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + Размеры + "<br>
				|Вес " + Вес + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа (для Авито) " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<WeightForDelivery>" + Вес + "</WeightForDelivery>
				|<LengthForDelivery>" + Длина + "</LengthForDelivery>
				|<HeightForDelivery>" + Высота + "</HeightForDelivery>
				|<WidthForDelivery>" + Ширина + "</WidthForDelivery>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в сборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>В наличии</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";

			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 02.09.2024
	
КонецФункции

#КонецОбласти

#Область АвитоЕКБ

Процедура АвтозагрузкаАвитоЕКБ() Экспорт
	
	///+ГомзМА 02.09.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоЕКБ();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000008")); //Екатеринбург
	
	Запрос.УстановитьПараметр("Стеллаж", 			Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 			МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", 			Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL 
	Запрос.УстановитьПараметр("Склад", 				МассивСкладов);
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	
	//+++ Убрать дубли по индкодам +++
	ПоискДублей = ДеталиТЗ.Скопировать(, "индкод, КолвоДублей");
	ПоискДублей.Свернуть("индкод", "КолвоДублей");
	
	Дубли = ПоискДублей.НайтиСтроки(Новый Структура("КолвоДублей", 2)); 
	Если Дубли <> Неопределено Тогда  
		Для каждого Дубль Из Дубли Цикл
		НайденныйИндкод = Дубль.индкод;	
		СтрокиДляУдаления = ДеталиТЗ.НайтиСтроки(Новый Структура("индкод", НайденныйИндкод));
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДеталиТЗ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	КоличествоДеталей = ДеталиТЗ.Количество();
	//--- Убрать дубли по индкодам ---
	
	//+++ Добавляем модель, степень и город +++
	ДанныеДляАртикуловТЗ = ЗагрузитьДанныеИзExcel();
	
	ДеталиТЗ.Колонки.Добавить("МодельИзЭксель");
	ДеталиТЗ.Колонки.Добавить("Степень");
	ДеталиТЗ.Колонки.Добавить("Город");
	ДеталиТЗ.Колонки.Добавить("ВременнаяПустая");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "Артикул, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("Артикул", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("Артикул", СтрокаТЗ.Артикул);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		Индекс = 0;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			Индекс = Индекс + 1;
			Если Индекс > 97 Тогда
				Индекс = 1;	
			КонецЕсли;
			ПараметрыОтбораДанныеДляАртикуловТЗ = Новый Структура("Номер", Индекс);
			СтрокаДанныеДляАртикуловТЗ = ДанныеДляАртикуловТЗ.НайтиСтроки(ПараметрыОтбораДанныеДляАртикуловТЗ);
			НайденнаяСтрока.Город = СтрокаДанныеДляАртикуловТЗ[0].Город;
			НайденнаяСтрока.МодельИзЭксель = СтрокаДанныеДляАртикуловТЗ[0].МодельИзЭксель;
		КонецЦикла;
	КонецЦикла;
	//--- Добавляем модель, степень и город ---
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avitoEKB\avitoEKB.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоЕКБ(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 02.09.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоЕКБ(ТЗРезультат)
	
	///+ГомзМА 02.09.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml;
				Прервать;  
			конецЕсли;
		КонецЦикла;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель, 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA " + РезультатЗапроса.МодельИзЭксель) > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
						
			Аналоги = НайтиАналогиДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналоги = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналоги = "";
					Иначе
						Аналоги = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналоги = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналоги = Аналоги;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Цена = Формат(РезультатЗапроса.Цена * 1.1, "ЧДЦ=0; ЧГ=0");
			
			СтепеньИзноса = РезультатЗапроса.Степень;
						
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 953 554 29 93</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + РазмерыШин + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа (для Авито) " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Availability>Под заказ</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Вес 	= Окр(РезультатЗапроса.Вес);
				Длина 	= Окр(РезультатЗапроса.Длина);
				Высота 	= Окр(РезультатЗапроса.Высота);
				Ширина 	= Окр(РезультатЗапроса.Ширина);
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 953 554 29 93</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + " оригинал scania скания</p> 
				|<p>️&#128222;Звоните пока в наличии, цена актуальна!<br>
				|&#9993;Свяжитесь с нами, если у вас остались вопросы.<br>
				|&#128150;Рекомендуем добавить в избранное, что бы не потерять.</p>  
				|<p>️Состояние " + Состояние + "<br>
				|Размеры " + Размеры + "<br>
				|Вес " + Вес + "<br>
				|Цена " + Цена + "</p> 
				|<p>️&#128736;Все запчасти привезены из Европы и обладают отличным остаточным ресурсом!</p>
				|<p>️Степень износа (для Авито) " + СтепеньИзноса + "</p>
				|<p>️Запчасть Scania снята с " + РезультатЗапроса.МодельИзЭксель + "</p>
				|<p>️Подходит для:<br>
				|Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.<br>
				|Scania R, Scania P, Scania G, Scania S. Scania 5 series и Scania 6 series.</p>
				|<p>️Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Внутренний Артикул: " + РезультатЗАпроса.индкод + "<br>
				|Номер аналога: " + Аналоги + "</p>
				|<p>️Оплата возможна как с НДС, так и без НДС</p>
				|<p>️Доставка удобной для вас ТС</p>
				|<p>️&#9854;Работаем без выходных! Оригинальные Запчасти для Scania с Гарантией!</p>
				|<p>️&#10067;Почему стоит доверять именно нам?</p>
				|<p>️&#129534;Документы и гарантия.<br>
				|На все запчасти и агрегаты предоставляем документы, включая таможенные, и даем гарантию.</p>
				|<p>️&#127980;Широкая сеть складов и филиалов.<br>
				|Собственные склады и филиалы в нескольких городах, что позволяет быстро обрабатывать заказы и отправлять запчасти в любую точку.</p>
				|<p>️&#129489;&#128295;Квалифицированные специалисты.<br>
				|В нашей команде более 100 специалистов, которые обладают глубокими знаниями и опытом работы с грузовиками Scania. Мы знаем все нюансы и особенности этих автомобилей.</p>
				|<p>️Наши преимущества:<br>
				|&#9989;Качество Запчастей:<br>
				|Мы предлагаем оригинальные б/у детали для грузовиков Scania 5 и 6 серии с большим остаточным ресурсом. Все запчасти проходят три уровня контроля качества: при приёмке и разборе тягача, при учёте и отправке на хранение, перед отправкой покупателю.</p>
				|<p>️&#9989;Установка Запчастей:<br>
				|Наши мастера, с опытом более 10 лет, установят купленные у нас запчасти, следуя официальным нормативам Scania. Даже если у нас нет места на ремзоне, мы порекомендуем проверенный сервисный центр.</p>
				|<p>️&#9989;Быстрая Отправка и Удобная Оплата:<br>
				|Отправляем детали в день оплаты через любые транспортные компании. Самовывоз доступен в Нижнем Новгороде, Москве и Екатеринбурге. Работаем со всеми способами оплаты: безналичный расчет с НДС и без НДС, наличные, перевод на карту.</p>
				|<p>️&#9989;Ассортимент Запчастей:<br>
				|В наличии более 14,000 оригинальных б/у запчастей и 2,000 новых деталей для Scania 5 и 6 серии. Также под заказ привезём редкие запчасти и машинокомплекты из Европы.</p>
				|<p>️&#9989;Специализация на Scania:<br>
				|Мы специализируемся на Scania более 10 лет, разбираем по 5-6 тягачей ежемесячно и восстанавливаем 2-3 машины. Наши мастера знают все «болячки» модификаций Scania и обеспечивают точный подбор и установку запчастей.</p>
				|<p>️&#9989;Точный Подбор:<br>
				|Наши менеджеры подберут запчасть, идеально подходящую для вашего грузовика, учитывая все нюансы модификаций и года выпуска.</p>
				|<p>️&#9989;Надежность:<br>
				|Мы поставляем оригинальные б/у запчасти для Scania из Европы более 10 лет. Наша надёжность подтверждена тысячами довольных клиентов, включая официальных дилеров Scania.</p>
				|<p>️&#9989;Гарантия и Возврат:<br>
				|Гарантия 30 дней на двигатель и КПП, 14 дней на остальные детали и агрегаты. Возможность возврата в течение 14 дней после получения.</p>				
				|<p>️&#9989;Персональные Условия для Постоянных Клиентов:<br>
				|Предлагаем кешбэк за приведённого друга, скидки 10 числа каждого месяца и особые предложения для постоянных клиентов.</p>
				|<p>️Запчасти Scania и качественное восстановление тягачей. Оставьте заявку, и наши менеджеры помогут вам!</p]]></Description>
				|<Price>" + Цена + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw</VideoURL>
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<WeightForDelivery>" + Вес + "</WeightForDelivery>
				|<LengthForDelivery>" + Длина + "</LengthForDelivery>
				|<HeightForDelivery>" + Высота + "</HeightForDelivery>
				|<WidthForDelivery>" + Ширина + "</WidthForDelivery>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в сборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>В наличии</Availability>
				|<PriceWithVAT>Нет</PriceWithVAT>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";

			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 02.09.2024
	
КонецФункции

#КонецОбласти

#Область Озон

Процедура АвтозагрузкаОзон()
	
	///+ТатарМА 09.09.2024	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляОзон();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000019")); //АВИТО ЧАСТНИК
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000002")); //Нижний Новгород WorkTruck
	
	Запрос.УстановитьПараметр("Стеллаж", 			Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 			МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", 			Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	Запрос.УстановитьПараметр("Склад", 				МассивСкладов);
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	
	//+++ Убрать дубли по индкодам +++
	ПоискДублей = ДеталиТЗ.Скопировать(, "индкод, КолвоДублей");
	ПоискДублей.Свернуть("индкод", "КолвоДублей");
	
	Дубли = ПоискДублей.НайтиСтроки(Новый Структура("КолвоДублей", 2)); 
	Если Дубли <> Неопределено Тогда  
		Для каждого Дубль Из Дубли Цикл
		НайденныйИндкод = Дубль.индкод;	
		СтрокиДляУдаления = ДеталиТЗ.НайтиСтроки(Новый Структура("индкод", НайденныйИндкод));
			Для каждого СтрокаДляУдаления Из СтрокиДляУдаления Цикл
				ДеталиТЗ.Удалить(СтрокаДляУдаления);
			КонецЦикла;
		КонецЦикла;	
	КонецЕсли;
	КоличествоДеталей = ДеталиТЗ.Количество();
	//--- Убрать дубли по индкодам ---
	
	//Подключение к Excel
	Excel = Новый COMОбъект("Excel.Application"); 
	
	Excel.DisplayAlerts = 0;
	Excel.Visible = 0;
	
	//Открытие существующей книги
	ПутьКФайлу = "\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_ozon\ozon.xlsx";
	Книга = Excel.Workbooks.Open(ПутьКФайлу);
	
	//Получаем первый лист
	Лист = Книга.Worksheets("Шаблон");
	
	//Очистить ячейки
	ПоследняяСтрока = Лист.Cells(Лист.Rows.Count, 4).End(-4162).Row;
	//Диапазон = Лист.Range("A4:AN" + Строка(Формат(ПоследняяСтрока, "ЧГ=")));
	Диапазон = Лист.Range("A4:AN" + Строка(ПоследняяСтрока + 1));
	Диапазон.ClearContents();
	
	//Заполняем строки
	КонечныйНомер = КоличествоДеталей;
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ВыгрузитьДанныеНаСервереОзон(ЧастьДеталей, Лист);
	КонецЦикла;
		
	//Сохраняем книгу
	Попытка
		//Книга.SaveCopyAs(ПутьКФайлу);
		Книга.SaveAs(ПутьКФайлу);
		//Закрываем Excel
		Excel.Workbooks.Close();
		Excel.Application.Quit();
	Исключение
		//Закрываем Excel
		Excel.Workbooks.Close();
		Excel.Application.Quit();
	КонецПопытки;
	///-ТатарМА 09.09.2024	
		
КонецПроцедуры


Процедура ВыгрузитьДанныеНаСервереОзон(ТЗРезультат, Лист)
	
	///+ТатарМА 09.09.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	
	Фотки = ПолучитьФото(МассивИндкодов);
	Итер = 0;
		
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденныеФото = Фотки[Итер].xml;
			ГлавноеФото = Сред(НайденныеФото, 22);
			КонечныйСимвол = СтрНайти(ГлавноеФото, ">");
			ГлавноеФото = Лев(ГлавноеФото, КонечныйСимвол - 3);
			
			ДопФото = СтрЗаменить(НайденныеФото, ГлавноеФото, "");
			ДопФото = СтрЗаменить(ДопФото, "<Images>" + Символы.ПС, "");
			ДопФото = СтрЗаменить(ДопФото, Символы.ПС + "</Images>", "");
			ДопФото = СтрЗаменить(ДопФото, "<Image url=""""/>" + Символы.ПС, ""); 
			ДопФото = СтрЗаменить(ДопФото, "<Image url=""", "");
			ДопФото = СтрЗаменить(ДопФото, """/>", ""); 
			//Производитель = Строка(РезультатЗапроса.Производитель);
			//Производитель = СтрЗаменить(Производитель, "&", " ");
			
			Товар = Строка(РезультатЗапроса.Товар);
			Товар = СтрЗаменить(Товар, "&", " ");
			
			Строка = РезультатЗапроса.НомерЗаписи + 3;
			
			Лист.Cells(Строка, 2).Value   = Строка(РезультатЗапроса.Индкод);
			Лист.Cells(Строка, 3).Value   = Строка(Товар);
			Лист.Cells(Строка, 4).Value   = РезультатЗапроса.Цена;
			Лист.Cells(Строка, 6).Value   = "Не облагается";
			Лист.Cells(Строка, 9).Value   = РезультатЗапроса.Вес;
			Лист.Cells(Строка, 10).Value  = РезультатЗапроса.Ширина;
			Лист.Cells(Строка, 11).Value  = РезультатЗапроса.Высота;
			Лист.Cells(Строка, 12).Value  = РезультатЗапроса.Длина;
			Лист.Cells(Строка, 13).Value  = ГлавноеФото;
			Лист.Cells(Строка, 14).Value  = ДопФото;
			Лист.Cells(Строка, 17).Value  = Строка(РезультатЗапроса.Бренд);
			Лист.Cells(Строка, 18).Value  = Строка(РезультатЗапроса.Модель);
			Лист.Cells(Строка, 19).Value  = Строка(РезультатЗапроса.НомерПроизводителя);
			//Лист.Cells(Строка, 20).Value  = ;
			Лист.Cells(Строка, 26).Value  = РезультатЗапроса.КолвоОстаток;
			//Лист.Cells(Строка, 12).Value = ""; //"Ссылка на деталь на сайте";
			//Лист.Cells(Строка, 13).Value = НайденноеФото;
			//Лист.Cells(Строка, 14).Value = ""; //"Ссылка на фото детали на сайте";
			
			Итер = Итер +1;
		КонецЦикла;
	КонецЕсли;
	///-ТатарМА 09.09.2024
	
КонецПроцедуры

#КонецОбласти

#Область Т



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьФото(ИндКод)
	
	///+ГомзМА 15.02.2024
	Соединение = Новый HTTPСоединение("192.168.0.245", 8085);
	СтрокаЗапроса = "/v1/images/avito/xml"; 
	
	Заголовки = Новый Соответствие;    
	Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	
	ЗапросСтруктура = Новый Структура;
	ЗапросСтруктура.Вставить("indCode", ИндКод); 
	
	ПотокJSON = Новый ЗаписьJSON(); 
	ПотокJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ПотокJSON, ЗапросСтруктура);
	СтрокаJSON = ПотокJSON.Закрыть();
	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Тело = Ответ.ПолучитьТелоКакСтроку();  
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Тело); 
		Ответ  = ПрочитатьJSON(ЧтениеJSON); 
	Иначе Сообщить("Код ответа: " + Ответ.КодСостояния); //анализируем код состояния и делаем выводы 
		Ответ = Неопределено;
	КонецЕсли;
	
	Возврат Ответ;
	///-ГомзМА 15.02.2024
	
КонецФункции

Функция НайтиАналогДетали(Товар)
	
	///+ГомзМА 15.02.2024
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураНомераЗамен.НомерЗамены КАК НомерЗамены
	|ИЗ
	|	Справочник.Номенклатура.НомераЗамен КАК НоменклатураНомераЗамен
	|ГДЕ
	|	НоменклатураНомераЗамен.Ссылка.Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		РезультатЗапроса.Следующий();
		Результат = РезультатЗапроса.НомерЗамены;
	КонецЕсли;
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции // НайтиАналогДетали()

Функция ПолучитьАналогиТовара(Товар)
	
	///+ГомзМА 14.05.2024
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураНомераЗамен.НомерЗамены КАК НомерЗамены
	|ИЗ
	|	Справочник.Номенклатура.НомераЗамен КАК НоменклатураНомераЗамен
	|ГДЕ
	|	НоменклатураНомераЗамен.Ссылка.Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Пока РезультатЗапроса.Следующий() Цикл
			Результат = Результат + РезультатЗапроса.НомерЗамены + "/";
		КонецЦикла;
		ДлинаСтроки = СтрДлина(Результат);
		Результат = Строка(Лев(Результат, ДлинаСтроки - 1));
	КонецЕсли;
	
	Возврат Результат;
	///-ГомзМА 14.05.2024
	
КонецФункции // НайтиАналогДетали()

Функция НайтиАналогиДетали(Товар)
	
	///+ГомзМА 02.09.2024
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	НоменклатураНомераЗамен.НомерЗамены КАК НомерЗамены
	|ИЗ
	|	Справочник.Номенклатура.НомераЗамен КАК НоменклатураНомераЗамен
	|ГДЕ
	|	НоменклатураНомераЗамен.Ссылка.Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Результат = "";
		Пока РезультатЗапроса.Следующий() Цикл
			Результат = Результат + Строка(РезультатЗапроса.НомерЗамены) + Символы.ПС;
		КонецЦикла;
	КонецЕсли;
	
	Возврат Результат;
	///-ГомзМА 02.09.2024
	
КонецФункции // НайтиАналогиДетали()

Функция ЗагрузитьДанныеИзExcel()
	
	///+ГомзМА 02.09.2024
    // Путь к файлу Excel
    ИмяФайла = "\\192.168.0.245\shared_folder\Autoloads_MarketPlace\ДанныеДляАртикулов.xlsx";

    // Создаем таблицу значений
    ТаблицаЗначений = Новый ТаблицаЗначений;

    // Добавляем колонки в таблицу значений
    ТаблицаЗначений.Колонки.Добавить("Номер");
    ТаблицаЗначений.Колонки.Добавить("МодельИзЭксель");
    ТаблицаЗначений.Колонки.Добавить("Степень");
    ТаблицаЗначений.Колонки.Добавить("Город");

    // Создаем COM-объект для работы с Excel
    ExcelApp = Новый COMОбъект("Excel.Application");

    // Открываем файл Excel
    Книга = ExcelApp.Workbooks.Open(ИмяФайла);

    // Берем первый лист
    Лист = Книга.Worksheets(1);

    // Определяем количество строк
    КоличествоСтрок = Лист.UsedRange.Rows.Count;

    // Заполняем таблицу значений, начиная со второй строки (первая строка - заголовки)
    Для Строка = 2 По КоличествоСтрок Цикл
        НоваяСтрока = ТаблицаЗначений.Добавить();
        НоваяСтрока.Номер 			= Лист.Cells(Строка, 1).Value;
        НоваяСтрока.МодельИзЭксель 	= Лист.Cells(Строка, 2).Value;
        НоваяСтрока.Степень 		= Лист.Cells(Строка, 3).Value;
        НоваяСтрока.Город			= Лист.Cells(Строка, 4).Value;
    КонецЦикла;

    // Закрываем книгу Excel
    Книга.Close();

    // Освобождаем COM-объект
    ExcelApp.Quit();

    Возврат ТаблицаЗначений;
	///-ГомзМА 02.09.2024
	
КонецФункции

#КонецОбласти

#Область ЯндексМаркет


Функция ПолучитьТекстДляТоваровЯндексНН()

///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	            |	ИндНомер.индкод КАК индкод,
	            |	ИндНомер.индкод.Владелец КАК Товар,
	            |	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	            |	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	            |	ИндНомер.Состояние КАК Состояние,
	            |	ИндНомер.Цена КАК Цена,
	            |	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	            |	РегистрНакопления1Остатки.машина КАК машина,
	            |	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	            |	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	            |	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	            |	ИндНомер.индкод.Владелец.длин КАК Длина,
	            |	ИндНомер.индкод.Владелец.шир КАК Ширина,
	            |	ИндНомер.индкод.Владелец.выс КАК Высота,
	            |	ИндНомер.Комментарий КАК Комментарий,
	            |	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	            |	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	            |	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	            |	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	            |	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	            |	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	            |	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	            |	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	            |	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	            |	ИндНомер.Стеллаж.Владелец КАК Склад,
	            |	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	            |	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	            |	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	            |	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
	            |	ИндНомер.Стеллаж.ГруппаМестХранения КАК СтеллажГруппаМестХранения
	            |ПОМЕСТИТЬ ВТ_Данные
	            |ИЗ
	            |	РегистрСведений.ИндНомер КАК ИндНомер
	            |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	            |		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	            |ГДЕ
	            |	ИндНомер.АвитоЧастник
	            |	И РегистрНакопления1Остатки.КолвоОстаток > 0
	            |	И ИндНомер.Цена > 0
	            |	И ИндНомер.ЕстьФото = ИСТИНА
	            |	И ИндНомер.Стеллаж <> &Стеллаж
	            |	И ВЫБОР
	            |			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	            |				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	            |							ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка)
	            |							ИЛИ ИндНомер.индкод.Владелец.длин = 0
	            |							ИЛИ ИндНомер.индкод.Владелец.шир = 0
	            |							ИЛИ ИндНомер.индкод.Владелец.выс = 0
	            |							ИЛИ ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) = 0)
	            |			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	            |						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	            |						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	            |						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	            |		КОНЕЦ
	            |	И ИндНомер.Стеллаж.Владелец В(&Склад)
	            |	И ИндНомер.Поддон <> &Поддон
	            |	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
	            |;
	            |
	            |////////////////////////////////////////////////////////////////////////////////
	            |ВЫБРАТЬ
	            |	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	            |	ВТ_Данные.индкод КАК индкод,
	            |	ВТ_Данные.Товар КАК Товар,
	            |	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	            |	ВТ_Данные.Бренд КАК Бренд,
	            |	ВТ_Данные.Состояние КАК Состояние,
	            |	ВТ_Данные.Цена КАК Цена,
	            |	ВТ_Данные.Вес КАК Вес,
	            |	ВТ_Данные.машина КАК машина,
	            |	ВТ_Данные.Серия КАК Серия,
	            |	ВТ_Данные.Модель КАК Модель,
	            |	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	            |	ВТ_Данные.Длина КАК Длина,
	            |	ВТ_Данные.Ширина КАК Ширина,
	            |	ВТ_Данные.Высота КАК Высота,
	            |	ВТ_Данные.Комментарий КАК Комментарий,
	            |	ВТ_Данные.Категории КАК Категории,
	            |	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	            |	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	            |	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	            |	ВТ_Данные.ОсьШин КАК ОсьШин,
	            |	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	            |	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	            |	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	            |	ВТ_Данные.МодельШин КАК МодельШин,
	            |	ВТ_Данные.Склад КАК Склад,
	            |	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	            |	ВТ_Данные.Артикул КАК Артикул,
	            |	ВТ_Данные.индкодПредставление КАК индкодПредставление
	            |ИЗ
	            |	ВТ_Данные КАК ВТ_Данные
	            |
	            |УПОРЯДОЧИТЬ ПО
	            |	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024

КонецФункции // ТекстДляТоваров()



Функция ВыгрузитьДанныеТоваровНаСервереЯндексНН(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФотоДляЯндекс(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			Для каждого СтрокаФото ИЗ Фотки Цикл 
				Если  СтрокаФото.indCode = РезультатЗапроса.индкод.наименование Тогда 
				НайденныеФотки = СтрокаФото.xml; 
				Прервать;  
			конецЕсли;
		КонецЦикла; 
			
			//НайденныеФотки = Фотки[Итер].xml;
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "<Images>" + Символы.ПС, "");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, Символы.ПС + "</Images>", "");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "</Images>", "");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "<Image url=""", "<picture>");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, """/>", "</picture>");
			
			Итер = Итер +1;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
			Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
				НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
				Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
				ДлинаСтроки 		 = СтрДлина(Название);
				КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
				ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
				Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
					Название = Лев(Название, ДлинаСтроки - 1);
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Айдишник = СтрЗаменить(РезультатЗапроса.Индкод, " ", "");
			Айдишник = СтрЗаменить(Айдишник, Символы.НПП, "");
			Вес 	 = Формат(РезультатЗапроса.Вес,"ЧРД='.'");
			Вес      = Формат (Вес, "ЧГ="); 
			
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "" + Формат(РезультатЗапроса.ШиринаШин, "ЧГ=") + "/" + Формат(РезультатЗапроса.ВысотаШин, "ЧГ=") + "/" + Формат(РезультатЗапроса.ДиаметрШин, "ЧГ=");
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + "
				|<offer id=""" + Айдишник + """>
				|<name>" + РезультатЗапроса.Товар + "</name>
				|<vendor>" + Бренд + "</vendor>
				|<vendorCode>" + НомерПроизводителя + "</vendorCode>
				|<categoryId>2</categoryId>                
				| " + НайденныеФотки + "                 
				|<description>
				|<![CDATA[          
				|<p>" + РезультатЗапроса.Артикул + " " + РезультатЗапроса.Текст + " В наличии" + "</p>
				|]]>
				|</description>                               
				|<manufacturer_warranty>false</manufacturer_warranty>
				|<country_of_origin>Швеция</country_of_origin>
				|<weight>" + Вес + "</weight>
				|<dimensions>" + РазмерыШин + "</dimensions>      
				|<barcode>" + Айдишник + "</barcode>
				|</offer>";
				
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + Формат(РезультатЗапроса.Длина, "ЧГ=") + "/" + Формат(РезультатЗапроса.Ширина, "ЧГ=") + "/" + Формат(РезультатЗапроса.Высота, "ЧГ=");
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + "
				|<offer id=""" + Айдишник + """>
				|<name>" + РезультатЗапроса.Товар + "</name>
				|<vendor>" + Бренд + "</vendor>
				|<vendorCode>" + НомерПроизводителя + "</vendorCode>
				|<categoryId>2</categoryId>                
				|" + НайденныеФотки + "
				|<description>
				|<![CDATA[          
				|<p>" + РезультатЗапроса.Артикул + " " + РезультатЗапроса.Товар + " В наличии" + "</p>
				|]]>
				|</description>                               
				|<manufacturer_warranty>false</manufacturer_warranty>
				|<country_of_origin>Швеция</country_of_origin>
				|<weight>" + Формат(РезультатЗапроса.Вес, "ЧГ=") + "</weight>
				|<dimensions>" + Размеры + "</dimensions>    
				|<barcode>" + Айдишник + "</barcode>
				|</offer>";
				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 05.02.2023
	
КонецФункции


Функция ВыгрузитьДанныеУправленеТоварамиНаСервереЯндексНН(ТЗРезультат)
	
	///++ МазинЕС 25.06.2024
	
	ТекстФайла = "";
	
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл

			Айдишник = СтрЗаменить(РезультатЗапроса.Индкод, " ", "");
			Айдишник = СтрЗаменить(Айдишник, Символы.НПП, "");
			КолвоОстаток = 	РезультатЗапроса.КолвоОстаток;		
				ТекстФайла = ТекстФайла + "
				|<offer id=""" + Айдишник + """>
				|<url>https://worktruck.ru/</url>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.23, "ЧДЦ=0; ЧГ=0") + "</price>  
				|<currencyId>RUR</currencyId> 
				|<vat>NO_VAT</vat>  
				|<delivery>false</delivery>
                |<pickup>false</pickup>
				|<count>" + КолвоОстаток + "</count>
				|</offer>";
						
		КонецЦикла;		
	
	Возврат ТекстФайла;
	///--МазинЕС 25.06.2024
	
КонецФункции


Процедура АвтозагрузкаТоварыИУсловияРазмещенияЯндексНН() 

	///+ГомзМА 07.02.2024
	Сообщить("Время начала выполнения обработки: " + ТекущаяДатаСеанса());
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровЯндексНН();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000019")); //АВИТО ЧАСТНИК
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000002")); //Нижний Новгород WorkTruck
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	Сообщить("Всего " + КоличествоДеталей + " деталей");
	
	Если КоличествоДеталей > 70000 Тогда
		КонечныйНомер = 69000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	// Создание XML с товарами
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_yandexNN\tovary.xml ", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + 
	"<yml_catalog date=""" + Формат(ТекущаяДатаСеанса(),"ДФ=yyyy-MM-dd") + "T" + ?(Час(ТекущаяДатаСеанса()) 	< 10, "0" + Час(ТекущаяДатаСеанса()), 		Час(ТекущаяДатаСеанса())) + ":" + 
	 																			 ?(Минута(ТекущаяДатаСеанса()) 	< 10, "0" + Минута(ТекущаяДатаСеанса()), 	Минута(ТекущаяДатаСеанса())) + ":" +  
																				 ?(Секунда(ТекущаяДатаСеанса()) < 10, "0" + Секунда(ТекущаяДатаСеанса()), 	Секунда(ТекущаяДатаСеанса())) + 
																				 "+03:00" + """>" + Символы.ПС + 
	"<shop>" + Символы.ПС + 
	"<name>Ворктрак</name>" + Символы.ПС + 
	"<company>ООО ""Восстановление тягачей""</company>" + Символы.ПС + 
	"<url>https://worktruck.ru/</url>" + Символы.ПС + 
	"<platform>Spree Commerce</platform>" + Символы.ПС + 
	"<version>1.0</version>" + Символы.ПС +
	"<categories>" + Символы.ПС + 
    "<category id=""1"">Авто</category>" + Символы.ПС + 
    "<category id=""2"" parentId=""1"">Запчасти</category>" + Символы.ПС +  
    "</categories>" + Символы.ПС + 
	"<offers>");
	
	// Создание XML с условиями размещения
	
	ЗаписьXML2 = Новый ЗаписьXML;
	ЗаписьXML2.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_yandexNN\usloviyrazmesheniy.xml", "UTF-8");    /// НОВЫЙ ПУТЬ С НОВЫМ ИМЕНЕМ
	ЗаписьXML2.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + 
	"<yml_catalog date=""" + Формат(ТекущаяДатаСеанса(),"ДФ=yyyy-MM-dd") + "T" + ?(Час(ТекущаяДатаСеанса()) 	< 10, "0" + Час(ТекущаяДатаСеанса()), 		Час(ТекущаяДатаСеанса())) + ":" + 
	 																			 ?(Минута(ТекущаяДатаСеанса()) 	< 10, "0" + Минута(ТекущаяДатаСеанса()), 	Минута(ТекущаяДатаСеанса())) + ":" +  
																				 ?(Секунда(ТекущаяДатаСеанса()) < 10, "0" + Секунда(ТекущаяДатаСеанса()), 	Секунда(ТекущаяДатаСеанса())) + 
																				 "+03:00" + """>" + Символы.ПС + 
	"<shop>" + Символы.ПС + 
	"<name>Ворктрак</name>" + Символы.ПС + 
	"<company>ООО ""Восстановление тягачей""</company>" + Символы.ПС + 
	"<url>https://worktruck.ru/</url>" + Символы.ПС + 
	"<platform>Spree Commerce</platform>" + Символы.ПС +  
	"<version>1.0</version>" + Символы.ПС +	
    "<delivery-options>" + Символы.ПС +
    "<option cost=""123"" days=""10""/>" + Символы.ПС +
    "</delivery-options>" + Символы.ПС +
    "<pickup-options>" + Символы.ПС +
    "<option cost=""123"" days=""10""/>" + Символы.ПС +
    "</pickup-options>" + Символы.ПС +
	"<offers>");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
				
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеТоваровНаСервереЯндексНН(ЧастьДеталей);
		ТекстФайла2 = ВыгрузитьДанныеУправленеТоварамиНаСервереЯндексНН(ЧастьДеталей);

		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		ЗаписьXML2.ЗаписатьБезОбработки(ТекстФайла2);	
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки( Символы.ПС + "</offers>" + Символы.ПС + 
	"</shop>" + Символы.ПС + 
	"</yml_catalog>");
	
	Сообщить("Время окончания выполнения обработки: " + ТекущаяДатаСеанса());
	ЗаписьXML2.ЗаписатьБезОбработки( Символы.ПС + "</offers>" + Символы.ПС + 
	"</shop>" + Символы.ПС + 
	"</yml_catalog>");
	
	Сообщить("Время окончания выполнения обработки: " + ТекущаяДатаСеанса());
	
	// Удалить проданные товары
	НайтиПроданныеТовары(); 

КонецПроцедуры



Функция ПолучитьФотоДляЯндекс(ИндКод) 
	
	///+ГомзМА 13.10.2023
	Соединение = Новый HTTPСоединение("192.168.0.245", 8085);
	СтрокаЗапроса = "/v1/images/avito/xml"; 
	
	Заголовки = Новый Соответствие;    
	Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	
	ЗапросСтруктура = Новый Структура;
	ЗапросСтруктура.Вставить("indCode", ИндКод); 
	
	ПотокJSON = Новый ЗаписьJSON(); 
	ПотокJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ПотокJSON, ЗапросСтруктура);
	СтрокаJSON = ПотокJSON.Закрыть();
	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Тело = Ответ.ПолучитьТелоКакСтроку();  
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Тело); 
		Ответ  = ПрочитатьJSON(ЧтениеJSON); 
	Иначе Сообщить("Код ответа: " + Ответ.КодСостояния); //анализируем код состояния и делаем выводы 
		Ответ = Неопределено;
	КонецЕсли;
	
	Возврат Ответ;
	///-ГомзМА 13.10.2023
	
КонецФункции

Процедура НайтиПроданныеТовары()

	//список проданных товаров за текущую дату

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ИндНомер.индкод.представление КАК индкод,
		|	ИндНомер.индкод.Владелец КАК Товар,
		|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
		|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
		|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
		|	ИндНомер.индкод.Владелец.длин КАК Длина,
		|	ИндНомер.индкод.Владелец.шир КАК Ширина,
		|	ИндНомер.индкод.Владелец.выс КАК Высота,
		|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи,
		|	ИндНомер.Стеллаж.ГруппаМестХранения КАК СтеллажГруппаМестХранения,
		|	РегистрНакопления1ОстаткиИОбороты.машина КАК машина1
		|ПОМЕСТИТЬ ВТ_Данные
		|ИЗ
		|	РегистрСведений.ИндНомер КАК ИндНомер
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.ОстаткиИОбороты(&Начало, &Конец, , , ) КАК РегистрНакопления1ОстаткиИОбороты
		|		ПО ИндНомер.индкод = РегистрНакопления1ОстаткиИОбороты.индкод
		|ГДЕ
		|	ИндНомер.АвитоЧастник
		|	И ИндНомер.Цена > 0
		|	И ИндНомер.ЕстьФото = ИСТИНА
		|	И ИндНомер.Стеллаж <> &Стеллаж
		|	И НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
		|	И ВЫБОР
		|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
		|				ТОГДА НЕ(РегистрНакопления1ОстаткиИОбороты.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
		|							ИЛИ РегистрНакопления1ОстаткиИОбороты.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка)
		|							ИЛИ ИндНомер.индкод.Владелец.длин = 0
		|							ИЛИ ИндНомер.индкод.Владелец.шир = 0
		|							ИЛИ ИндНомер.индкод.Владелец.выс = 0
		|							ИЛИ ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) = 0)
		|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
		|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
		|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
		|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
		|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
		|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
		|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
		|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
		|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
		|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
		|		КОНЕЦ
		|	И ИндНомер.Стеллаж.Владелец В(&Склад)
		|	И ИндНомер.Поддон <> &Поддон
		|	И ИндНомер.Стеллаж.ГруппаМестХранения <> &ГруппаМестХранения
		|	И РегистрНакопления1ОстаткиИОбороты.КолвоРасход = 1
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
		|	ВТ_Данные.индкод КАК индкод
		|ИЗ
		|	ВТ_Данные КАК ВТ_Данные
		|
		|УПОРЯДОЧИТЬ ПО
		|	НомерЗаписи";
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000019")); //АВИТО ЧАСТНИК
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000002")); //Нижний Новгород WorkTruck
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	Запрос.УстановитьПараметр("ГруппаМестХранения", Справочники.ГруппыМестХранения.НайтиПоКоду("000000002")); //B-KOMPL
	
	Начало = НачалоДня(ТекущаяДата());
	Конец =  КонецДня(ТекущаяДата());
	Запрос.УстановитьПараметр("Начало", Начало); 
    Запрос.УстановитьПараметр("Конец", Конец);                                                    														 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать(); 
	Соответствие = новый Соответствие(); 
	
	Массив = Новый Массив () ; 
	Текст = ""; 
	ФлагУдаления = ЛОЖЬ; 
	Кол = ВыборкаДетальныеЗаписи.Количество(); 
	Текст = "Каличество удаленных запчастей = " + Кол; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ФлагУдаления = Истина;
		Массив.добавить(ВыборкаДетальныеЗаписи.индкод);
		Если Массив.Количество() = 199 Тогда 
			ЗапросУдалитьИзКаталогаПроданТовар(Массив); 
			 Массив.Очистить();
		ФлагУдаления = ЛОЖЬ; 	 
		КонецЕсли;  
	КонецЦикла;  
	
	Если ФлагУдаления Тогда 
		ЗапросУдалитьИзКаталогаПроданТовар(Массив);
	КонецЕсли; 
	Сообщить (Текст);
Конецпроцедуры


Функция ЗапросУдалитьИзКаталогаПроданТовар(МассивТоваров);    
	
	// 	https://api.partner.market.yandex.ru/businesses/50412376/offer-mappings/delete 
	//  "domain": "WorkTruck Запчасти Scania",
	// 	"business": "id": 50412376 
	
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL; 
	Соединение = Новый HTTPСоединение ("api.partner.market.yandex.ru",,,,,,ЗащищенноеСоединение);
	
	Токен = "y0_AgAAAAB3SCU2AAwVUwAAAAEKDPTBAAD_gkmQbPVBKJWWjd19zXNusuKvNA";
	ЗаголовокСтруктура = Новый Соответствие; 
	ЗаголовокСтруктура.Вставить("Authorization", "Bearer " + Токен); 
	ЗаголовокСтруктура.Вставить("Content-Type", "application/json");
	 
	СтруктураТела = Новый Соответствие; 
	СтруктураТела.Вставить("offerIds", МассивТоваров); 
	
	ЗаписьJSON =  Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(); 
	ЗаписатьJSON(ЗаписьJSON,СтруктураТела);
	СтрокаJSON = ЗаписьJSON.Закрыть(); 
	
	АдресРесурса  = "/businesses/50412376/offer-mappings/delete";  
	Запрос = Новый HTTPЗапрос(АдресРесурса, ЗаголовокСтруктура); 
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Попытка
		Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос); 
	Исключение 
		ответ = "Все фигня!!! Давай по новой. КодСостояния <> 200";
	Возврат ответ; 		
	КонецПопытки;
	
	Если ответ.КодСостояния = 200 Тогда
		ТелоОтвета = ответ.ПолучитьТелоКакСтроку();
		ЧтениеJSON = Новый ЧтениеJSON; 
		ЧтениеJSON.УстановитьСтроку(ТелоОтвета);
		Данные = ПрочитатьJSON(ЧтениеJSON,Истина);
	КонецЕсли;    
	  
КонецФункции

Процедура АвтовыгрузкаЯндексМаркет() Экспорт
	АвтозагрузкаТоварыИУсловияРазмещенияЯндексНН();
	
КонецПроцедуры
 


#КонецОбласти