
#Область ТекстЗапроса

Функция ПолучитьТекстДляТоваровАвитоЧастник()
	
	///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|							ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И ИндНомер.Поддон <> &Поддон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции

Функция ПолучитьТекстДляТоваровАвитоМенее19кг()
	
	///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 9
	|	И ИндНомер.Цена < 150000
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|				ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|	И ИндНомер.индкод.Владелец.Вес <> 0
	|	И ИндНомер.индкод.Владелец.длин <> 0
	|	И ИндНомер.индкод.Владелец.шир <> 0
	|	И ИндНомер.индкод.Владелец.выс <> 0
	|	И ИндНомер.индкод.Владелец.Вес < 19
	|	И ИндНомер.индкод.Владелец.длин < 120
	|	И ИндНомер.индкод.Владелец.шир < 80
	|	И ИндНомер.индкод.Владелец.выс < 50
	|	И ИндНомер.Поддон <> &Поддон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ 
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции 

Функция ПолучитьТекстДляТоваровАвитоБолее19кг()
	
	///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|							ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И (ИндНомер.Цена > 149999 ИЛИ (ИндНомер.индкод.Владелец.Вес >= 19
	|	ИЛИ ИндНомер.индкод.Владелец.длин >= 120
	|	ИЛИ ИндНомер.индкод.Владелец.шир >= 80
	|	ИЛИ ИндНомер.индкод.Владелец.выс >= 50
	|	ИЛИ ИндНомер.индкод.Владелец.Вес = 0
	|	ИЛИ ИндНомер.индкод.Владелец.длин = 0
	|	ИЛИ ИндНомер.индкод.Владелец.шир = 0
	|	ИЛИ ИндНомер.индкод.Владелец.выс = 0))
	|	И ИндНомер.Поддон <> &Поддон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции

Функция ПолучитьТекстДляТоваровДром()

	///+ГомзМА 15.02.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|			КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|				ТОГДА НЕ(РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|							ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|			ИНАЧЕ НЕ(ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|						ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|						ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|		КОНЕЦ
	|	И ИндНомер.Стеллаж.Владелец В (&Склад)
	|	И ИндНомер.Поддон <> &Поддон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции 

Функция ПолучитьТекстДляИззап()

	///+ГомзМА 14.05.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.индкод.Владелец.Производитель КАК Производитель,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|		КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|			ТОГДА НЕ (РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|			ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|		ИНАЧЕ
	|		НЕ (ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ
	|	И ИндНомер.Поддон <> &Поддон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Производитель КАК Производитель,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 14.05.2024

КонецФункции

Функция ПолучитьТекстДляЗзап()

	///+ГомзМА 16.05.2024
	Результат = "ВЫБРАТЬ
	|	ИндНомер.индкод КАК индкод,
	|	ИндНомер.индкод.Владелец КАК Товар,
	|	ИндНомер.индкод.Владелец.НомерПроизводителя КАК НомерПроизводителя,
	|	ИндНомер.индкод.Владелец.Бренд КАК Бренд,
	|	ИндНомер.индкод.Владелец.Производитель КАК Производитель,
	|	ИндНомер.Состояние КАК Состояние,
	|	ИндНомер.Цена КАК Цена,
	|	ЕСТЬNULL(ИндНомер.индкод.Владелец.Вес, 0) КАК Вес,
	|	РегистрНакопления1Остатки.машина КАК машина,
	|	РегистрНакопления1Остатки.машина.Серия КАК Серия,
	|	РегистрНакопления1Остатки.машина.Модель КАК Модель,
	|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
	|	ИндНомер.индкод.Владелец.длин КАК Длина,
	|	ИндНомер.индкод.Владелец.шир КАК Ширина,
	|	ИндНомер.индкод.Владелец.выс КАК Высота,
	|	ИндНомер.Комментарий КАК Комментарий,
	|	ИндНомер.индкод.Владелец.Подкатегория2 КАК Категории,
	|	ИндНомер.индкод.Владелец.ШиринаШин КАК ШиринаШин,
	|	ИндНомер.индкод.Владелец.ВысотаШин КАК ВысотаШин,
	|	ИндНомер.индкод.Владелец.ДиаметрШин КАК ДиаметрШин,
	|	ИндНомер.индкод.Владелец.ОсьШин КАК ОсьШин,
	|	ИндНомер.индкод.Владелец.СезонностьШин КАК СезонностьШин,
	|	ИндНомер.индкод.Владелец.ИндексСкорости КАК ИндексСкорости,
	|	ИндНомер.индкод.Владелец.ИндексНагрузки КАК ИндексНагрузки,
	|	ИндНомер.индкод.Владелец.МодельШин КАК МодельШин,
	|	ИндНомер.Стеллаж.Владелец КАК Склад,
	|	ИндНомер.индкод.Наименование КАК ИндкодНаименование,
	|	ИндНомер.индкод.Владелец.Артикул КАК Артикул,
	|	ПРЕДСТАВЛЕНИЕ(ИндНомер.индкод) КАК индкодПредставление,
	|	АВТОНОМЕРЗАПИСИ() КАК НомерЗаписи
	|ПОМЕСТИТЬ ВТ_Данные
	|ИЗ
	|	РегистрСведений.ИндНомер КАК ИндНомер
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО ИндНомер.индкод = РегистрНакопления1Остатки.индкод
	|ГДЕ
	|	ИндНомер.АвитоЧастник
	|	И РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И ИндНомер.Цена > 0
	|	И ИндНомер.ЕстьФото = ИСТИНА
	|	И ИндНомер.Стеллаж <> &Стеллаж
	|	И ВЫБОР
	|		КОГДА НЕ ИндНомер.индкод.Владелец.Подкатегория2 В (&Категории)
	|			ТОГДА НЕ (РегистрНакопления1Остатки.машина.Серия = ЗНАЧЕНИЕ(Справочник.Серии.ПустаяСсылка)
	|			ИЛИ РегистрНакопления1Остатки.машина.Модель = ЗНАЧЕНИЕ(Справочник.МоделиАвтомобилей.ПустаяСсылка))
	|		ИНАЧЕ
	|		НЕ (ИндНомер.индкод.Владелец.Бренд = ЗНАЧЕНИЕ(Справочник.Бренд.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.МодельШин = ЗНАЧЕНИЕ(Справочник.МоделиШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ВысотаШин = ЗНАЧЕНИЕ(Справочник.ВысотаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ШиринаШин = ЗНАЧЕНИЕ(Справочник.ШиринаШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ДиаметрШин = ЗНАЧЕНИЕ(Справочник.ДиаметрШин.ПустаяСсылка)
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексНагрузки = 0
	|		ИЛИ ИндНомер.индкод.Владелец.ИндексСкорости = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.ОсьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.СезонностьШин = НЕОПРЕДЕЛЕНО
	|		ИЛИ ИндНомер.индкод.Владелец.Состояние = НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ
	|	И ИндНомер.Стеллаж.Владелец В (&Склад)
	|	И ИндНомер.Поддон <> &Поддон
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Данные.НомерЗаписи КАК НомерЗаписи,
	|	ВТ_Данные.индкод КАК индкод,
	|	ВТ_Данные.Товар.Код КАК КодТовара,
	|	ВТ_Данные.Товар КАК Товар,
	|	ВТ_Данные.НомерПроизводителя КАК НомерПроизводителя,
	|	ВТ_Данные.Бренд КАК Бренд,
	|	ВТ_Данные.Производитель КАК Производитель,
	|	ВТ_Данные.Состояние КАК Состояние,
	|	ВТ_Данные.Цена КАК Цена,
	|	ВТ_Данные.Вес КАК Вес,
	|	ВТ_Данные.машина КАК машина,
	|	ВТ_Данные.Серия КАК Серия,
	|	ВТ_Данные.Модель КАК Модель,
	|	ВТ_Данные.КолвоОстаток КАК КолвоОстаток,
	|	ВТ_Данные.Длина КАК Длина,
	|	ВТ_Данные.Ширина КАК Ширина,
	|	ВТ_Данные.Высота КАК Высота,
	|	ВТ_Данные.Комментарий КАК Комментарий,
	|	ВТ_Данные.Категории КАК Категории,
	|	ВТ_Данные.ШиринаШин КАК ШиринаШин,
	|	ВТ_Данные.ВысотаШин КАК ВысотаШин,
	|	ВТ_Данные.ДиаметрШин КАК ДиаметрШин,
	|	ВТ_Данные.ОсьШин КАК ОсьШин,
	|	ВТ_Данные.СезонностьШин КАК СезонностьШин,
	|	ВТ_Данные.ИндексСкорости КАК ИндексСкорости,
	|	ВТ_Данные.ИндексНагрузки КАК ИндексНагрузки,
	|	ВТ_Данные.МодельШин КАК МодельШин,
	|	ВТ_Данные.Склад КАК Склад,
	|	ВТ_Данные.ИндкодНаименование КАК ИндкодНаименование,
	|	ВТ_Данные.Артикул КАК Артикул,
	|	ВТ_Данные.индкодПредставление КАК индкодПредставление
	|ИЗ
	|	ВТ_Данные КАК ВТ_Данные
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерЗаписи";
	
	Возврат Результат;
	///-ГомзМА 16.05.2024

КонецФункции

#КонецОбласти

#Область АвитоЧастник 

Процедура АвтозагрузкаАвитоЧастник() Экспорт
	
	///+ГомзМА 15.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоЧастник();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();

	//Добавляем степень износа +
	ДеталиТЗ.Колонки.Добавить("СтепеньИзноса");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "КодТовара, Товар, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("КодТовара, Товар", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("КодТовара", СтрокаТЗ.КодТовара);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		СтепеньИзноса = 5;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			НужнаяСтрока = ДеталиТЗ.Найти(НайденнаяСтрока.ИндкодНаименование);
			Если НужнаяСтрока <> Неопределено Тогда
				ДеталиТЗ[НужнаяСтрока.НомерЗаписи - 1]["СтепеньИзноса"] = СтепеньИзноса;
				СтепеньИзноса = СтепеньИзноса + 0.1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	//Добавляем степень износа -
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito_chastnik\avito_chastnik.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоЧастник(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 15.02.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоЧастник(ТЗРезультат) 
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденныеФотки = Фотки[Итер].xml;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ", 51);
				Если СтрДлина(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
			
			Если РезультатЗапроса.Комментарий <> "" Тогда
				Комментарий = "" + Символы.ПС + "<p>" + РезультатЗапроса.Комментарий + "</p>";	
			Иначе
				Комментарий = "";		
			КонецЕсли;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Вес = РезультатЗапроса.Вес;
			
			СтепеньИзноса = РезультатЗапроса.СтепеньИзноса;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + " 
				|<p>️Состояние: Хорошее <br>
				|Размеры: " + РазмерыШин + "</p>
				|Степень износа " + СтепеньИзноса + "%</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Подходит для " + МодельСерия + "</p>
				|<p>Экспресс доставка до терминала в день покупки (габариты обговариваются)<br>
				|Бесплатная консультация и заказ - доступны 24/7<br>
				|Прием звонков: с 9 до 18<br>
				|Любой способ оплаты</p>
				|<p>️Ассортимент включает 200000 деталей scania</p>
				|<p>️Нас так же можно найти по таким запросам:</p>
				|<p>️запчасти скания, запчасти скания 5, купить запчасти на сканию, запчасти скания 5 серии, запчасти скания тягач, запчасти скания 6,  запчасти скания 6 серии</p>
				|<p>️запчасти scania, запчасти scania серии, запчасти scania r,  запчасти scania купить, запчасти scania 5, запчасти автомобиля scania, запчасти scania 6</p]]></Description>
				|<Price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</Price>
				|" + НайденныеФотки + "
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";

			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>Запчасти Scania: Оригинальные Детали для Надежности Вашего Грузовика!</p>
				|<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + " 
				|<p>С Авито Доставкой</p>
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + Размеры + "<br>
				|<p>️Вес: " + Вес + " кг</p>
				|Степень износа " + СтепеньИзноса + "%</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Большой выбор запчастей для грузовиков Scania, обеспечиваем высокое качество и надежность. Наши запчасти подходят для всех моделей, включая Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.</p> 
				|<p>Почему мы?</p>
				|<p>- Быстрая и надежная доставка по всей России.</p>
				|<p>Почему стоит выбрать нас?<br>
				|- Опытные специалисты помогут вам подобрать нужные детали.<br>
				|- Онлайн-консультации: отправим фото и видео по запросу.</p>
				|<p>Доставка и Оплата:<br>
				|- Быстрая доставка по всей России.<br>
				|- Удобные способы оплаты: наличные, карта, безналичный расчет.</p>
				|<p>scania, скания, scania R, scania 5, запчасти Scania, купить Scania, Scania тягач, Scania б/у</p>
				|<p>Закажите оригинальные запчасти Scania прямо сейчас и обеспечьте вашему грузовику надежность и долгий срок службы!</p]]></Description>
				|<Price>" + Формат(РезультатЗапроса.Цена * 1.12, "ЧДЦ=0; ЧГ=0") + "</Price>
				|" + НайденныеФотки + "
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в разборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>В наличии</Availability>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 15.02.2024
	
КонецФункции

#КонецОбласти

#Область АвитоМенее19кг

Процедура АвтозагрузкаАвитоМенее19кг() Экспорт
	
	///+ГомзМА 15.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоМенее19кг();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	//Добавляем степень износа +
	ДеталиТЗ.Колонки.Добавить("СтепеньИзноса");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "КодТовара, Товар, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("КодТовара, Товар", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("КодТовара", СтрокаТЗ.КодТовара);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		СтепеньИзноса = 5;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			НужнаяСтрока = ДеталиТЗ.Найти(НайденнаяСтрока.ИндкодНаименование);
			Если НужнаяСтрока <> Неопределено Тогда
				ДеталиТЗ[НужнаяСтрока.НомерЗаписи - 1]["СтепеньИзноса"] = СтепеньИзноса;
				СтепеньИзноса = СтепеньИзноса + 0.1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	//Добавляем степень износа -
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito-19kg\avito-19kg.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоМенее19кг(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 15.02.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоМенее19кг(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденныеФотки = Фотки[Итер].xml;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ", 51);
				Если СтрДлина(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
			
			Если РезультатЗапроса.Комментарий <> "" Тогда
				Комментарий = "" + Символы.ПС + "<p>" + РезультатЗапроса.Комментарий + "</p>";	
			Иначе
				Комментарий = "";		
			КонецЕсли;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
				РезультатЗапроса.Ширина = 0 	ИЛИ 
				РезультатЗапроса.Высота = 0)	Тогда
				Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
			Иначе
				Размеры = "По запросу";
			КонецЕсли;
			
			Вес = РезультатЗапроса.Вес;
			
			Цена = Формат(РезультатЗапроса.Цена * 1.1, "ЧДЦ=0; ЧГ=0");
			//Скидка в выходной день
//			Если ДеньНедели(ТекущаяДатаСеанса()) = 6 ИЛИ (ДеньНедели(ТекущаяДатаСеанса()) И ТекущаяДатаСеанса() < КонецДня(ТекущаяДатаСеанса()) - 3600) = 7 Тогда
//				ЦенаСкидки = Цена * 0.2;
//				Цена = Формат(Цена - ЦенаСкидки, "ЧДЦ=0; ЧГ=0");
//			КонецЕсли;
			
			Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
				ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
				"<Make>Scania</Make>" + Символы.ПС +  
				"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
			Иначе
				ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
			КонецЕсли;
			
			СтепеньИзноса = РезультатЗапроса.СтепеньИзноса;
			
			ТекстФайла = ТекстФайла + " 
			|<Ad>
			|<Id>" + АйдиКод + "</Id> 
			|<ContactPhone>8 953 554 29 93</ContactPhone>
			|<Address>" + Адрес + "</Address> 
			|<ContactMethod>По телефону и в сообщениях</ContactMethod>
			|<Category>Запчасти и аксессуары</Category>
			|<Title>" + Название + "</Title>
			|<Description><![CDATA[<p>Запчасти Scania: Оригинальные Детали для Надежности Вашего Грузовика!</p>
			|<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + " 
			|<p>С Авито Доставкой</p>
			|<p>️Состояние: " + Состояние + "<br>
			|Размеры: " + Размеры + "<br>
			|<p>️Вес: " + Вес + " кг<br>
			|Степень износа " + СтепеньИзноса + "%</p>
			|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
			|Аналоги: " + Аналог + "<br>
			|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
			|<p>Большой выбор запчастей для грузовиков Scania, обеспечиваем высокое качество и надежность. Наши запчасти подходят для всех моделей, включая Скания R, Скания P, Скания G, Скания S. Скания 5 серии и Скания 6 серии.</p> 
			|<p>Почему мы?</p>
			|<p>- Быстрая и надежная доставка по всей России.</p>
			|<p>Почему стоит выбрать нас?<br>
			|- Опытные специалисты помогут вам подобрать нужные детали.<br>
			|- Онлайн-консультации: отправим фото и видео по запросу.</p>
			|<p>Доставка и Оплата:<br>
			|- Быстрая доставка по всей России.<br>
			|- Удобные способы оплаты: наличные, карта, безналичный расчет.</p>
			|<p>scania, скания, scania R, scania 5, запчасти Scania, купить Scania, Scania тягач, Scania б/у</p>
			|<p>Закажите оригинальные запчасти Scania прямо сейчас и обеспечьте вашему грузовику надежность и долгий срок службы!</p]]></Description>
			|<Price>" + Цена + "</Price>
			|" + НайденныеФотки + "
			|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw&amp;list=PLnbjYzzECnGHE829ffFQf6l-FS5CA8hAm&amp;index=8</VideoURL>
			|<GoodsType>Запчасти</GoodsType>
			|<AdType>Товар приобретен на продажу</AdType>
			|<ProductType>Для грузовиков и спецтехники</ProductType>
			|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
			|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в разборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
			|<Availability>В наличии</Availability>
			|<Originality>Оригинал</Originality>
			|<Brand>" + Бренд + "</Brand>
			|" + ЗаменаТекстаДетали + "
			|<Condition>" + Состояние + "</Condition>
			|</Ad>";			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 15.02.2024
	
КонецФункции

#КонецОбласти

#Область АвитоБолее19кг

Процедура АвтозагрузкаАвитоБолее19кг() Экспорт
	
	///+ГомзМА 15.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровАвитоБолее19кг();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	//Добавляем степень износа +
	ДеталиТЗ.Колонки.Добавить("СтепеньИзноса");
	
	ГруппировкаТЗ = ДеталиТЗ.Скопировать(, "КодТовара, Товар, КолвоОстаток");
	ГруппировкаТЗ.Свернуть("КодТовара, Товар", "КолвоОстаток");
	
	Для каждого СтрокаТЗ Из ГруппировкаТЗ Цикл
		ПараметрыОтбора = Новый Структура("КодТовара", СтрокаТЗ.КодТовара);
		НайденныеСтрокиТоваров = ДеталиТЗ.НайтиСтроки(ПараметрыОтбора);
		СтепеньИзноса = 5;
		Для каждого НайденнаяСтрока Из НайденныеСтрокиТоваров Цикл
			НужнаяСтрока = ДеталиТЗ.Найти(НайденнаяСтрока.ИндкодНаименование);
			Если НужнаяСтрока <> Неопределено Тогда
				ДеталиТЗ[НужнаяСтрока.НомерЗаписи - 1]["СтепеньИзноса"] = СтепеньИзноса;
				СтепеньИзноса = СтепеньИзноса + 0.1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	//Добавляем степень износа -
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_avito+19kg\avito+19kg.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<Ads formatVersion=""3"" target=""Avito.ru"">");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереАвитоБолее19кг(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</Ads>");
	///-ГомзМА 15.02.2024
	
КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереАвитоБолее19кг(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденныеФотки = Фотки[Итер].xml;
			Итер = Итер +1;
			
			Адрес = "Нижегородская область, Нижний Новгород, пл. Минина и Пожарского";
			
			Если РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000005") Тогда
				Адрес = "г.Москва, Балашиха, ул. Поповка, д. 1а";
			ИначеЕсли РезультатЗапроса.Склад = Справочники.Склады.НайтиПоКоду("000000008") Тогда
				Адрес = "г.Екатеринбург, проезд Горнистов д.12";
			КонецЕсли;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502") Тогда
				Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
				Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			Иначе
				Название = Лев(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ", 51);
				Если СтрДлина(РезультатЗапроса.НомерПроизводителя + " " + РезультатЗапроса.Товар + " SCANIA СКАНИЯ") > 50 Тогда
					НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
					Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
					ДлинаСтроки 		 = СтрДлина(Название);
					КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
					ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
					Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
						Название = Лев(Название, ДлинаСтроки - 1);
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			Индкод = РезультатЗапроса.индкод.Наименование;
			
			АйдиКод = "new_" + РезультатЗапроса.индкод + "_1";
			
			Если РезультатЗапроса.Комментарий <> "" Тогда
				Комментарий = "" + Символы.ПС + "<p>" + РезультатЗапроса.Комментарий + "</p>";	
			Иначе
				Комментарий = "";		
			КонецЕсли;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			МодельСерия = ?(РезультатЗапроса.Серия = Справочники.Серии.ПустаяСсылка(), "5 серия", НРег(РезультатЗапроса.Серия)) + " серии: " + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(),"R",РезультатЗапроса.Модель);
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			ИначеЕсли РезультатЗапроса.Бренд = Справочники.Бренд.НайтиПоКоду("000000288") Тогда //RM Italy
				Бренд = "";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			СтепеньИзноса = РезультатЗапроса.СтепеньИзноса;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + " 
				|<p>️Состояние: Хорошее <br>
				|Размеры: " + РазмерыШин + "<br>
				|Степень износа " + СтепеньИзноса + "%</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Подходит для " + МодельСерия + "</p>
				|<p>Экспресс доставка до терминала в день покупки (габариты обговариваются)<br>
				|Бесплатная консультация и заказ - доступны 24/7<br>
				|Прием звонков: с 9 до 18<br>
				|Любой способ оплаты</p>
				|<p>️Ассортимент включает 200000 деталей scania</p>
				|<p>️Нас так же можно найти по таким запросам:</p>
				|<p>️запчасти скания, запчасти скания 5, купить запчасти на сканию, запчасти скания 5 серии, запчасти скания тягач, запчасти скания 6,  запчасти скания 6 серии</p>
				|<p>️запчасти scania, запчасти scania серии, запчасти scania r,  запчасти scania купить, запчасти scania 5, запчасти автомобиля scania, запчасти scania 6</p]]></Description>
				|<Price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw&amp;list=PLnbjYzzECnGHE829ffFQf6l-FS5CA8hAm&amp;index=8</VideoURL>
				|<GoodsType>Шины, диски и колёса</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Шины для грузовиков и спецтехники</ProductType>
				|<Brand>" + Бренд + "</Brand>
				|<Model>" + РезультатЗапроса.МодельШин + "</Model>
				|<Condition>" + Состояние + "</Condition>
				|<TireSectionWidth>" + РезультатЗапроса.ШиринаШин + "</TireSectionWidth>
				|<TireAspectRatio>" + РезультатЗапроса.ВысотаШин + "</TireAspectRatio>
				|<RimDiameter>" + РезультатЗапроса.ДиаметрШин + "</RimDiameter>
				|<WheelAxle>" + РезультатЗапроса.ОсьШин + "</WheelAxle>
				|<TireType>" + РезультатЗапроса.СезонностьШин + "</TireType>
				|<SpeedIndex>" + РезультатЗапроса.ИндексСкорости + "</SpeedIndex>
				|<LoadIndex>" + РезультатЗапроса.ИндексНагрузки + "</LoadIndex>
				|</Ad>";
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				Если НомерПроизводителя = "" И СтрЗаменить(РезультатЗапроса.Артикул, "*", "") = "" Тогда
					ЗаменаТекстаДетали = "<Technic>Тягачи</Technic>" + Символы.ПС + 
					"<Make>Scania</Make>" + Символы.ПС +  
					"<Model>" + Строка(?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель)) + "</Model>";
				Иначе
					ЗаменаТекстаДетали = "<oem>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem>";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<Ad>
				|<Id>" + АйдиКод + "</Id> 
				|<ContactPhone>8 952 760 69 09</ContactPhone>
				|<Address>" + Адрес + "</Address> 
				|<ContactMethod>По телефону и в сообщениях</ContactMethod>
				|<Category>Запчасти и аксессуары</Category>
				|<Title>" + Название + "</Title>
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>" + Комментарий + "  
				|<p>️Состояние: Хорошее <br>
				|Размеры: " + Размеры + "<br>
				|Степень износа " + СтепеньИзноса + "%</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗапроса.индкод + "</p> 
				|<p>Подходит для " + МодельСерия + "</p>
				|<p>Экспресс доставка до терминала в день покупки (габариты обговариваются)<br>
				|Бесплатная консультация и заказ - доступны 24/7<br>
				|Прием звонков: с 9 до 18<br>
				|Любой способ оплаты</p>
				|<p>️Ассортимент включает 200000 деталей scania</p>
				|<p>️Нас так же можно найти по таким запросам:</p>
				|<p>️запчасти скания, запчасти скания 5, купить запчасти на сканию, запчасти скания 5 серии, запчасти скания тягач, запчасти скания 6,  запчасти скания 6 серии</p>
				|<p>️запчасти scania, запчасти scania серии, запчасти scania r,  запчасти scania купить, запчасти scania 5, запчасти автомобиля scania, запчасти scania 6</p]]></Description>
				|<Price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</Price>
				|" + НайденныеФотки + "
				|<VideoURL>https://www.youtube.com/watch?v=E6-xEkuu5Kw&amp;list=PLnbjYzzECnGHE829ffFQf6l-FS5CA8hAm&amp;index=8</VideoURL>
				|<GoodsType>Запчасти</GoodsType>
				|<AdType>Товар приобретен на продажу</AdType>
				|<ProductType>Для грузовиков и спецтехники</ProductType>
				|<SparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабина", "Электроника и свет") + "</SparePartType>
				|<TechnicSparePartType>" + ?(РезультатЗапроса.Вес > 14, "Кабины в разборе", "Контроллеры, реле и датчики") + "</TechnicSparePartType>
				|<Availability>В наличии</Availability>
				|<Originality>Оригинал</Originality>
				|<Brand>" + Бренд + "</Brand>
				|" + ЗаменаТекстаДетали + "
				|<Condition>" + Состояние + "</Condition>
				|</Ad>";
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 15.02.2024
	
КонецФункции

#КонецОбласти

#Область ДромНН

Процедура АвтозагрузкаДромНН() Экспорт

	///+ГомзМА 07.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровДром();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000019")); //АВИТО ЧАСТНИК
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000002")); //Нижний Новгород WorkTruck
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_dromNN\dromnn.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + "<offers>");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
				
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереДромНН(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
			
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</offers>");
	///-ГомзМА 07.02.2024

КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереДромНН(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденныеФотки = Фотки[Итер].xml;
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "<Images>", "<picture>");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "</Images>", "</picture>");
			
			Итер = Итер +1;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
			Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
				НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
				Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
				ДлинаСтроки 		 = СтрДлина(Название);
				КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
				ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
				Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
					Название = Лев(Название, ДлинаСтроки - 1);
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			АйдиКод = "new_" + РезультатЗапроса.индкод;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<available>true</available>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + РазмерыШин + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p> 
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + Размеры + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 05.02.2023
	
КонецФункции

#КонецОбласти

#Область ДромМСК

Процедура АвтозагрузкаДромМСК() Экспорт

	///+ГомзМА 07.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровДром();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000005")); //Москва
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_dromMSK\drommsk.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + "<offers>");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
				
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереДромМСК(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
			
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</offers>");
	///-ГомзМА 07.02.2024

КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереДромМСК(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденныеФотки = Фотки[Итер].xml;
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "<Images>", "<picture>");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "</Images>", "</picture>");
			
			Итер = Итер +1;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
			Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
				НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
				Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
				ДлинаСтроки 		 = СтрДлина(Название);
				КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
				ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
				Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
					Название = Лев(Название, ДлинаСтроки - 1);
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			АйдиКод = "new_" + РезультатЗапроса.индкод;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + РазмерыШин + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p> 
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + Размеры + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 05.02.2023
	
КонецФункции

#КонецОбласти

#Область ДромЕКБ

Процедура АвтозагрузкаДромЕКБ() Экспорт

	///+ГомзМА 07.02.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляТоваровДром();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000008")); //Екатеринбург
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КоличествоДеталей = ДеталиТЗ.Количество();
	
	Если КоличествоДеталей > 49000 Тогда
		КонечныйНомер = 48000;
	Иначе
		КонечныйНомер = КоличествоДеталей;
	КонецЕсли;
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_dromEKB\dromekb.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + "<offers>");
	
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
				
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереДромЕКБ(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
			
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</offers>");
	///-ГомзМА 07.02.2024

КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереДромЕКБ(ТЗРезультат)
	
	///+ГомзМА 15.02.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	Фотки = ПолучитьФото(МассивИндКодов);
	Итер = 0;	
	
	ТекстФайла = "";	
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденныеФотки = Фотки[Итер].xml;
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "<Images>", "<picture>");
			НайденныеФотки = СтрЗаменить(НайденныеФотки, "</Images>", "</picture>");
			
			Итер = Итер +1;
			
			НомерПроизводителя = СтрЗаменить(РезультатЗапроса.НомерПроизводителя, "*", "");
			НомерПроизводителя = СтрЗаменить(НомерПроизводителя, ",", "");
			
			Название = Лев("" + РезультатЗапроса.Товар + " SCANIA", 51);
			Если СтрДлина("" + РезультатЗапроса.Товар + " SCANIA") > 50 Тогда
				НайтиПоследнийПробел = СтрНайти(Название, " ", НаправлениеПоиска.СКонца);
				Название 			 = Лев(Название, НайтиПоследнийПробел - 1);
				ДлинаСтроки 		 = СтрДлина(Название);
				КодПоследнегоСимвола = КодСимвола(Название, ДлинаСтроки);
				ПоследнийСимвол 	 = Символ(КодПоследнегоСимвола);
				Если ПоследнийСимвол = "." ИЛИ ПоследнийСимвол = "," ИЛИ ПоследнийСимвол = "/" Тогда
					Название = Лев(Название, ДлинаСтроки - 1);
				КонецЕсли;
			КонецЕсли;
			
			Название = СтрЗаменить(Название, "(", "");
			Название = СтрЗаменить(Название, ")", "");
			Название = СтрЗаменить(Название, "*", "");
			Название = СтрЗаменить(Название, ",", "");
			Название = СтрЗаменить(Название, "уценка", "");
			Название = СтрЗаменить(Название, "&", "");
			
			АйдиКод = "new_" + РезультатЗапроса.индкод;
			
			Аналог = НайтиАналогДетали(РезультатЗапроса.Товар);
			
			Если РезультатЗапроса.Состояние <> Перечисления.Состояние.БУ ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Новый ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Перекупка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Уценка ИЛИ
				РезультатЗапроса.Состояние <> Перечисления.Состояние.Восстановленная Тогда
				
				Состояние = Неопределено;
			Иначе
				Состояние = Строка(РезультатЗапроса.Состояние);
			КонецЕсли; 
			
			Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
				Если РезультатЗапроса.Артикул = "*" Тогда
					ОригинальныйНомер = "";
				Иначе
					ОригинальныйНомер = РезультатЗапроса.Артикул;
				КонецЕсли;
			Иначе
				ОригинальныйНомер = РезультатЗапроса.НомерПроизводителя;
			КонецЕсли;
			
			Если Аналог = Неопределено Тогда
				Если РезультатЗапроса.НомерПроизводителя = "*" Тогда
					Если РезультатЗапроса.Артикул = "*" Тогда
						Аналог = "";
					Иначе
						Аналог = РезультатЗапроса.Артикул;
					КонецЕсли;
				Иначе
					Аналог = РезультатЗапроса.НомерПроизводителя;
				КонецЕсли;
			Иначе
				Аналог = Аналог;
			КонецЕсли;
			
			Если РезультатЗапроса.Бренд = Справочники.Бренд.ПустаяСсылка() Тогда
				Бренд = "Scania";
			Иначе
				Бренд = РезультатЗапроса.Бренд;
			КонецЕсли;
			
			Если Состояние = Неопределено Тогда
				Состояние = "Б/у";
			Иначе
				Состояние = Состояние;
			КонецЕсли;
			
			Если РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000501") ИЛИ
				РезультатЗапроса.Категории = Справочники.Категории.НайтиПоКоду("000000502")  Тогда
				
				Если НЕ (РезультатЗапроса.ШиринаШин = Справочники.ШиринаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ВысотаШин = Справочники.ВысотаШин.ПустаяСсылка() 	  ИЛИ 
					РезультатЗапроса.ДиаметрШин = Справочники.ДиаметрШин.ПустаяСсылка()) Тогда
					РазмерыШин = "ширина " + РезультатЗапроса.ШиринаШин + ", высота " + РезультатЗапроса.ВысотаШин + ", диаметр" + РезультатЗапроса.ДиаметрШин;
				Иначе
					РазмерыШин = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p>
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + РазмерыШин + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			Иначе
				
				Если НЕ (РезультатЗапроса.Длина = 0 	ИЛИ 
					РезультатЗапроса.Ширина = 0 	ИЛИ 
					РезультатЗапроса.Высота = 0)	Тогда
					Размеры = "" + РезультатЗапроса.Длина + "х" + РезультатЗапроса.Ширина + "х" + РезультатЗапроса.Высота + "см.<br>Вес: " + РезультатЗапроса.Вес + "кг";
				Иначе
					Размеры = "По запросу";
				КонецЕсли;
				
				ТекстФайла = ТекстФайла + " 
				|<offer id=""" + АйдиКод + """ available=""true"">
				|<name>" + Название + "</name>
				|<sWhereabouts>в наличии</sWhereabouts>
				|<available>true</available>
				|<analog_numbers>" + Аналог + "</analog_numbers>
				|<manufacturer>Scania</manufacturer>
				|<oem_number>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</oem_number>
				|<ordercode>" + ?(НомерПроизводителя <> "", НомерПроизводителя, СтрЗаменить(РезультатЗапроса.Артикул, "*", "")) + "</ordercode>
				|<price>" + Формат(РезультатЗапроса.Цена * 1.05, "ЧДЦ=0; ЧГ=0") + "</price>
				|<condition>" + Состояние + "</condition>
				|<brandcars>" + Бренд + "</brandcars>
				|<modelcars>" + ?(РезультатЗапроса.Модель = Справочники.МоделиАвтомобилей.ПустаяСсылка(), "R", РезультатЗапроса.Модель) + "</modelcars>
				|" + НайденныеФотки + "
				|<Description><![CDATA[<p>" + РезультатЗапроса.НомерПроизводителя + " " + СтрЗаменить(РезультатЗапроса.Товар, "&", "") + "</p> 
				|<p>️Состояние: " + Состояние + "<br>
				|Размеры: " + Размеры + "</p>
				|<p>Оригинальный номер: " + ОригинальныйНомер + "<br>
				|Аналоги: " + Аналог + "<br>
				|Внутренний артикул: " + РезультатЗАпроса.индкод + "</p> 
				|<p>Запчасти Scania — Качество и Надежность!</p>
				|<p>Магазин запчастей предлагает широкий ассортимент оригинальных и сертифицированных запчастей для грузовиков Scania. Наши детали обеспечивают долгий срок службы вашего транспорта и отличное техническое состояние.</p>
				|<p>️Широкий Ассортимент Предлагаем запчасти для различных моделей Scania: P, G, R, S серии. У нас вы найдете все, начиная от двигателя и заканчивая элементами подвески и тормозной системы.</p>
				|<p>️Гарантированное Качество Все предлагаемые нами запчасти — это гарантированное качество и надежность. Оригинальные номера и высокие стандарты производства обеспечивают превосходную работу каждой детали.</p>
				|<p>️Почему выбирают нас?</p>
				|<p>️Огромный выбор запчастей<br>
				|Доступные цены<br>
				|Оригинальные детали Scania<br>
				|Быстрая доставка по всей России<br>
				|Доставка и Оплата Удобные варианты доставки в любой регион России. Оплата производится удобным для вас способом.</p>
				|<p>️Сотрудничество Мы также заинтересованы в долгосрочном сотрудничестве с автосервисами и владельцами парков техники.</p>
				|<p>️Выбирайте качество, выбирайте надежность — выбирайте наши запчасти Scania!</p>
				|<p>️#запчастиScania #грузовики #автозапчасти #Scania #Drom #автосервис</p]]></Description>
				|</offer>";
				
			КонецЕсли;			
		КонецЦикла;		
	КонецЕсли;
	
	Возврат ТекстФайла;
	///-ГомзМА 05.02.2023
	
КонецФункции

#КонецОбласти

#Область Иззап

Процедура АвтозагрузкаИззап() Экспорт
	
	///+ГомзМА 16.05.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляИззап();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КонечныйНомер = ДеталиТЗ.Количество();
	
	//Подключение к Excel
	Excel = Новый COMОбъект("Excel.Application"); 
	
	Excel.DisplayAlerts = 0;
	Excel.Visible = 0;
	
	//Открытие существующей книги
	ПутьКФайлу = "\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_izzap\izzap.xlsx";
	Книга = Excel.Workbooks.Open(ПутьКФайлу);
	
	//Получаем первый лист
	Лист = Книга.Worksheets(1);
	
	//Очистить ячейки
	ПоследняяСтрока = Лист.Cells(Лист.Rows.Count, 14).End(-4162).Row;
	Диапазон = Лист.Range("A2:N" + Строка(Формат(ПоследняяСтрока, "ЧГ=")));
	Диапазон.ClearContents();
	
	//Заполняем строки
	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ВыгрузитьДанныеНаСервереИззап(ЧастьДеталей, Лист);
	КонецЦикла;
		
	//Сохраняем книгу
	Попытка
		//Книга.SaveCopyAs(ПутьКФайлу);
		Книга.SaveAs(ПутьКФайлу);
		//Закрываем Excel
		Excel.Workbooks.Close();
		Excel.Application.Quit();
	Исключение
		//Закрываем Excel
		Excel.Workbooks.Close();
		Excel.Application.Quit();
	КонецПопытки;
	///-ГомзМА 16.05.2024
	
КонецПроцедуры

Процедура ВыгрузитьДанныеНаСервереИззап(ТЗРезультат, Лист)
	
	///+ГомзМА 16.05.2024
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	
	Фотки = ПолучитьФото(МассивИндкодов);
	Итер = 0;
		
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденноеФото = Фотки[Итер].xml;
			НайденноеФото = Сред(НайденноеФото, 22);
			КонечныйСимвол = СтрНайти(НайденноеФото, ">");
			НайденноеФото = Лев(НайденноеФото, КонечныйСимвол - 3);
			
			Производитель = Строка(РезультатЗапроса.Производитель);
			Производитель = СтрЗаменить(Производитель, "&", " ");
			
			Товар = Строка(РезультатЗапроса.Товар);
			Товар = СтрЗаменить(Товар, "&", " ");
			
			Строка = РезультатЗапроса.НомерЗаписи + 1;
			
			Лист.Cells(Строка, 1).Value  = Строка(РезультатЗапроса.индкод);
			Лист.Cells(Строка, 2).Value  = Строка(РезультатЗапроса.Артикул);
			Лист.Cells(Строка, 3).Value  = Строка(РезультатЗапроса.НомерПроизводителя);
			Лист.Cells(Строка, 4).Value  = Строка(РезультатЗапроса.Бренд);
			Лист.Cells(Строка, 5).Value  = Производитель;
			Лист.Cells(Строка, 6).Value  = Товар;
			Лист.Cells(Строка, 7).Value  = РезультатЗапроса.КолвоОстаток;
			Лист.Cells(Строка, 8).Value  = РезультатЗапроса.Цена;
			Лист.Cells(Строка, 9).Value  = ПолучитьАналогиТовара(РезультатЗапроса.Товар);
			Лист.Cells(Строка, 10).Value = Строка(РезультатЗапроса.Состояние);
			Лист.Cells(Строка, 11).Value = ""; //"Категория";
			Лист.Cells(Строка, 12).Value = ""; //"Ссылка на деталь на сайте";
			Лист.Cells(Строка, 13).Value = НайденноеФото;
			Лист.Cells(Строка, 14).Value = ""; //"Ссылка на фото детали на сайте";
			
			Итер = Итер +1;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 16.05.2024
	
КонецПроцедуры



#КонецОбласти

#Область Ззап

Процедура АвтозагрузкаЗзап() Экспорт

	///+ГомзМА 14.05.2024
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстДляЗзап();
	
	МассивКатегорийШин = Новый Массив;
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000501"));
	МассивКатегорийШин.Добавить(Справочники.Категории.НайтиПоКоду("000000502"));
	
	МассивСкладов = Новый Массив;
	
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000019")); //АВИТО ЧАСТНИК
	МассивСкладов.Добавить(Справочники.Склады.НайтиПоКоду("000000002")); //Нижний Новгород WorkTruck
	
	Запрос.УстановитьПараметр("Стеллаж", 	Справочники.Стеллаж.НайтиПоКоду("000001072"));
	Запрос.УстановитьПараметр("Категории", 	МассивКатегорийШин);
	Запрос.УстановитьПараметр("Склад", 		МассивСкладов);
	Запрос.УстановитьПараметр("Поддон", 	Справочники.Поддоны.НайтиПоКоду("000000003")); // П0003 потеряшки
	
	ДеталиТЗ = Запрос.Выполнить().Выгрузить();
	КонечныйНомер = ДеталиТЗ.Количество();
	
	ТекстФайла = "";
	
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("\\192.168.0.245\shared_folder\Autoloads_MarketPlace\Autoload_zzip\zzip.xml", "UTF-8");
	ЗаписьXML.ЗаписатьБезОбработки("<?xml version=""1.0"" encoding=""UTF-8""?>" + Символы.ПС + "<items>");

	КонечноеЗначение = 1;
	Для НомерЗаписи = 0 По КонечныйНомер Цикл
		
		НомерЗаписи = НомерЗаписи + 1000;
		ЧастьДеталей = Новый Массив;
		Если НомерЗаписи > КонечныйНомер Тогда
			НомерЗаписи = КонечныйНомер;
		КонецЕсли;
		Для Сч = КонечноеЗначение По НомерЗаписи Цикл
			ЧастьДеталей.Добавить(ДеталиТЗ[Сч - 1]);
		КонецЦикла;
		КонечноеЗначение = НомерЗаписи + 1;
		ТекстФайла = ВыгрузитьДанныеНаСервереЗзап(ЧастьДеталей);
		
		ЗаписьXML.ЗаписатьБезОбработки(ТекстФайла);
		
	КонецЦикла;
	
	ЗаписьXML.ЗаписатьБезОбработки("</items>");
	///-ГомзМА 14.05.2024

КонецПроцедуры

Функция ВыгрузитьДанныеНаСервереЗзап(ТЗРезультат)
	
	МассивИндКодов = Новый Массив;
	Для каждого СтрокаМассива Из ТЗРезультат Цикл
		МассивИндКодов.Добавить(СтрокаМассива.индкодПредставление);
	КонецЦикла;
	
	Фотки = ПолучитьФото(МассивИндкодов);
	Итер = 0;
	
	ТекстФайла = "";
	
	Если Фотки <> Неопределено Тогда
		Для каждого РезультатЗапроса Из ТЗРезультат Цикл
			НайденноеФото = Фотки[Итер].xml;
			НайденноеФото = Сред(НайденноеФото, 22);
			КонечныйСимвол = СтрНайти(НайденноеФото, ">");
			НайденноеФото = Лев(НайденноеФото, КонечныйСимвол - 3);
			
			Аналоги = ПолучитьАналогиТовара(РезультатЗапроса.Товар);
			
			Производитель = Строка(РезультатЗапроса.Производитель);
			Производитель = СтрЗаменить(Производитель, "&", " ");
			
			Товар = Строка(РезультатЗапроса.Товар);
			Товар = СтрЗаменить(Производитель, "&", " ");
			
			ТекстФайла = ТекстФайла + " 
			|<item>
			|<Id1c>" + Строка(РезультатЗапроса.индкод) + "</Id1c> 
			|<VendorCode>" + Строка(РезультатЗапроса.Артикул) + "</VendorCode>
			|<nproizv>" + Строка(РезультатЗапроса.НомерПроизводителя) + "</nproizv>
			|<brand>" + Строка(РезультатЗапроса.Бренд) + "</brand> 
			|<Vendor>" + Производитель + "</Vendor>
			|<Title>" + Товар + "</Title>
			|<kolvo>" + РезультатЗапроса.КолвоОстаток + "</kolvo>
			|<Price>" + РезультатЗапроса.Цена + "</Price>
			|<analogs>" + Аналоги + "</analogs>
			|<condition>" + Строка(РезультатЗапроса.Состояние) + "</condition>
			|<category></category>
			|<url></url> 
			|<Image_path>" + НайденноеФото + "</Image_path>
			|<Image></Image>
			|</item>";
			
			Итер = Итер +1;
		КонецЦикла;
	КонецЕсли;
	Возврат ТекстФайла;
	
КонецФункции

#КонецОбласти

#Область Т


#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьФото(ИндКод)
	
	///+ГомзМА 15.02.2024
	Соединение = Новый HTTPСоединение("192.168.0.245", 8085);
	СтрокаЗапроса = "/v1/images/avito/xml"; 
	
	Заголовки = Новый Соответствие;    
	Заголовки.Вставить("Content-Type", "application/json");
	
	Запрос = Новый HTTPЗапрос(СтрокаЗапроса, Заголовки);
	
	ЗапросСтруктура = Новый Структура;
	ЗапросСтруктура.Вставить("indCode", ИндКод); 
	
	ПотокJSON = Новый ЗаписьJSON(); 
	ПотокJSON.УстановитьСтроку();
	
	ЗаписатьJSON(ПотокJSON, ЗапросСтруктура);
	СтрокаJSON = ПотокJSON.Закрыть();
	
	Запрос.УстановитьТелоИзСтроки(СтрокаJSON);
	
	Ответ = Соединение.ВызватьHTTPМетод("POST", Запрос);
	
	Если Ответ.КодСостояния = 200 Тогда
		Тело = Ответ.ПолучитьТелоКакСтроку();  
		ЧтениеJSON = Новый ЧтениеJSON();
		ЧтениеJSON.УстановитьСтроку(Тело); 
		Ответ  = ПрочитатьJSON(ЧтениеJSON); 
	Иначе Сообщить("Код ответа: " + Ответ.КодСостояния); //анализируем код состояния и делаем выводы 
		Ответ = Неопределено;
	КонецЕсли;
	
	Возврат Ответ;
	///-ГомзМА 15.02.2024
	
КонецФункции

Функция НайтиАналогДетали(Товар)
	
	///+ГомзМА 15.02.2024
	Результат = Неопределено;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	НоменклатураНомераЗамен.НомерЗамены КАК НомерЗамены
	|ИЗ
	|	Справочник.Номенклатура.НомераЗамен КАК НоменклатураНомераЗамен
	|ГДЕ
	|	НоменклатураНомераЗамен.Ссылка.Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		РезультатЗапроса.Следующий();
		Результат = РезультатЗапроса.НомерЗамены;
	КонецЕсли;
	
	Возврат Результат;
	///-ГомзМА 15.02.2024
	
КонецФункции // НайтиАналогДетали()

Функция ПолучитьАналогиТовара(Товар)
	
	///+ГомзМА 14.05.2024
	Результат = "";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НоменклатураНомераЗамен.НомерЗамены КАК НомерЗамены
	|ИЗ
	|	Справочник.Номенклатура.НомераЗамен КАК НоменклатураНомераЗамен
	|ГДЕ
	|	НоменклатураНомераЗамен.Ссылка.Ссылка = &Товар";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Количество() > 0 Тогда
		Пока РезультатЗапроса.Следующий() Цикл
			Результат = Результат + РезультатЗапроса.НомерЗамены + "/";
		КонецЦикла;
		ДлинаСтроки = СтрДлина(Результат);
		Результат = Строка(Лев(Результат, ДлинаСтроки - 1));
	КонецЕсли;
	
	Возврат Результат;
	///-ГомзМА 14.05.2024
	
КонецФункции // НайтиАналогДетали()

#КонецОбласти


