
&НаКлиенте
Процедура РезультатОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка, ДополнительныеПараметры)
	СтандартнаяОбработка = Ложь;
	
	ОбработкаРасшифровки = Новый ОбработкаРасшифровкиКомпоновкиДанных(ДанныеРасшифровки, Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаСКД));
	
	СтруктураРасшифровки = Новый Структура("Сотрудник, Дата");
	
	НастройкиКомпоновкиДанных = ОбработкаРасшифровки.Расшифровать(Расшифровка, Новый ПолеКомпоновкиДанных("Номенклатура"));	
	
	ЭлементыОтбора = НастройкиКомпоновкиДанных.Отбор.Элементы;
	
	Для Каждого ЭлементОтбора Из ЭлементыОтбора Цикл
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Сотрудник") Тогда
			СтруктураРасшифровки.Номенклатура  = ЭлементОтбора.ПравоеЗначение;	
		КонецЕсли;
		
		Если ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Дата") Тогда
			СтруктураРасшифровки.Период  = ЭлементОтбора.ПравоеЗначение;	
		КонецЕсли;
		
	КонецЦикла;
КонецПроцедуры
