Процедура ПереченьНоменклатурыJSON() Экспорт
	// КомлевАА +_++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Наименование,
	|	Номенклатура.Код,
	|	Номенклатура.Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		МассивТоваров  = Новый Массив;

		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("name", Выборка.Наименование);
			СтруктураОтвета.Вставить("code", Выборка.Код);
			СтруктураОтвета.Вставить("article", Выборка.Артикул);
			МассивТоваров.Добавить(СтруктураОтвета);
		КонецЦикла;
	КонецЕсли;
	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл("\\nas\Backup1c\Комлев\Товары.json");
	ЗаписатьJSON(Запись, МассивТоваров);
	Запись.Закрыть();
	// КомлевАА ----
КонецПроцедуры

Процедура ВыгрузитьТоварыВJSON() Экспорт
	// КомлевАА +_++
	ЗапросТоваров = Новый Запрос;
	ЗапросТоваров.Текст =
	"ВЫБРАТЬ 
	|	СпрИндКод.Владелец.Наименование КАК Наименование,
	|	СпрИндКод.Владелец.Артикул КАК Артикул,
	|	РегистрИндНомер.индкод КАК индкод,
	|	РегистрИндНомер.Цена КАК Цена
	|ИЗ
	|	РегистрСведений.ИндНомер КАК РегистрИндНомер
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИндКод КАК СпрИндКод
	|		ПО РегистрИндНомер.индкод = СпрИндКод.Ссылка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО РегистрНакопления1Остатки.индкод = РегистрИндНомер.индкод
	|ГДЕ
	|	РегистрНакопления1Остатки.КолвоОстаток > 0
	|	И РегистрИндНомер.ЕстьФото = ИСТИНА";

	ДатаМесяцНазад = ДобавитьМесяц(ТекущаяДатаСеанса(), -1);
	ЗапросТоваров.УстановитьПараметр("ДатаМесяцНазад", ДатаМесяцНазад);
	Выборка = ЗапросТоваров.Выполнить().Выбрать();
	Выборка1 = ЗапросТоваров.Выполнить().Выбрать();

	МассивИндкод = Новый Массив;
	МассивТоваров = Новый массив;

	Пока Выборка1.Следующий() Цикл
		МассивИндкод.добавить (Строка(Выборка1.индкод));
	КонецЦикла;

	ФоткиИндкод = РаботаССайтомWT.ПолучениеФотоБезИндНомер(МассивИндкод);

	Пока Выборка.Следующий() Цикл

		Для Каждого Строка Из ФоткиИндкод Цикл

			Если Строка.indCode = Строка(Выборка.индкод) Тогда
				СтруктураТоваров = Новый Структура;

				Если Строка.urls.Количество() > 0 Тогда
					Структура = Новый Структура;
					Структура.Вставить("id", Строка.indCode);
					Фото = Строка.urls[0];
					СтруктураТоваров.Вставить("name", Строка(Выборка.Наименование));
					СтруктураТоваров.Вставить("article", Строка(Выборка.Артикул));
					СтруктураТоваров.Вставить("id", Строка(Выборка.индкод));
					СтруктураТоваров.Вставить("price", Число(Выборка.Цена));
					СтруктураТоваров.Вставить("photo", Фото);
					Прервать;
				КонецЕсли;
			КонецЕсли;

		КонецЦикла;

		Если ЗначениеЗаполнено(СтруктураТоваров) Тогда
			МассивТоваров.Добавить(СтруктураТоваров);
		КонецЕсли;

	КонецЦикла;

	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл("\\nas\Backup1c\common\verified_products.json");
	ЗаписатьJSON(Запись, МассивТоваров);
	Запись.Закрыть();
		// КомлевАА ---
КонецПроцедуры

#Область ПрограммныйИнтерфейс
Функция Просклонять(Слово, Падеж) Экспорт

	Возврат дт_ОбщегоНазначенияПовтИсп.Просклонять(Слово, Падеж);

КонецФункции

Функция ПолучитьСуммуДокументов(Знач Коллекция) Экспорт

	Возврат дт_ОбщегоНазначения.ПолучитьСуммуДокументов(Коллекция);

КонецФункции // ПолучитьСуммуДокументов()

Функция ПолучитьСсылкуПоУИ(УИ, ИмяОбъекта) Экспорт

	Результат = Неопределено;
	
	Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Документы[ИмяОбъекта].ПолучитьСсылку(УИ);
	ИначеЕсли Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Справочники[ИмяОбъекта].ПолучитьСсылку(УИ);
	КонецЕсли;
	
	Возврат Результат;
	

КонецФункции // ПолучитьСсылкуПоУИ()


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти