

Процедура ПереченьНоменклатурыJSON() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Номенклатура.Наименование,
		|	Номенклатура.Код,
		|	Номенклатура.Артикул
		|ИЗ
		|	Справочник.Номенклатура КАК Номенклатура";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтруктураОтвета = Новый Структура;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
	КонецЦикла;
КонецПроцедуры






#Область ПрограммныйИнтерфейс
Функция Просклонять(Слово, Падеж) Экспорт

	Возврат дт_ОбщегоНазначенияПовтИсп.Просклонять(Слово, Падеж);

КонецФункции

Функция ПолучитьСуммуДокументов(Знач Коллекция) Экспорт

	Возврат дт_ОбщегоНазначения.ПолучитьСуммуДокументов(Коллекция);

КонецФункции // ПолучитьСуммуДокументов()

Функция ПолучитьСсылкуПоУИ(УИ, ИмяОбъекта) Экспорт

	Результат = Неопределено;
	
	Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Документы[ИмяОбъекта].ПолучитьСсылку(УИ);
	ИначеЕсли Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Справочники[ИмяОбъекта].ПолучитьСсылку(УИ);
	КонецЕсли;
	
	Возврат Результат;
	

КонецФункции // ПолучитьСсылкуПоУИ()


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти