
#Область ПрограммныйИнтерфейс
Функция ПолучитьМенеждеров() Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДополнительныеНомера.Менеджер
		|ИЗ
		|	РегистрСведений.ДополнительныеНомера КАК ДополнительныеНомера";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	МассивМенеджеров = Новый Массив;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		МассивМенеджеров.Добавить(ВыборкаДетальныеЗаписи.Менеджер);
	КонецЦикла;
	Возврат МассивМенеджеров;
КонецФункции
Процедура ПереченьНоменклатурыJSON() Экспорт
	
	// Комлев АА
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Наименование,
	|	Номенклатура.Код,
	|	Номенклатура.Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		МассивТоваров  = Новый Массив;

		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("name", Выборка.Наименование);
			СтруктураОтвета.Вставить("code", Выборка.Код);
			СтруктураОтвета.Вставить("article", Выборка.Артикул);
			МассивТоваров.Добавить(СтруктураОтвета);
		КонецЦикла;
	КонецЕсли;
	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл("\\nas\Backup1c\Комлев\Товары.json");
	ЗаписатьJSON(Запись, МассивТоваров);
	Запись.Закрыть();
	// Комлев АА
КонецПроцедуры

Функция Просклонять(Слово, Падеж) Экспорт

	Возврат дт_ОбщегоНазначенияПовтИсп.Просклонять(Слово, Падеж);

КонецФункции

Функция ПолучитьСуммуДокументов(Знач Коллекция) Экспорт

	Возврат дт_ОбщегоНазначения.ПолучитьСуммуДокументов(Коллекция);

КонецФункции // ПолучитьСуммуДокументов()

Функция ПолучитьСсылкуПоУИ(УИ, ИмяОбъекта) Экспорт

	Результат = Неопределено;
	
	Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Документы[ИмяОбъекта].ПолучитьСсылку(УИ);
	ИначеЕсли Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Справочники[ИмяОбъекта].ПолучитьСсылку(УИ);
	КонецЕсли;
	
	Возврат Результат;
	

КонецФункции // ПолучитьСсылкуПоУИ()


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти