Процедура ПереченьНоменклатурыJSON() Экспорт
	// КомлевАА +_++
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Номенклатура.Наименование,
	|	Номенклатура.Код,
	|	Номенклатура.Артикул
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура";

	РезультатЗапроса = Запрос.Выполнить();

	Если Не РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		МассивТоваров  = Новый Массив;

		Пока Выборка.Следующий() Цикл
			СтруктураОтвета = Новый Структура;
			СтруктураОтвета.Вставить("name", Выборка.Наименование);
			СтруктураОтвета.Вставить("code", Выборка.Код);
			СтруктураОтвета.Вставить("article", Выборка.Артикул);
			МассивТоваров.Добавить(СтруктураОтвета);
		КонецЦикла;
	КонецЕсли;
	Запись = Новый ЗаписьJSON;
	Запись.ОткрытьФайл("\\nas\Backup1c\Комлев\Товары.json");
	ЗаписатьJSON(Запись, МассивТоваров);
	Запись.Закрыть();
	// КомлевАА ----
КонецПроцедуры

Процедура ВыгрузитьТоварыВJSON() Экспорт
	// КомлевАА +_++
	ЗапросТоваров = Новый Запрос;
		ЗапросТоваров.Текст =
		"ВЫБРАТЬ
		|	СпрИндКод.Владелец.Наименование КАК Наименование,
		|	СпрИндКод.Владелец.Артикул КАК Артикул,
		|	РегистрИндНомер.индкод КАК индкод
		|ИЗ
		|	РегистрСведений.ИндНомер КАК РегистрИндНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ИндКод КАК СпрИндКод
		|		ПО РегистрИндНомер.индкод = СпрИндКод.Ссылка
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		|		ПО РегистрНакопления1Остатки.индкод = РегистрИндНомер.индкод
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток > 0
		|	И РегистрИндНомер.ЕстьФото = ИСТИНА";

		Выборка = ЗапросТоваров.Выполнить().Выбрать();

		МассивТоваров = Новый Массив;
		Пока Выборка.Следующий() Цикл
			СтруктураТоваров = Новый Структура;
			СтруктураТоваров.Вставить("name", Строка(Выборка.Наименование));
			СтруктураТоваров.Вставить("article", Строка(Выборка.Артикул));
			СтруктураТоваров.Вставить("id", Строка(Выборка.индкод));
			МассивТоваров.Добавить(СтруктураТоваров);
		КонецЦикла;
		Запись = Новый ЗаписьJSON;
		Запись.ОткрытьФайл("\\nas\Backup1c\common\verified_products.json");
		ЗаписатьJSON(Запись, МассивТоваров);
		Запись.Закрыть();
		// КомлевАА ---
КонецПроцедуры

#Область ПрограммныйИнтерфейс
Функция Просклонять(Слово, Падеж) Экспорт

	Возврат дт_ОбщегоНазначенияПовтИсп.Просклонять(Слово, Падеж);

КонецФункции

Функция ПолучитьСуммуДокументов(Знач Коллекция) Экспорт

	Возврат дт_ОбщегоНазначения.ПолучитьСуммуДокументов(Коллекция);

КонецФункции // ПолучитьСуммуДокументов()

Функция ПолучитьСсылкуПоУИ(УИ, ИмяОбъекта) Экспорт

	Результат = Неопределено;
	
	Если Метаданные.Документы.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Документы[ИмяОбъекта].ПолучитьСсылку(УИ);
	ИначеЕсли Метаданные.Справочники.Найти(ИмяОбъекта) <> Неопределено Тогда
		Результат = Справочники[ИмяОбъекта].ПолучитьСсылку(УИ);
	КонецЕсли;
	
	Возврат Результат;
	

КонецФункции // ПолучитьСсылкуПоУИ()


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти