#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



Функция ПолучитьПоказателиПроекта(Ссылка) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДокументыПоПроектам.Сумма КАК СуммаРасход,
		|	0 КАК СуммаДоход,
		|	0 КАК СуммаДоходПотенциальный
		|ИЗ
		|	ЖурналДокументов.ДокументыПоПроектам КАК ДокументыПоПроектам
		|ГДЕ
		|	ДокументыПоПроектам.Проект = &Проект
		|	И ДокументыПоПроектам.Тип = ТИП(Документ.Расходы)
		|	И ДокументыПоПроектам.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	ДокументыПоПроектам.Сумма КАК Сумма,
		|	0
		|ИЗ
		|	ЖурналДокументов.ДокументыПоПроектам КАК ДокументыПоПроектам
		|ГДЕ
		|	ДокументыПоПроектам.Проект = &Проект
		|	И ДокументыПоПроектам.Тип = ТИП(Документ.ПриходДенегНаСчет)
		|	И ДокументыПоПроектам.Проведен
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	0,
		|	0,
		|	ДокументыПоПроектам.Сумма КАК Сумма
		|ИЗ
		|	ЖурналДокументов.ДокументыПоПроектам КАК ДокументыПоПроектам
		|ГДЕ
		|	ДокументыПоПроектам.Проект = &Проект
		|	И ДокументыПоПроектам.Тип В (ТИП(Документ.ПродажаЗапчастей), ТИП(Документ.ЗаказНаряд))
		|	И ДокументыПоПроектам.Проведен";
	
	Запрос.УстановитьПараметр("Проект", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Результат = Новый Структура("СуммаДоход,СуммаДоходПотенциальный,СуммаРасход", 0, 0, 0);
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Результат.СуммаДоход = Результат.СуммаДоход + ВыборкаДетальныеЗаписи.СуммаДоход;
		Результат.СуммаДоходПотенциальный = Результат.СуммаДоходПотенциальный + ВыборкаДетальныеЗаписи.СуммаДоходПотенциальный;
		Результат.СуммаРасход = Результат.СуммаРасход + ВыборкаДетальныеЗаписи.СуммаРасход;
	КонецЦикла;
	
	Результат.Вставить("СуммаПрибыль", Результат.СуммаДоход - Результат.СуммаРасход);
	Результат.Вставить("СуммаПрибыльПотенциальная", Результат.СуммаДоходПотенциальный - Результат.СуммаРасход);
	Возврат Результат;

КонецФункции


#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли