
&НаКлиенте
Процедура РассичтатьСуммыДокумента()

	///+ГомзМА 06.07.2023
	Объект.СуммаЕвро 	= Объект.СтоимостьАвтоЕвро + Объект.СтоимостьДоставкиИзСтраны + Объект.ДополнительныеРасходы;
	Объект.СуммаРубли = Объект.СтоимостьАвтоРубли + Объект.СтоимостьДоставкиПоРоссии;
	///-ГомзМА 06.07.2023

КонецПроцедуры

&НаКлиенте
Процедура СтоимостьАвтоЕвроПриИзменении(Элемент)
	
	///+ГомзМА 06.07.2023
	КонвертироватьЕвроВРубли();
	РассичтатьСуммыДокумента();
	///-ГомзМА 06.07.2023
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьАвтоРублиПриИзменении(Элемент)
		
	///+ГомзМА 06.07.2023
	РассичтатьСуммыДокумента();
	///-ГомзМА 06.07.2023
		
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьДоставкиИзСтраныПриИзменении(Элемент)
		
	///+ГомзМА 06.07.2023
	РассичтатьСуммыДокумента();
	///-ГомзМА 06.07.2023
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьДоставкиПоРоссииПриИзменении(Элемент)
		
	///+ГомзМА 06.07.2023
	РассичтатьСуммыДокумента();
	///-ГомзМА 06.07.2023
	
КонецПроцедуры

&НаКлиенте
Процедура СтоимостьУслугиРастоможниПриИзменении(Элемент)
		
	///+ГомзМА 06.07.2023
	РассичтатьСуммыДокумента();
	///-ГомзМА 06.07.2023
	
КонецПроцедуры

&НаКлиенте
Процедура СтранаПокупкиПриИзменении(Элемент)
		
	///+ГомзМА 06.07.2023
	ПолучитьСтоимостьДоставки();
	РассичтатьСуммыДокумента();
	///-ГомзМА 06.07.2023
	
КонецПроцедуры

&НаСервере
Процедура ПолучитьСтоимостьДоставки()

	///+ГомзМА 06.07.2023	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Страны.СтоимостьДоставки КАК СтоимостьДоставки
		|ИЗ
		|	Справочник.Страны КАК Страны
		|ГДЕ
		|	Страны.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.СтранаПокупки);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Объект.СтоимостьДоставкиИзСтраны = РезультатЗапроса.СтоимостьДоставки;
	///-ГомзМА 06.07.2023


КонецПроцедуры


&НаКлиенте
Процедура КурсЕвроКРублюПриИзменении(Элемент)
	
	///+ГомзМА 12.07.2023
	КонвертироватьЕвроВРубли();
	///-ГомзМА 12.07.2023
	
КонецПроцедуры

&НаКлиенте
Процедура КонвертироватьЕвроВРубли()
	
	//Волков ИО 17.01.24 ++ 
	////+ГомзМА 12.07.2023
	//Объект.СтоимостьАвтоРубли = Объект.СтоимостьАвтоЕвро * Объект.КурсЕвроКРублю;
	////-ГомзМА 12.07.2023   
	
	ИтогСуммаАвтоВВалюте = Объект.СтоимостьАвтоЕвро + Объект.СтоимостьДоставкиИзСтраны + Объект.ДополнительныеРасходы;
	Объект.СтоимостьАвтоРубли = ИтогСуммаАвтоВВалюте * Объект.КурсЕвроКРублю;
	//Волков ИО 17.01.24 --

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ГомзМА 12.07.2023
	Если НЕ ЗначениеЗаполнено(Объект.КурсЕвроКРублю) Тогда
		Объект.КурсЕвроКРублю = ПолучитьКурсВалюты(Справочники.Валюты.Евро);
	КонецЕсли;
	///-ГомзМА 12.07.2023
	
КонецПроцедуры

&НаСервере
Функция ПолучитьКурсВалюты(Валюта)

	///+ГомзМА 12.07.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	КурсыВалютСрезПоследних.Валюта КАК Валюта,
		|	КурсыВалютСрезПоследних.Курс КАК Курс
		|ИЗ
		|	РегистрСведений.КурсыВалют.СрезПоследних КАК КурсыВалютСрезПоследних
		|ГДЕ
		|	КурсыВалютСрезПоследних.Валюта = &Валюта";
	
	Запрос.УстановитьПараметр("Валюта", Валюта);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Возврат РезультатЗапроса.Курс;
	///-ГомзМА 12.07.2023

КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИтогСуммаАвтоВВалюте = Объект.СтоимостьАвтоЕвро + Объект.СтоимостьДоставкиИзСтраны + Объект.ДополнительныеРасходы;
	Объект.СтоимостьАвтоРубли = ИтогСуммаАвтоВВалюте * Объект.КурсЕвроКРублю;
	
КонецПроцедуры

