
&НаСервере
Функция СсылкаКатегорияВидРасхода3()
	
 Запрос = Новый Запрос;
 Запрос.Текст =
 	"ВЫБРАТЬ
 	|	ВидыРасходов_3.Код КАК Код
 	|ИЗ
 	|	Справочник.ВидыРасходов_3 КАК ВидыРасходов_3
 	|ГДЕ
 	|	ВидыРасходов_3.Код = &Код";
 Запрос.УстановитьПараметр("Код","000000001");
 РезультатЗапроса = Запрос.Выполнить();
 
 ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
 
 Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
 	Возврат ВыборкаДетальныеЗаписи.Код;
 КонецЦикла;
	
	
КонецФункции

Функция СсылкаРодительФилиала()

	РодительКатегории 	= объект.Родитель; 	
	РодительФилиалаКод		= РодительКатегории.Родитель.Код;
	
	Возврат РодительФилиалаКод; 
	
КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Если СсылкаРодительФилиала() = СсылкаКатегорияВидРасхода3()  Тогда
		Элементы.План.Видимость = Истина; 
	Иначе 
		Элементы.План.Видимость = Ложь; 
	КонецЕсли; 

КонецПроцедуры