
&НаКлиенте
Процедура Поиск1(Команда)
	Фильтр();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьПоиск();
КонецПроцедуры

&НаСервере
Функция РазбитьСтрокуНаМассивПодстрок(ИсходнаяСтрока,РазделительСтрок)
   СтрокаДляРазбора = ИсходнаяСтрока;
   СтрокаДляРазбора = СтрЗаменить(СтрокаДляРазбора, РазделительСтрок, Символы.ПС);
   МассивСтрок = новый Массив;
   КолвоСтрок = СтрЧислоСтрок(СтрокаДляРазбора);
   Для НомСтр = 1 По КолвоСтрок Цикл
      МассивСтрок.Добавить(СтрПолучитьСтроку(СтрокаДляРазбора, НомСтр));
  КонецЦикла;
   Возврат МассивСтрок;
КонецФункции

&НаСервере
Функция Фильтр() Экспорт
	Перем а;
	Мас = РазбитьСтрокуНаМассивПодстрок(Поиск," ");
	Кол = Мас.Количество();
	Коды = Новый Массив();
	Запрос = Новый Запрос();
	ПоискПо = "ГДЕ "; 
Если Кол > 0 Тогда
		а=0;
		ПоискПо = ПоискПо + " ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникКлиенты.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникКлиенты.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;
	
Если Кол > 0 Тогда
		а=0;
		ПоискПо = ПоискПо + " ИЛИ ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникКлиенты.ФИО ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникКлиенты.ФИО ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;

	Если Кол > 0 Тогда
		а=0;
		ПоискПо = ПоискПо + " ИЛИ ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникКлиенты.Телефон ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникКлиенты.Телефон ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;
	
	Список.ТекстЗапроса = "ВЫБРАТЬ
	                      |	СправочникКлиенты.Ссылка,
	                      |	СправочникКлиенты.ВерсияДанных,
	                      |	СправочникКлиенты.ПометкаУдаления,
	                      |	СправочникКлиенты.Предопределенный,
	                      |	СправочникКлиенты.Код,
	                      |	СправочникКлиенты.Наименование,
	                      |	СправочникКлиенты.ФИО,
	                      |	СправочникКлиенты.Телефон,
	                      |	СправочникКлиенты.Страна,
	                      |	СправочникКлиенты.Город,
	                      |	СправочникКлиенты.Скидка,
	                      |	СправочникКлиенты.Комментарий,
	                      |	СправочникКлиенты.ПолноеНаименование,
	                      |	СправочникКлиенты.ИНН,
	                      |	СправочникКлиенты.КПП,
	                      |	СправочникКлиенты.КодПоОКПО,
	                      |	СправочникКлиенты.ЮридическийАдрес,
	                      |	СправочникКлиенты.ФактическийАдрес,
	                      |	СправочникКлиенты.РеквизитТелефон
	                      |ИЗ
	                      |	Справочник.Клиенты КАК СправочникКлиенты " + ПоискПо;
КонецФункции

&НаСервере
Процедура ОчиститьПоиск()
	Список.ТекстЗапроса = "ВЫБРАТЬ
	                      |	СправочникКлиенты.Ссылка,
	                      |	СправочникКлиенты.ВерсияДанных,
	                      |	СправочникКлиенты.ПометкаУдаления,
	                      |	СправочникКлиенты.Предопределенный,
	                      |	СправочникКлиенты.Код,
	                      |	СправочникКлиенты.Наименование,
	                      |	СправочникКлиенты.ФИО,
	                      |	СправочникКлиенты.Телефон,
	                      |	СправочникКлиенты.Страна,
	                      |	СправочникКлиенты.Город,
	                      |	СправочникКлиенты.Скидка,
	                      |	СправочникКлиенты.Комментарий,
	                      |	СправочникКлиенты.ПолноеНаименование,
	                      |	СправочникКлиенты.ИНН,
	                      |	СправочникКлиенты.КПП,
	                      |	СправочникКлиенты.КодПоОКПО,
	                      |	СправочникКлиенты.ЮридическийАдрес,
	                      |	СправочникКлиенты.ФактическийАдрес,
	                      |	СправочникКлиенты.РеквизитТелефон
	                      |ИЗ
	                      |	Справочник.Клиенты КАК СправочникКлиенты ";
КонецПроцедуры

&НаКлиенте
Процедура ПокупкиКлиента(Команда)
	// Вставить содержимое обработчика.
	ф = ПолучитьФорму("Обработка.ПокупкиКлиентов.Форма.Форма");
	ф.Клиент2 =  КлиентЭл(Элементы.Список.ТекущаяСтрока.Код);
	ф.откК2 = Истина;
	ф.ОткрытьМодально();

КонецПроцедуры

&НаСервере
Функция КлиентЭл(Код)
	Возврат Справочники.Клиенты.НайтиПоКоду(Код);
КонецФункции
