
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
//	КомментарийАудитора = "Обращение:" + Символы.ПС + "Замечание:" + Символы.ПС + "Комментарий:" + Символы.ПС + "Рекомендация:";
КонецПроцедуры

Процедура ПередЗаписью(Отказ, Замещение)
	
	///+ГомзМА 03.03.2023
	Если ОбменДанными.Загрузка Тогда
		Возврат;	
	КонецЕсли;
	///-ГомзМА 03.03.2023
	
	///+ГомзМА 02.03.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(ЗаписиЗвонков.IDКод, 0) КАК IDКод,
	|	ЗаписиЗвонков.НомерТелефона КАК НомерТелефона,
	|	ЗаписиЗвонков.Дата КАК Дата
	|ИЗ
	|	РегистрСведений.ЗаписиЗвонков КАК ЗаписиЗвонков
	|
	|УПОРЯДОЧИТЬ ПО
	|	IDКод УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		Для каждого Стр Из ЭтотОбъект Цикл
			Если НЕ ЗначениеЗаполнено(Стр.IDКод) Тогда
				Стр.IDКод = РезультатЗапроса.IDКод + 1;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	///-ГомзМА 02.03.2023

КонецПроцедуры
