
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОтданоСМашины Приход
	Если Нам > 0 Тогда
		Движения.ОтданоСМашины.Записывать = Истина;
		Движение = Движения.ОтданоСМашины.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Машина = Машина;
		Движение.Кто = 2;
		Движение.Сумма = Нам;
	КонецЕсли;
	Если Марату > 0 Тогда
		Движения.ОтданоСМашины.Записывать = Истина;
		Движение = Движения.ОтданоСМашины.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Машина = Машина;
		Движение.Кто = 1;
		Движение.Сумма = Марату;
	КонецЕсли;
	
	Если Artem > 0 Тогда
		Движения.ОтданоСМашины.Записывать = Истина;
		Движение = Движения.ОтданоСМашины.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Машина = Машина;
		Движение.Кто = 3;
		Движение.Сумма = Artem;
	КонецЕсли;
	
	тДата = '20160101';
	Если Дата > тДата Тогда		
		Если Нам > 0 Тогда
			Движения.ВыводС1Января.Записывать = ИСТИНА;
			Движение = Движения.ВыводС1Января.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		    Движение.Период = Дата;
	        Движение.Кто = 2;
			Движение.Сумма = Нам;
		КонецЕсли;
		
		Если МаратуНаличкой > 0 Тогда
			Движения.ВыводС1Января.Записывать = ИСТИНА;
			Движение = Движения.ВыводС1Января.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		    Движение.Период = Дата;
	        Движение.Кто = 1;
			Движение.Сумма = МаратуНаличкой;
		КонецЕсли;
	КонецЕсли;	

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
