
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ГомзМА 13.04.2023
	ИнвентарныеНомера.Параметры.УстановитьЗначениеПараметра("ДокументПоступления", Объект.Ссылка);
	///-ГомзМА 13.04.2023
	
КонецПроцедуры


&НаКлиенте
Процедура СписокТМЦТМЦПриИзменении(Элемент)
	
	ТекСтрока = Элементы.СписокТМЦ.ТекущиеДанные;
		
	Если НЕ ЗначениеЗаполнено(ТекСтрока.Количество) Тогда
		ТекСтрока.Количество = 1;
	КонецЕсли;
	ТекСтрока.Склад = Объект.Склад;
	Код        	 	= РаботаСДокументамиТМЦВызовСервера.ПолучениеКодаТМЦ(ТекСтрока.ТМЦ);

	ТекСтрока.Код = Код;
	ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
	
	СписокТМЦТМЦПриИзмененииНаСервере(ТекСтрока.ТипУчета);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокТМЦКоличествоПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("СписокТМЦ", "Количество");
КонецПроцедуры

&НаКлиенте
Процедура СписокТМЦЦенаПриИзменении(Элемент)
	ОбработкаИзмененияСтроки("СписокТМЦ", "Цена");
КонецПроцедуры


&НаСервере
Процедура СписокТМЦТМЦПриИзмененииНаСервере(ТипУчета)

	///+ГомзМА 26.04.2023
	ТипУчета = Перечисления.ТипУчетаТМЦ.УчестьКомплектом;
	///-ГомзМА 26.04.2023

КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаКлиенте
Процедура ОбработкаИзмененияСтроки(ИмяТабличнойЧасти, Поле = Неопределено, ДанныеСтроки = Неопределено) Экспорт
	
	ТекДанные = ?(ДанныеСтроки = Неопределено, Элементы[ИмяТабличнойЧасти].ТекущиеДанные, ДанныеСтроки);
	
	Если Поле = "Сумма" Тогда
		Если ТекДанные.Количество <> 0 Тогда
			ТекДанные.Цена = ТекДанные.Сумма / ТекДанные.Количество;
		КонецЕсли;	
	Иначе	
		ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество;
	КонецЕсли;
	
КонецПроцедуры // ОбработкаИзмененияСтроки()

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Элементы.ИнвентарныеНомера.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ИнвентарныеНомераВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ГомзМА 22.05.2023
	ТекСтрока = Элементы.ИнвентарныеНомера.ТекущиеДанные;
	Если Поле = Элементы.ИнвентарныеНомераСсылка Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Ссылка;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Справочник.ИнвентарныеНомера.Форма.ФормаЭлемента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///+ГомзМА 22.05.2023
	
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	
	///+ГомзМА 28.07.2023
	ИнвентарныеНомера.Параметры.УстановитьЗначениеПараметра("ДокументПоступления", Объект.Ссылка);
	///-ГомзМА 28.07.2023
	
КонецПроцедуры


&НаКлиенте
Процедура СчетПриИзменении(Элемент)
	
	///+ГомзМА 29.09.2023
	СчетПриИзмененииНаСервере();
	///-ГомзМА 29.09.2023
	
КонецПроцедуры


&НаСервере
Процедура СчетПриИзмененииНаСервере()
	
	///+ГомзМА 29.09.2023
	Объект.Организация = Объект.Счет.Владелец;
	///-ГомзМА 29.09.2023
	
КонецПроцедуры


#КонецОбласти






