
&НаКлиенте
Процедура Печать(Команда)
	
	ТабДокумент = ПечатьСервер();
	
	ТабДокумент.Показать();
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПечатьСервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
	ТабДокумент.Вывести(ОбластьМакета);
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ТабДокумент.Вывести(ОбластьМакета);
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Таблица1 = ПолучитьТаблицу();
	
	Для Каждого строка1 Из Таблица1 Цикл
		Если СтрДлина(СокрЛП(строка1.Комментарий)) < 5 Тогда
			Продолжить;
		КонецЕсли;
		Строка.Параметры.Код = строка1.Код;
		Строка.Параметры.Название = строка1.Наименование;
		Строка.Параметры.Телефон = строка1.Телефон;
		Строка.Параметры.Спрос = строка1.Комментарий;
		ТабДокумент.Вывести(Строка);
	КонецЦикла;

	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()


&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.НужныЗапчасти.ПолучитьМакет(название);
КонецФункции

&НаСервере
Функция ПолучитьТаблицу()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Клиенты.Телефон,
	               |	Клиенты.Комментарий,
	               |	Клиенты.Код,
	               |	Клиенты.Наименование
	               |ИЗ
	               |	Справочник.Клиенты КАК Клиенты";
	Реультат = Запрос.Выполнить();
    Возврат Реультат.Выгрузить();
КонецФункции


