
&НаКлиенте
Процедура ВыбратьФайл(Команда)
	// Вставить содержимое обработчика.
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Текст = "ru = ""Текст""; en = ""Text""";
	Фильтр = НСтр(Текст)+"(*.jpg)|*.jpg|(*.jpeg)|*.jpeg|(*.png)|*.png";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файл";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	    Для Каждого ИмяФайла Из МассивФайлов Цикл
	        ВыбФайл = Новый Файл(ИмяФайла);
			МояКартинка = Новый ДвоичныеДанные(ИмяФайла);
			Элементы.картинка.Картинка = Новый Картинка(ИмяФайла);
             УстановитьПуть(ИмяФайла);
			 	    КонецЦикла;
	Иначе
	    Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
	    Предупреждение(НСтр(Текст));
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура УстановитьПуть(имяфайла)
	ПутьККартинке = имяфайла;
	МояКартинка = Новый ДвоичныеДанные(имяфайла);
	Элементы.картинка.Картинка = Новый Картинка(имяфайла); 
КонецПроцедуры

