



&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимостьДоступность();
КонецПроцедуры


&НаКлиенте
Процедура дт_ИспользоватьИнтеграциюМоиЗвонкиПриИзменении(Элемент)
	УстановитьВидимостьДоступность();
КонецПроцедуры

&НаКлиенте
Процедура ИспользоватьКопейкиВСуммах(Команда)
	
	ОткрытьФорму("РегистрСведений.дт_ИспользоватьКопейки.ФормаСписка", , ЭтаФорма, ЭтаФорма.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура дт_КаталогКартинокТМЦНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = НаборКонстант.дт_КаталогКартинокТМЦ;
	Диалог.Заголовок = "Выбрать каталог";
	Если Диалог.Выбрать() Тогда
		НаборКонстант.дт_КаталогКартинокТМЦ = Диалог.Каталог;
	КонецЕсли;
		
КонецПроцедуры

&НаКлиенте
Процедура дт_КаталогКартинокТоваровНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Каталог = НаборКонстант.дт_КаталогКартинокТоваров;
	Диалог.Заголовок = "Выбрать каталог";
	Если Диалог.Выбрать() Тогда
		НаборКонстант.дт_КаталогКартинокТоваров = Диалог.Каталог;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура УстановитьВидимостьДоступность()
	Элементы.ГруппаМоиЗвонки.Видимость = НаборКонстант.дт_ИспользоватьИнтеграциюМоиЗвонки;
КонецПроцедуры