

Функция СписокЗначениеМесяц() Экспорт
	сп = Новый СписокЗначений;
	сп.Вставить(0,1,"Январь");
	сп.Вставить(1,2,"Февраль");
	сп.Вставить(2,3,"Март");
	сп.Вставить(3,4,"Апрель");
	сп.Вставить(4,5,"Май");
	сп.Вставить(5,6,"Июнь");
	сп.Вставить(6,7,"Июль");
	сп.Вставить(7,8,"Август");
	сп.Вставить(8,9,"Сентябрь");
	сп.Вставить(9,10,"Октябрь");
	сп.Вставить(10,11,"Ноябрь");
	сп.Вставить(11,12,"Декабрь");
	Возврат сп;
КонецФункции

Функция СписокЗначениеГод() Экспорт
	сп = Новый СписокЗначений;
	сп.Вставить(0,2011,"2011");
	сп.Вставить(1,2012,"2012");
	сп.Вставить(2,2013,"2013");
	сп.Вставить(3,2014,"2014");
	сп.Вставить(4,2015,"2015");
	возврат сп;
КонецФункции

	