
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	СтруктураДополнительныхПараметров = Новый Структура("ЗаголовокФормы", "Как быстро и просто создать факсимильную подпись и печать?");
	
	ПараметрыКомандыПечати = Новый Массив;
	ПараметрыКомандыПечати.Добавить(ПараметрКоманды);
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати("Справочник.Организация", "НапечататьПомощникРаботыФаксимильнойПечати", ПараметрыКомандыПечати, ПараметрыВыполненияКоманды, СтруктураДополнительныхПараметров);
	
КонецПроцедуры
