

&НаКлиенте
Процедура СписокОкончаниеПеретаскивания(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка)
	
	//Для каждого ПервоначальныйРодитель Из МассивПервоначальныхРодителей Цикл
		ПроверитьИОбнулитьСуммы(МассивПервоначальныхРодителей);
	//КонецЦикла;
	ПерерасчетСумм(ПараметрыПеретаскивания.Значение);
	Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере
Процедура ПерерасчетСумм(МассивНаименованийФОТ)
		
	Для каждого НаименованиеФот Из МассивНаименованийФОТ Цикл
		Родитель = НаименованиеФот.Родитель;
		
		Пока НЕ Родитель = Справочники.ФОТ.ПустаяСсылка() Цикл
			РодительОбъект = Родитель.ПолучитьОбъект();
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	ЕСТЬNULL(СУММА(ФОТ.ЗПФакт), 0) КАК ЗПФакт,
			|	ЕСТЬNULL(СУММА(ФОТ.ОкладФакт), 0) КАК ОкладФакт,
			|	ЕСТЬNULL(СУММА(ФОТ.МотивацияФакт), 0) КАК МотивацияФакт,
			|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗППлан), 0) КАК СредняяЗППлан,
			|	ЕСТЬNULL(СУММА(ФОТ.ОкладПлан), 0) КАК ОкладПлан,
			|	ЕСТЬNULL(СУММА(ФОТ.МотивацияПлан), 0) КАК МотивацияПлан,
			|	ЕСТЬNULL(СУММА(ФОТ.НижнийУровеньЗП), 0) КАК НижнийУровеньЗП,
			|	ЕСТЬNULL(СУММА(ФОТ.СреднийУровеньЗП), 0) КАК СреднийУровеньЗП,
			|	ЕСТЬNULL(СУММА(ФОТ.ВерхнийУровеньЗП), 0) КАК ВерхнийУровеньЗП,
			|	ЕСТЬNULL(СУММА(ФОТ.КоличествоСотрудников), 0) КАК КоличествоСотрудников
			|ИЗ
			|	Справочник.ФОТ КАК ФОТ
			|ГДЕ
			|	ФОТ.Родитель = &Родитель";
			
			Запрос.УстановитьПараметр("Родитель", Родитель);
			
			РезультатЗапроса = Запрос.Выполнить().Выбрать();
			
			РезультатЗапроса.Следующий();
			
			РодительОбъект.ЗПФакт = РезультатЗапроса.ЗПФакт;
			РодительОбъект.ОкладФакт = РезультатЗапроса.ОкладФакт;
			РодительОбъект.МотивацияФакт = РезультатЗапроса.МотивацияФакт;
			РодительОбъект.СредняяЗППлан = РезультатЗапроса.СредняяЗППлан;
			РодительОбъект.ОкладПлан = РезультатЗапроса.ОкладПлан;
			РодительОбъект.МотивацияПлан = РезультатЗапроса.МотивацияПлан;
			РодительОбъект.НижнийУровеньЗП = РезультатЗапроса.НижнийУровеньЗП;
			РодительОбъект.СреднийУровеньЗП = РезультатЗапроса.СреднийУровеньЗП;
			РодительОбъект.ВерхнийУровеньЗП = РезультатЗапроса.ВерхнийУровеньЗП;
			РодительОбъект.КоличествоСотрудников = РезультатЗапроса.КоличествоСотрудников;
			
			Родитель = РодительОбъект.Родитель;
			
			РодительОбъект.Записать();
		КонецЦикла;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	
	МассивРодителей = Новый Массив;
	Для каждого НаименованиеФот Из ПараметрыПеретаскивания.Значение Цикл
		ПервоначальныйРодитель = ПолучитьПервоначальногоРодителя(НаименованиеФот);
		МассивРодителей.Добавить(ПервоначальныйРодитель);
		МассивПервоначальныхРодителей = ПервоначальныйРодитель;
		//ПроверитьИОбнулитьСуммы(ПервоначальныйРодитель);
	КонецЦикла;
	//МассивПервоначальныхРодителей = МассивРодителей;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьПервоначальногоРодителя(НаименованиеФот)

	Результат = НаименованиеФот.Родитель;
	
	Возврат Результат;

КонецФункции

&НаСервере
Процедура ПроверитьИОбнулитьСуммы(ПервоначальныйРодитель)
	
	Если НЕ ПервоначальныйРодитель.Назначение = Перечисления.НазначенияФОТ.ВакантноеМесто Тогда
		
		МассивНаименованийФОТ = Новый Массив;
		МассивНаименованийФОТ.Добавить(ПервоначальныйРодитель);
		
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ФОТ.ЗПФакт), 0) КАК ЗПФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.ОкладФакт), 0) КАК ОкладФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияФакт), 0) КАК МотивацияФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗППлан), 0) КАК СредняяЗППлан,
		|	ЕСТЬNULL(СУММА(ФОТ.ОкладПлан), 0) КАК ОкладПлан,
		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияПлан), 0) КАК МотивацияПлан,
		|	ЕСТЬNULL(СУММА(ФОТ.НижнийУровеньЗП), 0) КАК НижнийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.СреднийУровеньЗП), 0) КАК СреднийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.ВерхнийУровеньЗП), 0) КАК ВерхнийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.КоличествоСотрудников), 0) КАК КоличествоСотрудников
		|ИЗ
		|	Справочник.ФОТ КАК ФОТ
		|ГДЕ
		|	ФОТ.Родитель = &Родитель";
		
		Запрос.УстановитьПараметр("Родитель", ПервоначальныйРодитель);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		РезультатЗапроса.Следующий();
		РодительОбъект = ПервоначальныйРодитель.ПолучитьОбъект();
		Если НЕ (РезультатЗапроса.ЗПФакт > 0 ИЛИ
				 РезультатЗапроса.ОкладФакт > 0 ИЛИ
				 РезультатЗапроса.МотивацияФакт > 0 ИЛИ
				 РезультатЗапроса.СредняяЗППлан > 0 ИЛИ
				 РезультатЗапроса.ОкладПлан > 0 ИЛИ
				 РезультатЗапроса.МотивацияПлан > 0 ИЛИ
				 РезультатЗапроса.НижнийУровеньЗП > 0 ИЛИ
				 РезультатЗапроса.СреднийУровеньЗП > 0 ИЛИ
				 РезультатЗапроса.ВерхнийУровеньЗП > 0 ИЛИ
				 РезультатЗапроса.КоличествоСотрудников > 0) Тогда
			
			РодительОбъект.ЗПФакт = 0;
			РодительОбъект.ОкладФакт = 0;
			РодительОбъект.МотивацияФакт = 0;
			РодительОбъект.СредняяЗППлан = 0;
			РодительОбъект.ОкладПлан = 0;
			РодительОбъект.МотивацияПлан = 0;
			РодительОбъект.НижнийУровеньЗП = 0;
			РодительОбъект.СреднийУровеньЗП = 0;
			РодительОбъект.ВерхнийУровеньЗП = 0;
			РодительОбъект.КоличествоСотрудников = 0;
			
			РодительОбъект.Записать();
			
			ПерерасчетСумм(МассивНаименованийФОТ);
		Иначе
			РодительОбъект.ЗПФакт = РезультатЗапроса.ЗПФакт;
			РодительОбъект.ОкладФакт = РезультатЗапроса.ОкладФакт;
			РодительОбъект.МотивацияФакт = РезультатЗапроса.МотивацияФакт;
			РодительОбъект.СредняяЗППлан = РезультатЗапроса.СредняяЗППлан;
			РодительОбъект.ОкладПлан = РезультатЗапроса.ОкладПлан;
			РодительОбъект.МотивацияПлан = РезультатЗапроса.МотивацияПлан;
			РодительОбъект.НижнийУровеньЗП = РезультатЗапроса.НижнийУровеньЗП;
			РодительОбъект.СреднийУровеньЗП = РезультатЗапроса.СреднийУровеньЗП;
			РодительОбъект.ВерхнийУровеньЗП = РезультатЗапроса.ВерхнийУровеньЗП;
			РодительОбъект.КоличествоСотрудников = РезультатЗапроса.КоличествоСотрудников;
			
			РодительОбъект.Записать();
			//ПерерасчетСумм(МассивНаименованийФОТ);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
