
&НаСервере
Процедура ВыполнитьНастройкуПанелей() Экспорт
	
	///+ГомзМА 02.08.2023
	//Настройки = Новый НастройкиИнтерфейсаКлиентскогоПриложения; 
	//НастройкиСостава = Новый НастройкиСоставаИнтерфейсаКлиентскогоПриложения; 
	//
	//
	//// Очистить настройки состава.
	//НастройкиСостава.Верх.Очистить();
	//НастройкиСостава.Лево.Очистить();
	//НастройкиСостава.Низ.Очистить();
	//НастройкиСостава.Право.Очистить();
	//
	//НастройкиСостава.Верх.Добавить(Новый ЭлементНастройкиСоставаИнтерфейсаКлиентскогоПриложения("ПанельОткрытых")); 
	//Настройки.УстановитьСостав(НастройкиСостава); 
	//ХранилищеСистемныхНастроек.Сохранить("Общее/НастройкиИнтерфейсаКлиентскогоПриложения", "", Настройки);
	///-ГомзМА 02.08.2023
    
КонецПроцедуры