
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//======================================================================================================================

Движения.РегистрАкция10.Записывать = Истина;
Движения.Записать();
Движения.РегистрАкция10.Записывать = Истина;

Счетчик = 0; 
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВыходТоваровИзАкции10.Номенклатура,
	|	ВыходТоваровИзАкции10.Партия,
	|	ВыходТоваровИзАкции10.Количество,
	|	ВыходТоваровИзАкции10.ЦенаАкция,
	|	ВыходТоваровИзАкции10.Склад,
	|	ВыходТоваровИзАкции10.Машина
	|ПОМЕСТИТЬ ВТ_Выход
	|ИЗ
	|	Документ.ВыходТоваровИзАкции10.Товары КАК ВыходТоваровИзАкции10
	|ГДЕ
	|	ВыходТоваровИзАкции10.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Выход.Номенклатура,
	|	ВТ_Выход.Партия,
	|	ВТ_Выход.Количество,
	|	ВТ_Выход.ЦенаАкция,
	|	ВТ_Выход.Склад,
	|	ВТ_Выход.Машина,
	|	РегистрАкция10Остатки.КолвоОстаток
	|ИЗ
	|	ВТ_Выход КАК ВТ_Выход
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрАкция10.Остатки(&Период, индкод В
	|			(ВЫБРАТЬ
	|				Т.Партия
	|			ИЗ
	|				ВТ_Выход КАК Т)) КАК РегистрАкция10Остатки
	|		ПО ВТ_Выход.Партия = РегистрАкция10Остатки.индкод";

Запрос.УстановитьПараметр("Ссылка", Ссылка);
Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());

РезультатЗапроса = Запрос.Выполнить();
ВыборкаТовары = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			 Дефицит = ВыборкаТовары.Количество - ВыборкаТовары.КолвоОстаток;
	       
			Если Дефицит>0 Тогда
	            Отказ = Истина;
	            Сообщение = Новый СообщениеПользователю;
	            Сообщение.Текст = "Номенклатура: "+ВыборкаТовары.Номенклатура + " Партия: " + ВыборкаТовары.Партия + " недостаточно в количестве "+Дефицит+" шт.";
	            Сообщение.Сообщить();
	        КонецЕсли;
	       
	        //  Переход в начало цикла, если были ошибки
	        Если Отказ Тогда
	            Продолжить;
	        КонецЕсли;
	       
	        //  Выполнение движений в регистры
	
				Движение			 = Движения.РегистрАкция10.ДобавитьРасход();
				Движение.Период		 = Дата;
				Движение.Товар		 = ВыборкаТовары.Номенклатура;
				Движение.индкод		 = ВыборкаТовары.Партия;
				Движение.Склад		 = ВыборкаТовары.Склад;
				Движение.машина		 = ВыборкаТовары.машина;
				Движение.Колво		 = ВыборкаТовары.Количество;
				Движение.Цена		 = ВыборкаТовары.ЦенаАкция; 
				
				Счетчик 			 = Счетчик + 1; 
	    КонецЦикла;

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Успех, убрали из акции: "+Счетчик+" ед. товаров."; 
	Сообщение.Сообщить();

//======================================================================================================================
КонецПроцедуры
























