
#Область СлужебныеПроцедурыИФункции

Функция ПолучитьСуммуПродажи(Продажа) Экспорт
	
	///+ГомзМА 29.07.2024
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходДенегНаСчет.Сделка.Ссылка КАК Продажа,
		|	СУММА(ПриходДенегНаСчет.СуммаДокумента) КАК СуммаПриходаДенег
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.Сделка = &Сделка
		|	И ПриходДенегНаСчет.Проведен
		|СГРУППИРОВАТЬ ПО
		|	ПриходДенегНаСчет.Сделка.Ссылка";
	
	Запрос.УстановитьПараметр("Сделка", Продажа);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Попытка
		РезультатЗапроса.Следующий();
		СуммаПриход = Число(РезультатЗапроса.СуммаПриходаДенег);
	Исключение
		СуммаПриход = 0;
	КонецПопытки;

	ЗапросВозврат = Новый Запрос;
	ЗапросВозврат.Текст =
		"ВЫБРАТЬ
		|	СУММА(АктВозврата.ОбщаяСумма) КАК ОбщаяСумма
		|ИЗ
		|	Документ.АктВозврата КАК АктВозврата
		|ГДЕ
		|	АктВозврата.Продажа = &Продажа
		|	И АктВозврата.Проведен";
	
	ЗапросВозврат.УстановитьПараметр("Продажа", Продажа);
	
	РезультатЗапросаВозврат = ЗапросВозврат.Выполнить().Выбрать();
	
	Попытка
		РезультатЗапросаВозврат.Следующий();
		СуммаВозврат = Число(РезультатЗапросаВозврат.ОбщаяСумма);
	Исключение
		СуммаВозврат = 0;
	КонецПопытки;
	
	Результат = СуммаПриход - СуммаВозврат;
	
	Возврат Результат;
	///-ГомзМА 29.07.2024
	
КонецФункции

Функция ПолучитьСписокУчастниковРаботы(Заявка) Экспорт
	
	///+ГомзМА 29.07.2024
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗаказКлиентаОтветственные.Сотрудник,
		|	ЗаказКлиентаОтветственные.Роль
		|ИЗ
		|	Документ.ЗаказКлиента.Ответственные КАК ЗаказКлиентаОтветственные
		|ГДЕ
		|	ЗаказКлиентаОтветственные.Ссылка.Ссылка = &Заявка";
	
	Запрос.УстановитьПараметр("Заявка", Заявка);
	
	Результат = Запрос.Выполнить().Выгрузить();
		
	Возврат Результат;
	///-ГомзМА 29.07.2024
	
КонецФункции

#КонецОбласти
