
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика
	РасчетГрафика();
КонецПроцедуры

&НаСервере
Процедура РасчетГрафика()
	Графики.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	Графики.Очистить();
	запрос = Новый Запрос;
	Если ДатаНачала = '00010101' И ДатаОкончания = '00010101' Тогда
		запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	СУММА(Расходы.Сумма) КАК Сумма,
	               |	Расходы.ВидРасхода
	               |ИЗ
	               |	Документ.Расходы КАК Расходы
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	Расходы.ВидРасхода";
	Иначе
		Если ДатаНачала <> '00010101' И ДатаОкончания = '00010101' Тогда
			запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
			               |	СУММА(Расходы.Сумма) КАК Сумма,
			               |	Расходы.ВидРасхода
			               |ИЗ
			               |	Документ.Расходы КАК Расходы
			               |ГДЕ
			               |	Расходы.Дата >= &Дата
			               |
			               |СГРУППИРОВАТЬ ПО
			               |	Расходы.ВидРасхода";
			запрос.УстановитьПараметр("Дата",ДатаНачала);
		Иначе
			Если ДатаНачала = '00010101' И ДатаОкончания <> '00010101' Тогда
				запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
				               |	СУММА(Расходы.Сумма) КАК Сумма,
				               |	Расходы.ВидРасхода
				               |ИЗ
				               |	Документ.Расходы КАК Расходы
				               |ГДЕ
				               |	Расходы.Дата <= &Дата
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	Расходы.ВидРасхода";
				запрос.УстановитьПараметр("Дата",ДатаОкончания);
			Иначе
				запрос.Текст = "ВЫБРАТЬ  РАЗРЕШЕННЫЕ
				               |	СУММА(Расходы.Сумма) КАК Сумма,
				               |	Расходы.ВидРасхода
				               |ИЗ
				               |	Документ.Расходы КАК Расходы
				               |ГДЕ
				               |	Расходы.Дата >= &Дата1
				               |	И Расходы.Дата <= &Дата2
				               |
				               |СГРУППИРОВАТЬ ПО
				               |	Расходы.ВидРасхода";
				запрос.УстановитьПараметр("Дата1",ДатаНачала);
				запрос.УстановитьПараметр("Дата2",ДатаОкончания);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	рез = запрос.Выполнить().Выгрузить();
	Точка = Графики.УстановитьТочку("Тип Расхода");
	Для Каждого стр из рез Цикл
		Если стр.Сумма > 0 Тогда
			// ++ obrv 11.08.20
			//сер = Графики.УстановитьСерию(стр.ВидРасхода.Наименование);
			сер = Графики.УстановитьСерию(Строка(стр.ВидРасхода));
			// -- obrv 11.08.20
			Графики.УстановитьЗначение(Точка,сер,стр.Сумма);
		КонецЕсли
	КонецЦикла;
	Графики.ОтображатьЛегенду = Истина;
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	РасчетГрафика();
КонецПроцедуры


&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	РасчетГрафика();
КонецПроцедуры

