
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ДатаНачала = Дата(2017,10,31);
	ДатаОкончания = КонецМесяца(ТекущаяДата());
	Посчитать(ДатаНачала, ДатаОкончания);
КонецПроцедуры

&НаСервере
Процедура Посчитать(дата1, дата2)
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаЗапчастей.ИтогоРекв
	               |ИЗ
	               |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	               |ГДЕ
	               |	ПродажаЗапчастей.Проведен = ИСТИНА
	               |	И ПродажаЗапчастей.Оплачено = ИСТИНА
	               |	И ПродажаЗапчастей.Дата >= &Дата1
	               |	И ПродажаЗапчастей.Дата <= &Дата2";
	запрос.УстановитьПараметр("Дата1", дата1);
	запрос.УстановитьПараметр("Дата2", дата2);
	сумма = запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
	Всего = сумма*0.03;
	запрос.Текст ="ВЫБРАТЬ РАЗРЕШЕННЫЕ
	              |	Расходы.Сумма
	              |ИЗ
	              |	Документ.Расходы КАК Расходы
	              |ГДЕ
	              |	Расходы.Проведен = ИСТИНА
	              |	И Расходы.Дата >= &Дата1
	              |	И Расходы.Дата <= &Дата2
	              |	И Расходы.ВидРасхода = &ВидРасхода" ;
	запрос.УстановитьПараметр("ВидРасхода", Справочники.ВидыРасходов.НайтиПоКоду("000000037"));
	запрос.УстановитьПараметр("Дата1", дата1);
	запрос.УстановитьПараметр("Дата2", дата2);
	ВсегоВыплчено =  запрос.Выполнить().Выгрузить().Итог("Сумма");
    ОсталосьВыплатить = Всего -  ВсегоВыплчено;
КонецПроцедуры

&НаКлиенте
Процедура ДатаНачалаПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Посчитать(ДатаНачала, ДатаОкончания);
КонецПроцедуры

&НаКлиенте
Процедура ДатаОкончанияПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Посчитать(ДатаНачала, ДатаОкончания);
КонецПроцедуры
