&НаКлиенте
Перем ВыбраннаяЗапись; //Массив, хранящий отмеченную галочками номенклатуру для отображения в списке
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Список.Параметры.УстановитьЗначениеПараметра("ДатаНач", НачалоМесяца(ТекущаяДата()));
	//Список.Параметры.УстановитьЗначениеПараметра("ДатаКон", КонецМесяца(ТекущаяДата()));
КонецПроцедуры
&НаКлиенте
Процедура ПриОткрытии(Отказ)
		//Инициализация массива
	ВыбраннаяЗапись = Новый Массив;
		//Без параметра, даже пустого, список выдаст ошибку и будет прав 
	//Список.Параметры.УстановитьЗначениеПараметра("ВыбраннаяЗапись", ВыбраннаяЗапись);
КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	//Нас интересует только событие нажатия на чекбокс
	Если Поле = Элементы.Пометка Тогда
		
		СтандартнаяОбработка = Ложь;
		
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			Если ТекущиеДанные.Пометка Тогда
				СнятьПометку(ТекущиеДанные.Ссылка);
			Иначе
				ПоставитьПометку(ТекущиеДанные.Ссылка);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	//Параметр в динамическом списке нужно обновить
	//Список.Параметры.УстановитьЗначениеПараметра("ВыбраннаяЗапись", ВыбраннаяЗапись);
	
	Элементы.Список.Обновить();
КонецПроцедуры

&НаСервере
Процедура СнятьПометку(Запись)
	Док = Запись.получитьОбъект();
    Док.Проверка = Ложь;
	Док.Записать();
КонецПроцедуры

&НаСервере
Процедура ПоставитьПометку(Запись)
Док = Запись.получитьОбъект();
    Док.Проверка = Истина;
	Док.Записать();

КонецПроцедуры

Функция ПолучитьДокАдминистративный(Номер)
	
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Административный.Ссылка КАК Ссылка
	                |ИЗ
	                |	Документ.Административный КАК Административный
	                |ГДЕ
	                |	Административный.Номер = &Номер" ;
	Запрос.УстановитьПараметр("Номер", Номер);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 0 Тогда
	Выборка.Следующий();
	
	Возврат Выборка
КонецЕсли;
КонецФункции
					



