#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Функция получает значения реквизитов выбранного контрагента.
//
// Параметры:
//  Контрагент - СправочникСсылка.Контрагенты - Ссылка на контрагента
//
// Возвращаемое значение:
//  Структура - реквизиты выбранного контрагента
//
Функция РеквизитыКонтрагента(Контрагент) Экспорт
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ВЫРАЗИТЬ(Спр.ПолноеНаименование КАК СТРОКА(255)) КАК НаименованиеПолное,
	|	Спр.ФИО КАК ФИО,
	|	Спр.ИНН КАК ИНН,
	|	Спр.КПП КАК КПП,
	|	Спр.КодПоОКПО КАК КодПоОКПО,
	|	"""" КАК ОГРН,
	|	ЗНАЧЕНИЕ(Перечисление.дт_ТипыКлиентов.ЮрЛицо) КАК ЮрФизЛицо,
	|	Спр.ЮридическийАдрес КАК ЮридическийАдрес,
	|	Спр.ФактическийАдрес КАК ФактическийАдрес,
	|	Спр.Телефон КАК Телефоны,
	|	Спр.Страна2 КАК СтранаДоставки,
	|	Спр.Область КАК РегионДоставки,
	|	Спр.Город2 КАК ГородДоставки,
	|	"""" КАК Паспорт,
	|	"""" КАК Прописка,
	|	Спр.Email КАК Email
	|ИЗ
	|	Справочник.Контрагенты КАК Спр
	|ГДЕ
	|	Спр.Ссылка = &Контрагент");
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СтруктураРеквизитов = Новый Структура("Представление,Наименование,НаименованиеПолное,ИНН,КПП,КодПоОКПО,ОГРН,ЮрФизЛицо,ЮридическийАдрес,ФактическийАдрес,Телефоны,АдресДоставки,Паспорт,Прописка,Email");
	Если Выборка.Следующий() Тогда
		ЗаполнитьЗначенияСвойств(СтруктураРеквизитов, Выборка);
		
		Наименование	= Выборка.НаименованиеПолное;
		
		СтруктураРеквизитов.Представление = Выборка.НаименованиеПолное;
		СтруктураРеквизитов.Наименование = Выборка.НаименованиеПолное;
		
		Если ОбщегоНазначенияУТКлиентСервер.ЭтоИП(Выборка.ЮрФизЛицо) 
			И Не ЗначениеЗаполнено(СтруктураРеквизитов.Наименование) Тогда
			СтруктураРеквизитов.Наименование = "Индивидуальный предприниматель " + Выборка.ФИО;
		КонецЕсли;
		
		СтруктураРеквизитов.НаименованиеПолное = СтруктураРеквизитов.Наименование;
		
		СтруктураРеквизитов.АдресДоставки = ФормированиеПечатныхФорм.АдресДоставки(Выборка);	
	КонецЕсли;
	
	
	Возврат СтруктураРеквизитов;

КонецФункции 


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли


#Область ПоискПоИннИНаименованию

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ПоисковаяСтрока", "%" + Параметры.СтрокаПоиска + "%");
	Запрос.Текст = "ВЫБРАТЬ
		|	Ссылка
		|
		|ИЗ
		|	Справочник.Контрагенты
		|
		|ГДЕ
		|	ИНН ПОДОБНО &ПоисковаяСтрока
		|	ИЛИ Наименование ПОДОБНО &ПоисковаяСтрока
		|
		|";
	
	Массив = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
    ДанныеВыбора = Новый СписокЗначений;
    ДанныеВыбора.ЗагрузитьЗначения(Массив);
    СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти
