
Функция ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад) Экспорт
	
	///+ГомзМА 03.02.2023 (Задача 000002611 от 27.01.2023)
	Результат = Ложь;
	Граница = Новый Граница(Дата, ВидГраницы.Включая);
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РегистрНакопления1Остатки.Товар КАК Товар,
		|	РегистрНакопления1Остатки.Склад КАК Склад,
		|	РегистрНакопления1Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрНакопления1Остатки.индкод КАК индкод,
		|	РегистрНакопления1Остатки.машина КАК машина
		|ИЗ
		|	РегистрНакопления.РегистрНакопления1.Остатки(
		|			&Дата,
		|			Склад = &Склад
		|				И (Товар, индкод, машина) В
		|					(ВЫБРАТЬ
		|						Рас_КомплектовкаНоменклатураСписок.Номенклатураспис КАК Номенклатураспис,
		|						Рас_КомплектовкаНоменклатураСписок.Номенклатураспис.Код КАК НоменклатурасписКод,
		|						Рас_КомплектовкаНоменклатураСписок.Автомобиль КАК Автомобиль
		|					ИЗ
		|						Документ.Рас_Комплектовка.НоменклатураСписок КАК Рас_КомплектовкаНоменклатураСписок
		|					ГДЕ
		|						Рас_КомплектовкаНоменклатураСписок.Ссылка.Ссылка = &Ссылка)) КАК РегистрНакопления1Остатки
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток < 0";
	
	Запрос.УстановитьПараметр("Дата", Граница);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			СтрокаВывода = СтрШаблон("Не хватает товара %1 на складе %2 в количестве %3", Выборка.Товар, Выборка.Склад, -Выборка.КолвоОстаток);
			Сообщить(СтрокаВывода);
		КонецЦикла;
		Результат = Истина;
	КонецЕсли;	
	
	Возврат Результат;
	///-ГомзМА 03.02.2023 (Задача 000002611 от 27.01.2023)
	
КонецФункции //ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад)


Функция ЕстьОтрицательныеОстаткиВерсия2(Ссылка,Дата) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Рас_КомплектовкаНоменклатураСписок.Номенклатураспис КАК Товар,
		|	Рас_КомплектовкаНоменклатураСписок.Партия КАК индкод,
		|	Рас_КомплектовкаНоменклатураСписок.Автомобиль КАК машина,
		|	Рас_КомплектовкаНоменклатураСписок.Склад КАК Склад,
		|	Рас_КомплектовкаНоменклатураСписок.Количество КАК Колво
		|ПОМЕСТИТЬ ВТ_Расскомплектовка
		|ИЗ
		|	Документ.Рас_Комплектовка.НоменклатураСписок КАК Рас_КомплектовкаНоменклатураСписок
		|ГДЕ
		|	Рас_КомплектовкаНоменклатураСписок.Ссылка = &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РегистрНакопления1Остатки.Товар,
		|	РегистрНакопления1Остатки.индкод,
		|	РегистрНакопления1Остатки.Склад,
		|	РегистрНакопления1Остатки.машина,
		|	РегистрНакопления1Остатки.КолвоОстаток
		|ИЗ
		|	РегистрНакопления.РегистрНакопления1.Остатки(&Дата, (Товар, индкод, Склад, машина) В
		|		(ВЫБРАТЬ
		|			Т.Товар КАК Товар,
		|			Т.индкод КАК индкод,
		|			Т.Склад КАК Склад,
		|			Т.машина КАК машина
		|		ИЗ
		|			ВТ_Расскомплектовка КАК Т)) КАК РегистрНакопления1Остатки
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток < 0";
	
	Запрос.УстановитьПараметр("Дата", Новый Граница(Дата, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать(); 

	Если НЕ РезультатЗапроса.Пустой() Тогда 
	
		Пока Выборка.Следующий() Цикл
				СтрокаВывода = СтрШаблон("Не хватает товара %1 на складе %2 в количестве %3", Выборка.Товар, Выборка.Склад, -Выборка.КолвоОстаток);
				Сообщение  = Новый СообщениеПользователю();
				Сообщение.Текст = СтрокаВывода; 
				Сообщение.Сообщить();
		КонецЦикла;

		Результат =  Истина; 
	Иначе 
		Результат =  Ложь; 
	КонецЕсли; 
	
	Возврат Результат;  
КонецФункции























