
&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	РасчетГрафика();
	
КонецПроцедуры

&НаСервере
Функция РасчетГрафика()
	
	таблица1 = Новый ТаблицаЗначений;
	Текст = "ВЫБРАТЬ
	        |	ДобавленоЗапчастейНаДату.дата,
	        |	ДобавленоЗапчастейНаДату.колво
	        |ИЗ
	        |	РегистрСведений.ДобавленоЗапчастейНаДату КАК ДобавленоЗапчастейНаДату
	        |ГДЕ
	        |	ДобавленоЗапчастейНаДату.пользователь = &пользователь";
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ДобавлениеЗапчастей.пользователь
	               |ИЗ
	               |	РегистрНакопления.ДобавлениеЗапчастей КАК ДобавлениеЗапчастей";
	рез = Запрос.Выполнить().Выгрузить();
	м = Новый Массив;
	таблица1.Колонки.Добавить("Дата");
	Для Каждого стр из рез Цикл
		м.Добавить(стр.пользователь);
		таблица1.Колонки.Добавить(стр.пользователь.Наименование);
	КонецЦикла;
	
	Запрос.Текст = Текст;
	Запрос.УстановитьПараметр("пользователь",пользователь);
	
	рез = Запрос.Выполнить().Выгрузить();
	
	Для Каждого стр Из рез Цикл

	КонецЦикла;
		
	возврат таблица1;
КонецФункции

