#Область ОбработчикиСобытийФормы



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПриИзмененииПоказателя();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПоказательПриИзменении(Элемент)
	
	ПриИзмененииПоказателя();
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПриИзмененииПоказателя()
	
	Если ЗначениеЗаполнено(Запись.Показатель) Тогда
		СпособПодсчета = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Показатель, "СпособПодсчета");
	Иначе
		СпособПодсчета = Неопределено;
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	Запись = Форма.Запись;
	Элементы = Форма.Элементы;
	
	Если Форма.СпособПодсчета = ПредопределенноеЗначение("Перечисление.СпособыПодсчетаПоказателей.СрезПоследних") Тогда
		Элементы.Значение.Заголовок = "Целевое значение";
	Иначе
		Элементы.Значение.Заголовок = "План на день";
	КонецЕсли;
	 	
КонецПроцедуры

#КонецОбласти