

&НаСервере
Процедура СортировкаПриИзмененииНаСервере()
	
	///+ГомзМА 31.01.2023 (Задача 000002631 от 31.01.2023)
	Текст = "ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.Ссылка) КАК РегистраторСсылка,
	        |	Продажи.Клиент КАК РегистраторКлиент
	        |ПОМЕСТИТЬ ВТ_КолвоПродаж
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК Продажи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Продажи.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Продажи.Клиент КАК РегистраторКлиент,
	        |	СУММА(Продажи.ИтогоРекв) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_СуммаПродаж
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК Продажи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Продажи.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК Ссылка,
	        |	ЗаказКлиента.Клиент КАК Клиент
	        |ПОМЕСТИТЬ ВТ_Заявки
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказКлиента.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗаказКлиента.Клиент КАК Клиент,
	        |	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаДокумента
	        |ПОМЕСТИТЬ ВТ_СуммаЗаявок
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказКлиента.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДокументДозвон.Ссылка КАК Ссылка,
	        |	ДокументДозвон.ПометкаУдаления КАК ПометкаУдаления,
	        |	ДокументДозвон.Номер КАК Номер,
	        |	ДокументДозвон.Дата КАК Дата,
	        |	ДокументДозвон.Проведен КАК Проведен,
	        |	ДокументДозвон.Исполнитель КАК Исполнитель,
	        |	ДокументДозвон.Автор КАК Автор,
	        |	ДокументДозвон.Статус КАК Статус,
	        |	ДокументДозвон.Клиент КАК Клиент,
	        |	ДокументДозвон.Телефон КАК Телефон,
	        |	ДокументДозвон.Комментарий КАК Комментарий,
	        |	НАЧАЛОПЕРИОДА(ДокументДозвон.ДатаВыполнения, ДЕНЬ) КАК ДатаВыполнения,
	        |	ДокументДозвон.МоментВремени КАК МоментВремени,
	        |	ВТ_Заявки.Ссылка КАК Ссылка1,
	        |	ВТ_КолвоПродаж.РегистраторСсылка КАК РегистраторСсылка,
	        |	ВТ_СуммаЗаявок.СуммаДокумента КАК СуммаДокумента,
	        |	ВТ_СуммаПродаж.Сумма КАК Сумма,
	        |	ВЫРАЗИТЬ(ДокументДозвон.КомментарийАудитора КАК СТРОКА(150)) КАК КомментарийАудитора,
	        |	КОЛИЧЕСТВО(ДокументДозвон.Ссылка) КАК КоличествоЗаписей,
	        |	ВЫБОР
	        |		КОГДА ДокументДозвон.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДозвона.Ожидание)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоОжидание,
	        |	ВЫБОР
	        |		КОГДА ДокументДозвон.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДозвона.Выполнено)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоВыполнено,
	        |	ДокументДозвон.Клиент.Город2 КАК КлиентГород2,
	        |	ДокументДозвон.ДатаПерезвона КАК ДатаПерезвона
	        |ИЗ
	        |	Документ.Дозвон КАК ДокументДозвон
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолвоПродаж КАК ВТ_КолвоПродаж
	        |		ПО ДокументДозвон.Клиент = ВТ_КолвоПродаж.РегистраторКлиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаПродаж КАК ВТ_СуммаПродаж
	        |		ПО ДокументДозвон.Клиент = ВТ_СуммаПродаж.РегистраторКлиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	        |		ПО ДокументДозвон.Клиент = ВТ_Заявки.Клиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаЗаявок КАК ВТ_СуммаЗаявок
	        |		ПО ДокументДозвон.Клиент = ВТ_СуммаЗаявок.Клиент
	        |ГДЕ
	        |	&Условие
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДокументДозвон.Ссылка,
	        |	ДокументДозвон.ПометкаУдаления,
	        |	ДокументДозвон.Номер,
	        |	ДокументДозвон.Дата,
	        |	ДокументДозвон.Проведен,
	        |	ДокументДозвон.Исполнитель,
	        |	ДокументДозвон.Автор,
	        |	ДокументДозвон.Статус,
	        |	ДокументДозвон.Клиент,
	        |	ДокументДозвон.Телефон,
	        |	ДокументДозвон.Комментарий,
	        |	ДокументДозвон.МоментВремени,
	        |	ВТ_Заявки.Ссылка,
	        |	ВТ_КолвоПродаж.РегистраторСсылка,
	        |	ВТ_СуммаЗаявок.СуммаДокумента,
	        |	ВТ_СуммаПродаж.Сумма,
	        |	НАЧАЛОПЕРИОДА(ДокументДозвон.ДатаВыполнения, ДЕНЬ),
	        |	ВЫРАЗИТЬ(ДокументДозвон.КомментарийАудитора КАК СТРОКА(150)),
	        |	ДокументДозвон.Клиент.Город2,
	        |	ДокументДозвон.ДатаПерезвона";
	
	Если Сортировка = "Все" Тогда
		Текст = СтрЗаменить(Текст, "ГДЕ", "");
		Текст = СтрЗаменить(Текст, "&Условие", "");
		Список.ТекстЗапроса = Текст;
	ИначеЕсли Сортировка = "Ожидание" Тогда
		Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Ожидание)");
		Список.ТекстЗапроса = Текст;
	ИначеЕсли Сортировка = "Выполнено" Тогда
		Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Выполнено)");
		Список.ТекстЗапроса = Текст;
		ИначеЕсли Сортировка = "Перезвон" Тогда
		Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Перезвон)");
		Список.ТекстЗапроса = Текст;
	КонецЕсли;
	///-ГомзМА 31.01.2023 (Задача 000002631 от 31.01.2023)
	
	Элементы.Список.Обновить();
	
	///+ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	ПолучитьКоличествоВСоответствииСоСтатусом();
	///-ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	
КонецПроцедуры

Процедура ПолучитьКоличествоВСоответствииСоСтатусом()
	
	///+ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ВсегоКоличество = Результат.Количество(); 
    Количество = ВсегоКоличество;
	

	КоличествоВыполнено = 0;
	КоличествоОжидание = 0;
	Для каждого Строка из Результат Цикл
		Если Строка.Статус = Перечисления.СтатусыДозвона.Ожидание Тогда
				КоличествоОжидание = КоличествоОжидание + Строка.КоличествоОжидание;
				ПроцентОжидание = Окр(100 * КоличествоОжидание / Количество);
		ИначеЕсли Строка.Статус = Перечисления.СтатусыДозвона.Выполнено Тогда
				КоличествоВыполнено = КоличествоВыполнено + Строка.КоличествоВыполнено;
				ПроцентВыполнено = Окр(100 * КоличествоВыполнено / ВсегоКоличество);
		КонецЕсли;
	КонецЦикла;
	
	Количество = ВсегоКоличество;
	Если Сортировка = "Ожидание" Тогда
		Количество = КоличествоОжидание;
		Процент = ПроцентОжидание;
	ИначеЕсли Сортировка = "Выполнено" Тогда
		Количество = КоличествоВыполнено;
		Процент = ПроцентВыполнено;
	КонецЕсли;
	
	Если Сортировка = "Все" Тогда
		Соотношение = СтрШаблон("Выполнено: %1%% / Ожидание: %2%%", ПроцентВыполнено, ПроцентОжидание);
		Элементы.Соотношение.Видимость = Истина;
	Иначе
		Элементы.Соотношение.Видимость = Ложь;
	КонецЕсли;
	///-ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)

КонецПроцедуры


&НаКлиенте
Процедура СортировкаПриИзменении(Элемент)
	
	СортировкаПриИзмененииНаСервере();
		
	Если Сортировка = "Все" Тогда
		Элементы.Процент.Видимость = Ложь;
	Иначе
		Элементы.Процент.Видимость = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	РассчитатьИтоги();
	
КонецПроцедуры

Процедура РассчитатьИтоги()
	
	///+ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	Элементы.Процент.Видимость = Ложь;

    Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	ВсегоКоличество = Результат.Количество(); 
    Количество = ВсегоКоличество;
	///-ГомзМА 31.01.2023 (Задача 000002639 от 01.02.2023)
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Сортировка = "Все";
	
	ПолучитьКоличествоВСоответствииСоСтатусом();
	
КонецПроцедуры


&НаКлиенте
Процедура Обновить(Команда)
	ПолучитьКоличествоВСоответствииСоСтатусом();
КонецПроцедуры

&НаКлиенте
Процедура ПериодПерезвоновПриИзменении(Элемент)

 ПериодПерезвоновПриИзмененииНаСервере();


Элементы.Список.Обновить();

КонецПроцедуры

&НаСервере 
Процедура ПериодПерезвоновПриИзмененииНаСервере()

		///+Сергеев 19.04.2023 
	Текст = "ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Продажи.Ссылка) КАК РегистраторСсылка,
	        |	Продажи.Клиент КАК РегистраторКлиент
	        |ПОМЕСТИТЬ ВТ_КолвоПродаж
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК Продажи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Продажи.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	Продажи.Клиент КАК РегистраторКлиент,
	        |	СУММА(Продажи.ИтогоРекв) КАК Сумма
	        |ПОМЕСТИТЬ ВТ_СуммаПродаж
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК Продажи
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	Продажи.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК Ссылка,
	        |	ЗаказКлиента.Клиент КАК Клиент
	        |ПОМЕСТИТЬ ВТ_Заявки
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказКлиента.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ЗаказКлиента.Клиент КАК Клиент,
	        |	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаДокумента
	        |ПОМЕСТИТЬ ВТ_СуммаЗаявок
	        |ИЗ
	        |	Документ.ЗаказКлиента КАК ЗаказКлиента
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ЗаказКлиента.Клиент
	        |;
	        |
	        |////////////////////////////////////////////////////////////////////////////////
	        |ВЫБРАТЬ
	        |	ДокументДозвон.Ссылка КАК Ссылка,
	        |	ДокументДозвон.ПометкаУдаления КАК ПометкаУдаления,
	        |	ДокументДозвон.Номер КАК Номер,
	        |	ДокументДозвон.Дата КАК Дата,
	        |	ДокументДозвон.Проведен КАК Проведен,
	        |	ДокументДозвон.Исполнитель КАК Исполнитель,
	        |	ДокументДозвон.Автор КАК Автор,
	        |	ДокументДозвон.Статус КАК Статус,
	        |	ДокументДозвон.Клиент КАК Клиент,
	        |	ДокументДозвон.Телефон КАК Телефон,
	        |	ДокументДозвон.Комментарий КАК Комментарий,
	        |	НАЧАЛОПЕРИОДА(ДокументДозвон.ДатаВыполнения, ДЕНЬ) КАК ДатаВыполнения,
	        |	ДокументДозвон.МоментВремени КАК МоментВремени,
	        |	ВТ_Заявки.Ссылка КАК Ссылка1,
	        |	ВТ_КолвоПродаж.РегистраторСсылка КАК РегистраторСсылка,
	        |	ВТ_СуммаЗаявок.СуммаДокумента КАК СуммаДокумента,
	        |	ВТ_СуммаПродаж.Сумма КАК Сумма,
	        |	ВЫРАЗИТЬ(ДокументДозвон.КомментарийАудитора КАК СТРОКА(150)) КАК КомментарийАудитора,
	        |	КОЛИЧЕСТВО(ДокументДозвон.Ссылка) КАК КоличествоЗаписей,
	        |	ВЫБОР
	        |		КОГДА ДокументДозвон.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДозвона.Ожидание)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоОжидание,
	        |	ВЫБОР
	        |		КОГДА ДокументДозвон.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДозвона.Выполнено)
	        |			ТОГДА 1
	        |		ИНАЧЕ 0
	        |	КОНЕЦ КАК КоличествоВыполнено,
	        |	ДокументДозвон.Клиент.Город2 КАК КлиентГород2,
	        |	ДокументДозвон.ДатаПерезвона КАК ДатаПерезвона
	        |ИЗ
	        |	Документ.Дозвон КАК ДокументДозвон
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_КолвоПродаж КАК ВТ_КолвоПродаж
	        |		ПО ДокументДозвон.Клиент = ВТ_КолвоПродаж.РегистраторКлиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаПродаж КАК ВТ_СуммаПродаж
	        |		ПО ДокументДозвон.Клиент = ВТ_СуммаПродаж.РегистраторКлиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Заявки КАК ВТ_Заявки
	        |		ПО ДокументДозвон.Клиент = ВТ_Заявки.Клиент
	        |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммаЗаявок КАК ВТ_СуммаЗаявок
	        |		ПО ДокументДозвон.Клиент = ВТ_СуммаЗаявок.Клиент
	        |ГДЕ
	        |	&Условие
	        |
	        |СГРУППИРОВАТЬ ПО
	        |	ДокументДозвон.Ссылка,
	        |	ДокументДозвон.ПометкаУдаления,
	        |	ДокументДозвон.Номер,
	        |	ДокументДозвон.Дата,
	        |	ДокументДозвон.Проведен,
	        |	ДокументДозвон.Исполнитель,
	        |	ДокументДозвон.Автор,
	        |	ДокументДозвон.Статус,
	        |	ДокументДозвон.Клиент,
	        |	ДокументДозвон.Телефон,
	        |	ДокументДозвон.Комментарий,
	        |	ДокументДозвон.МоментВремени,
	        |	ВТ_Заявки.Ссылка,
	        |	ВТ_КолвоПродаж.РегистраторСсылка,
	        |	ВТ_СуммаЗаявок.СуммаДокумента,
	        |	ВТ_СуммаПродаж.Сумма,
	        |	НАЧАЛОПЕРИОДА(ДокументДозвон.ДатаВыполнения, ДЕНЬ),
	        |	ВЫРАЗИТЬ(ДокументДозвон.КомментарийАудитора КАК СТРОКА(150)),
	        |	ДокументДозвон.Клиент.Город2,
	        |	ДокументДозвон.ДатаПерезвона";
	Если ЗначениеЗаполнено(ПериодПерезвонов) Тогда
		Если Сортировка = "Все" Тогда
			//Текст = СтрЗаменить(Текст, "ГДЕ", "");
			Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.ДатаПерезвона Между " + "&ДатаНачала"+ " И " + "&ДатаОкончания");
			Список.ТекстЗапроса = Текст;
		ИначеЕсли Сортировка = "Ожидание" Тогда
			Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Ожидание) и ДокументДозвон.ДатаПерезвона Между " + "&ДатаНачала"+ " И " + "&ДатаОкончания");
			Список.ТекстЗапроса = Текст;
		ИначеЕсли Сортировка = "Выполнено" Тогда
			Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Выполнено) и ДокументДозвон.ДатаПерезвона Между " + "&ДатаНачала"+ " И " + "&ДатаОкончания");
			Список.ТекстЗапроса = Текст;
		ИначеЕсли Сортировка = "Перезвон" Тогда
			Текст = СтрЗаменить(Текст, "&Условие", "ДокументДозвон.Статус = Значение(Перечисление.СтатусыДозвона.Перезвон) и ДокументДозвон.ДатаПерезвона Между " + "&ДатаНачала"+ " И " + "&ДатаОкончания");
			Список.ТекстЗапроса = Текст;
			
		КонецЕсли;
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодПерезвонов.ДатаНачала);
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодПерезвонов.ДатаОкончания);
	Иначе
		Текст = СтрЗаменить(Текст, "ГДЕ", "");
		Текст = СтрЗаменить(Текст, "&Условие", "");
		Список.ТекстЗапроса = Текст;

	КонецЕсли;
	///-Сергеев 19.04.2023 
	
	
КонецПроцедуры

