
#Область ОбработчикиСобытийФормы


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	УстановитьУсловноеОформление();
	
	УстановитьВидимость();
	
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	Список.Параметры.УстановитьЗначениеПараметра("ПустаяДата",  '00010101');
	
	///+ГомзМА 27.03.2023
	МассивСтатусов = Новый Массив;
	МассивСтатусов.Добавить(Перечисления.СостоянияЗаказНаряда.ВРаботе);
	МассивСтатусов.Добавить(Перечисления.СостоянияЗаказНаряда.Ожидание);
	
	Список.Параметры.УстановитьЗначениеПараметра("Состояние", 		 МассивСтатусов);
	СписокАрхив.Параметры.УстановитьЗначениеПараметра("Состояние",   Перечисления.СостоянияЗаказНаряда.Выполнен);
	///+СергеевФВ 13.03.2024
	СписокНеПриехал.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	СписокНеПриехал.Параметры.УстановитьЗначениеПараметра("ПустаяДата",  '00010101');
	///-СергеевФВ 13.03.2024
	СписокАрхив.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	СписокАрхив.Параметры.УстановитьЗначениеПараметра("ПустаяДата",  '00010101');
	
		СписокПредварительный.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДатаСеанса());
	СписокПредварительный.Параметры.УстановитьЗначениеПараметра("ПустаяДата",  '00010101');
	///+ГомзМА 27.03.2023
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды	
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Список

&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьСуммуИтого();
	
КонецПроцедуры


#КонецОбласти
#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Элементы.Список);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Элементы.Список, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Элементы.Список);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды





#КонецОбласти



#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьСуммуИтого()


КонецПроцедуры // ОбновитьСуммуИтого()

&НаСервере
Процедура УстановитьВидимость()
	
	
КонецПроцедуры 
	
&НаСервере
Процедура УстановитьУсловноеОформление()
	
КонецПроцедуры
	
#КонецОбласти


