
&НаСервере
Процедура Проект1ПриИзмененииНаСервере()
		
	Если ЗначениеЗаполнено(Проект) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Проект", 
		Проект, // Значение отбора
		ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ДоступныеПроекты = Элементы.Проект1.СписокВыбора.ВыгрузитьЗначения();
		//ДоступныеПроекты.Удалить(0);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Проект", 
		ДоступныеПроекты, // Значение отбора
		ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проект1ПриИзменении(Элемент)
	Проект1ПриИзмененииНаСервере();
КонецПроцедуры
//
&НаСервере
Процедура ЗаполнитьСписок()
ЗапросМенеджеров = Новый Запрос;
	
	ЗапросМенеджеров.Текст = 
	"ВЫБРАТЬ
	|	ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь КАК СотрудникПользователь,
	|	ДолжностиСотрудниковСрезПоследних.Сотрудник.Фамилия КАК Представление
	|ИЗ
	|	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
	|ГДЕ
	|	ДолжностиСотрудниковСрезПоследних.Должность.Отдел = &Отдел
	|
	|УПОРЯДОЧИТЬ ПО
	|	СотрудникПользователь";
	
	ЗапросМенеджеров.УстановитьПараметр("Отдел", Справочники.Подразделения.НайтиПоКоду("000000038"));
	ВыборкаМенеджеров = ЗапросМенеджеров.Выполнить().Выбрать();
	
	Элементы.Менеджер.СписокВыбора.Очистить();
	Элементы.Менеджер.СписокВыбора.Добавить(Справочники.Пользователи.ПустаяСсылка(), "ВСЕ");
	
	Пока ВыборкаМенеджеров.Следующий() Цикл
		Элементы.Менеджер.СписокВыбора.Добавить(ВыборкаМенеджеров.СотрудникПользователь, ВыборкаМенеджеров.Представление);
	КонецЦикла;

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписок();
КонецПроцедуры

&НаСервере
Процедура МенеджерПриИзмененииНаСервере()
	
	ОбновлениеСписка();
	//Список.Параметры.УстановитьЗначениеПараметра("Ответственный", Менеджер);
	ЭтаФорма.Модифицированность = Ложь;

КонецПроцедуры
Процедура ОбновлениеСписка() 
	Если ЗначениеЗаполнено(Менеджер) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Ответственный", 
		Менеджер, // Значение отбора
		ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе	
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	Пользователи.Ссылка КАК Ссылка,
		|	Пользователи.Представление КАК Представление
		|ИЗ
		|	Справочник.Пользователи КАК Пользователи
		|ГДЕ
		|	НЕ Пользователи.Недействителен";
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		
		МассивПользователей = Новый Массив;
		МассивПользователей.Добавить(Справочники.Пользователи.ПустаяСсылка());
		Пока РезультатЗапроса.Следующий() Цикл
			МассивПользователей.Добавить(РезультатЗапроса.Ссылка);
		КонецЦикла;
		
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Ответственный", 
		МассивПользователей, // Значение отбора
		ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура МенеджерПриИзменении(Элемент)
	МенеджерПриИзмененииНаСервере();
КонецПроцедуры
