Процедура ОбработкаПроведения(Отказ, Режим)
	
	Движения.РегистрНакопления1.Записывать = Истина ;	
	Для каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
		
		Движение = Движения.РегистрНакопления1.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Склад = ТекСтрокаНоменклатураСписок.Склад;
		Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
		Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
		Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
		Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
	КонецЦикла;
	
//	Отказ = РегистрыНакопления.РегистрНакопления1.ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад);// Мазин Правка
	Движения.Записать();
	Отказ = РегистрыНакопления.РегистрНакопления1.ЕстьОтрицательныеОстаткиВерсия2(Ссылка, МоментВремени());
	
	///+ГомзМА 23.03.2023
	ЗаписьВРегистреСведений 		= РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
	ЗаписьВРегистреСведений.Машина  = Машина;
	ЗаписьВРегистреСведений.Товар 	= Номенклатура;
	ЗаписьВРегистреСведений.индкод 	= Инкод;
	ЗаписьВРегистреСведений.Прочитать();
	
	Если (Не ЗаписьВРегистреСведений.Выбран()) И (Не ПустаяСтрока(Комментарий)) Тогда
		ЗаписьВРегистреСведений.Комментарий = Комментарий;
		ЗаписьВРегистреСведений.Машина 		= Машина;
		ЗаписьВРегистреСведений.Товар 		= Номенклатура;
		ЗаписьВРегистреСведений.индкод 		= Инкод;
		
		ЗаписьВРегистреСведений.Записать();
	Иначе
		ЗаписьВРегистреСведений.Комментарий = Комментарий;
		ЗаписьВРегистреСведений.Записать(Истина);
	КонецЕсли;
	
	// Получим таблицу партий
	ТаблицаТовары = НоменклатураСписок.Выгрузить();
	
	Для Каждого ТекСтрокаТаблица Из ТаблицаТовары Цикл
		индкод = ТекСтрокаТаблица.Партия;
		ЗаписьВРегистреСведений 		= РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
		ЗаписьВРегистреСведений.Машина  = ТекСтрокаТаблица.Автомобиль;
		ЗаписьВРегистреСведений.Товар 	= ТекСтрокаТаблица.Номенклатураспис;
		ЗаписьВРегистреСведений.индкод  = индкод;
		ЗаписьВРегистреСведений.Прочитать();
		Если (Не ЗаписьВРегистреСведений.Выбран()) И (Не ПустаяСтрока(ТекСтрокаТаблица.Комментарий)) Тогда
			ЗаписьВРегистреСведений.Комментарий = ТекСтрокаТаблица.Комментарий;
			ЗаписьВРегистреСведений.Машина 		= ТекСтрокаТаблица.Автомобиль;
			ЗаписьВРегистреСведений.Товар 		= ТекСтрокаТаблица.Номенклатураспис;
			ЗаписьВРегистреСведений.индкод 		= индкод;
			
			ЗаписьВРегистреСведений.Записать();
		Иначе
			ЗаписьВРегистреСведений.Комментарий = ТекСтрокаТаблица.Комментарий;
			ЗаписьВРегистреСведений.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	///-ГомзМА 23.03.2023
	ИзменитьЗаписьИндКод(); 
КонецПроцедуры

Функция ИзменитьЗаписьИндКод()
	
		НаборЗаписей = РегистрыСведений.ИндНомер.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.индкод.Установить(Инкод); 
		НаборЗаписей.Прочитать();
		
		Если НаборЗаписей.Количество() > 0 Тогда 
			
			Для Каждого Запись ИЗ НаборЗаписей Цикл 
				Запись.Состояние = Перечисления.Состояние.Восстановленная; 
			КонецЦикла;
				
		КонецЕсли; 
		    
	НаборЗаписей.Записать(); 
	
КонецФункции














