
&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Если Фильтр = 1 Тогда
		ТекстЗапросаСписокСегментацияКлиентовПоГородам();
	ИначеЕсли Фильтр = 2 Тогда
		ТекстЗапросаСегментацияКлиентовПоОбластям();
	КонецЕсли
КонецПроцедуры

Процедура ТекстЗапросаСписокСегментацияКлиентовПоГородам()
	Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажаЗапчастей.Клиент) КАК КоличествоГорячих,
	|	ПродажаЗапчастей.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ГорячиеКлиентыПоГородам
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	(ПродажаЗапчастей.ЕстьДоставка
	|	И (ПродажаЗапчастей.ДатаПолучения МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	ИЛИ ПродажаЗапчастей.Самовывоз
	|	И (ПродажаЗапчастей.ДатаОтгрузкиСоСклада МЕЖДУ &ДатаНачала И &ДатаОкончания))
	|	И ПродажаЗапчастей.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЗапчастей.Клиент.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ АКБ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаАКБ И &ДатаОкончанияАКБ
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АКБ.Клиент) КАК КоличествоАктивных,
	|	АКБ.Город КАК Город
	|ПОМЕСТИТЬ АктивныеКлиентыПоГородам
	|ИЗ
	|	АКБ КАК АКБ
	|ГДЕ
	|	АКБ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	АКБ.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ТЕПЛЫЕ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаТеплые И &ДатаОкончанияТеплые
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЕПЛЫЕ.Клиент) КАК КоличествоТеплых,
	|	ТЕПЛЫЕ.Город КАК Город
	|ПОМЕСТИТЬ ТеплыеКлиентыПоГородам
	|ИЗ
	|	ТЕПЛЫЕ КАК ТЕПЛЫЕ
	|ГДЕ
	|	ТЕПЛЫЕ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ТЕПЛЫЕ.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ПОТЕНЦ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаПотенциальные И &ДатаОкончанияПотенциальные
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПОТЕНЦ.Клиент) КАК КоличествоПотенциальных,
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Город <> ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Город
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|	КОНЕЦ КАК Город
	|ПОМЕСТИТЬ ПотенциальныеКлиентыПоГородам
	|ИЗ
	|	ПОТЕНЦ КАК ПОТЕНЦ
	|ГДЕ
	|	ПОТЕНЦ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Город <> ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Город
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент,
	|	Клиенты.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ХолодныеКлиенты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХолодныеКлиенты.Клиент) КАК КоличествоХолодных,
	|	ХолодныеКлиенты.Город КАК Город
	|ПОМЕСТИТЬ ХолодныеКлиентыПоГородам
	|ИЗ
	|	ХолодныеКлиенты КАК ХолодныеКлиенты
	|ГДЕ
	|	НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|	И ХолодныеКлиенты.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ХолодныеКлиенты.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Клиент КАК Клиент,
	|	Док.ИтогоРекв КАК СуммаПродажи,
	|	ЕСТЬNULL(ОплатыПоСделкамОбороты.СуммаОборот, 0) КАК СуммаОплаты,
	|	Док.ИтогоРекв - ЕСТЬNULL(ОплатыПоСделкамОбороты.СуммаОборот, 0) КАК Долг,
	|	Док.ДолгСписан КАК ДолгСписан
	|ПОМЕСТИТЬ ОборотыДенег
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатыПоСделкам.Обороты КАК ОплатыПоСделкамОбороты
	|		ПО ОплатыПоСделкамОбороты.Документ = Док.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыДенег.Клиент КАК Клиент,
	|	СУММА(ОборотыДенег.Долг) КАК Долг
	|ПОМЕСТИТЬ Долги
	|ИЗ
	|	ОборотыДенег КАК ОборотыДенег
	|ГДЕ
	|	ОборотыДенег.Долг > 0
	|	И ОборотыДенег.ДолгСписан = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	ОборотыДенег.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Долги.Клиент) КАК КоличествоДолжников,
	|	Долги.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ДолжникиПоГородам
	|ИЗ
	|	Долги КАК Долги
	|СГРУППИРОВАТЬ ПО
	|	Долги.Клиент.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Клиенты.Ссылка) КАК КоличествоНеЦелевых,
	|	Клиенты.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ НеЦелевыеКлиентыПоГородам
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Целевой
	|СГРУППИРОВАТЬ ПО
	|	Клиенты.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрГород.Наименование КАК Город,
	|	МАКСИМУМ(ГорячиеКлиентыПоГородам.КоличествоГорячих) КАК КоличествоГорячих,
	|	МАКСИМУМ(АктивныеКлиентыПоГородам.КоличествоАктивных) КАК КоличествоАктивных,
	|	МАКСИМУМ(ТеплыеКлиентыПоГородам.КоличествоТеплых) КАК КоличествоТеплых,
	|	МАКСИМУМ(ПотенциальныеКлиентыПоГородам.КоличествоПотенциальных) КАК КоличествоПотенциальных,
	|	МАКСИМУМ(ХолодныеКлиентыПоГородам.КоличествоХолодных) КАК КоличествоХолодных,
	|	МАКСИМУМ(ДолжникиПоГородам.КоличествоДолжников) КАК КоличествоДолжников,
	|	МАКСИМУМ(НеЦелевыеКлиентыПоГородам.КоличествоНеЦелевых) КАК КоличествоНеЦелевых,
	|	МАКСИМУМ(СпрГород.Владелец) КАК Область
	|ПОМЕСТИТЬ ВсеГорода
	|ИЗ
	|	Справочник.Город КАК СпрГород
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГорячиеКлиентыПоГородам КАК ГорячиеКлиентыПоГородам
	|		ПО (СпрГород.Наименование = ГорячиеКлиентыПоГородам.Город)
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеКлиентыПоГородам КАК АктивныеКлиентыПоГородам
	|		ПО (АктивныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТеплыеКлиентыПоГородам КАК ТеплыеКлиентыПоГородам
	|		ПО (ТеплыеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПотенциальныеКлиентыПоГородам КАК ПотенциальныеКлиентыПоГородам
	|		ПО (ПотенциальныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХолодныеКлиентыПоГородам КАК ХолодныеКлиентыПоГородам
	|		ПО (ХолодныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолжникиПоГородам КАК ДолжникиПоГородам
	|		ПО (ДолжникиПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеЦелевыеКлиентыПоГородам КАК НеЦелевыеКлиентыПоГородам
	|		ПО (НеЦелевыеКлиентыПоГородам.Город = СпрГород.Наименование)
	|ГДЕ
	|	(АктивныеКлиентыПоГородам.КоличествоАктивных <> 0
	|	ИЛИ ПотенциальныеКлиентыПоГородам.КоличествоПотенциальных <> 0
	|	ИЛИ ГорячиеКлиентыПоГородам.КоличествоГорячих <> 0
	|	ИЛИ НеЦелевыеКлиентыПоГородам.КоличествоНеЦелевых <> 0
	|	ИЛИ ХолодныеКлиентыПоГородам.КоличествоХолодных <> 0
	|	ИЛИ ТеплыеКлиентыПоГородам.КоличествоТеплых <> 0
	|	ИЛИ ДолжникиПоГородам.КоличествоДолжников <> 0)
	|СГРУППИРОВАТЬ ПО
	|	СпрГород.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВсеГорода.Город КАК Город,
	|	ВсеГорода.Область КАК Область,
	|	ВсеГорода.КоличествоГорячих КАК КоличествоГорячих,
	|	ВсеГорода.КоличествоАктивных КАК КоличествоАктивных,
	|	ВсеГорода.КоличествоТеплых КАК КоличествоТеплых,
	|	ВсеГорода.КоличествоПотенциальных КАК КоличествоПотенциальных,
	|	ВсеГорода.КоличествоХолодных КАК КоличествоХолодных,
	|	ВсеГорода.КоличествоДолжников КАК КоличествоДолжников,
	|	ВсеГорода.КоличествоНеЦелевых КАК КоличествоНеЦелевых,
	|	ЕСТЬNULL(ВсеГорода.КоличествоГорячих, 0) + ЕСТЬNULL(ВсеГорода.КоличествоАктивных, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоТеплых, 0) + ЕСТЬNULL(ВсеГорода.КоличествоПотенциальных, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоХолодных, 0) + ЕСТЬNULL(ВсеГорода.КоличествоДолжников, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоНеЦелевых, 0) КАК Итого
	|ИЗ
	|	ВсеГорода КАК ВсеГорода";
	СписокСегментацияКлиентовПоГородам.ПроизвольныйЗапрос = Истина;
	СписокСегментацияКлиентовПоГородам.ТекстЗапроса = Текст;
КонецПроцедуры

Процедура ТекстЗапросаСегментацияКлиентовПоОбластям()
	Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПродажаЗапчастей.Клиент) КАК КоличествоГорячих,
	|	ПродажаЗапчастей.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ГорячиеКлиентыПоГородам
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	(ПродажаЗапчастей.ЕстьДоставка
	|	И (ПродажаЗапчастей.ДатаПолучения МЕЖДУ &ДатаНачала И &ДатаОкончания)
	|	ИЛИ ПродажаЗапчастей.Самовывоз
	|	И (ПродажаЗапчастей.ДатаОтгрузкиСоСклада МЕЖДУ &ДатаНачала И &ДатаОкончания))
	|	И ПродажаЗапчастей.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЗапчастей.Клиент.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ АКБ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаАКБ И &ДатаОкончанияАКБ
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ АКБ.Клиент) КАК КоличествоАктивных,
	|	АКБ.Город КАК Город
	|ПОМЕСТИТЬ АктивныеКлиентыПоГородам
	|ИЗ
	|	АКБ КАК АКБ
	|ГДЕ
	|	АКБ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	АКБ.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ТЕПЛЫЕ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаТеплые И &ДатаОкончанияТеплые
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) > 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ТЕПЛЫЕ.Клиент) КАК КоличествоТеплых,
	|	ТЕПЛЫЕ.Город КАК Город
	|ПОМЕСТИТЬ ТеплыеКлиентыПоГородам
	|ИЗ
	|	ТЕПЛЫЕ КАК ТЕПЛЫЕ
	|ГДЕ
	|	ТЕПЛЫЕ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ТЕПЛЫЕ.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗаказКлиента.Клиент КАК Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ПОТЕНЦ
	|ИЗ
	|	Документ.ЗаказКлиента КАК ЗаказКлиента
	|ГДЕ
	|	ЗаказКлиента.Дата МЕЖДУ &ДатаНачалаПотенциальные И &ДатаОкончанияПотенциальные
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ЗаказКлиента.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|СГРУППИРОВАТЬ ПО
	|	ЗаказКлиента.Клиент,
	|	ЗаказКлиента.Клиент.Город2.Наименование
	|ИМЕЮЩИЕ
	|	КОЛИЧЕСТВО(ЗаказКлиента.Клиент) = 1
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ПОТЕНЦ.Клиент) КАК КоличествоПотенциальных,
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Город <> ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Город
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|	КОНЕЦ КАК Город
	|ПОМЕСТИТЬ ПотенциальныеКлиентыПоГородам
	|ИЗ
	|	ПОТЕНЦ КАК ПОТЕНЦ
	|ГДЕ
	|	ПОТЕНЦ.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ВЫБОР
	|		КОГДА ПОТЕНЦ.Город <> ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|			ТОГДА ПОТЕНЦ.Город
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Город.ПустаяСсылка)
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Клиенты.Ссылка КАК Клиент,
	|	Клиенты.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ХолодныеКлиенты
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ Клиенты.Ссылка В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ХолодныеКлиенты.Клиент) КАК КоличествоХолодных,
	|	ХолодныеКлиенты.Город КАК Город
	|ПОМЕСТИТЬ ХолодныеКлиентыПоГородам
	|ИЗ
	|	ХолодныеКлиенты КАК ХолодныеКлиенты
	|ГДЕ
	|	НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			АКБ.Клиент
	|		ИЗ
	|			АКБ КАК АКБ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ТЕПЛЫЕ.Клиент
	|		ИЗ
	|			ТЕПЛЫЕ КАК ТЕПЛЫЕ)
	|	И НЕ ХолодныеКлиенты.Клиент В
	|		(ВЫБРАТЬ
	|			ПОТЕНЦ.Клиент
	|		ИЗ
	|			ПОТЕНЦ КАК ПОТЕНЦ)
	|	И ХолодныеКлиенты.Клиент.Целевой
	|СГРУППИРОВАТЬ ПО
	|	ХолодныеКлиенты.Город
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Док.Клиент КАК Клиент,
	|	Док.ИтогоРекв КАК СуммаПродажи,
	|	ЕСТЬNULL(ОплатыПоСделкамОбороты.СуммаОборот, 0) КАК СуммаОплаты,
	|	Док.ИтогоРекв - ЕСТЬNULL(ОплатыПоСделкамОбороты.СуммаОборот, 0) КАК Долг,
	|	Док.ДолгСписан КАК ДолгСписан
	|ПОМЕСТИТЬ ОборотыДенег
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК Док
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОплатыПоСделкам.Обороты КАК ОплатыПоСделкамОбороты
	|		ПО (ОплатыПоСделкамОбороты.Документ = Док.Ссылка)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОборотыДенег.Клиент КАК Клиент,
	|	СУММА(ОборотыДенег.Долг) КАК Долг
	|ПОМЕСТИТЬ Долги
	|ИЗ
	|	ОборотыДенег КАК ОборотыДенег
	|ГДЕ
	|	ОборотыДенег.Долг > 0
	|	И ОборотыДенег.ДолгСписан = ЛОЖЬ
	|СГРУППИРОВАТЬ ПО
	|	ОборотыДенег.Клиент
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Долги.Клиент) КАК КоличествоДолжников,
	|	Долги.Клиент.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ ДолжникиПоГородам
	|ИЗ
	|	Долги КАК Долги
	|СГРУППИРОВАТЬ ПО
	|	Долги.Клиент.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Клиенты.Ссылка) КАК КоличествоНеЦелевых,
	|	Клиенты.Город2.Наименование КАК Город
	|ПОМЕСТИТЬ НеЦелевыеКлиентыПоГородам
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.Целевой
	|СГРУППИРОВАТЬ ПО
	|	Клиенты.Город2.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрГород.Наименование КАК Город,
	|	МАКСИМУМ(ГорячиеКлиентыПоГородам.КоличествоГорячих) КАК КоличествоГорячих,
	|	МАКСИМУМ(АктивныеКлиентыПоГородам.КоличествоАктивных) КАК КоличествоАктивных,
	|	МАКСИМУМ(ТеплыеКлиентыПоГородам.КоличествоТеплых) КАК КоличествоТеплых,
	|	МАКСИМУМ(ПотенциальныеКлиентыПоГородам.КоличествоПотенциальных) КАК КоличествоПотенциальных,
	|	МАКСИМУМ(ХолодныеКлиентыПоГородам.КоличествоХолодных) КАК КоличествоХолодных,
	|	МАКСИМУМ(ДолжникиПоГородам.КоличествоДолжников) КАК КоличествоДолжников,
	|	МАКСИМУМ(НеЦелевыеКлиентыПоГородам.КоличествоНеЦелевых) КАК КоличествоНеЦелевых,
	|	МАКСИМУМ(СпрГород.Владелец) КАК Область
	|ПОМЕСТИТЬ ВсеГорода
	|ИЗ
	|	Справочник.Город КАК СпрГород
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГорячиеКлиентыПоГородам КАК ГорячиеКлиентыПоГородам
	|		ПО СпрГород.Наименование = ГорячиеКлиентыПоГородам.Город
	|		ЛЕВОЕ СОЕДИНЕНИЕ АктивныеКлиентыПоГородам КАК АктивныеКлиентыПоГородам
	|		ПО (АктивныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТеплыеКлиентыПоГородам КАК ТеплыеКлиентыПоГородам
	|		ПО (ТеплыеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПотенциальныеКлиентыПоГородам КАК ПотенциальныеКлиентыПоГородам
	|		ПО (ПотенциальныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ХолодныеКлиентыПоГородам КАК ХолодныеКлиентыПоГородам
	|		ПО (ХолодныеКлиентыПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ ДолжникиПоГородам КАК ДолжникиПоГородам
	|		ПО (ДолжникиПоГородам.Город = СпрГород.Наименование)
	|		ЛЕВОЕ СОЕДИНЕНИЕ НеЦелевыеКлиентыПоГородам КАК НеЦелевыеКлиентыПоГородам
	|		ПО (НеЦелевыеКлиентыПоГородам.Город = СпрГород.Наименование)
	|ГДЕ
	|	(АктивныеКлиентыПоГородам.КоличествоАктивных <> 0
	|	ИЛИ ПотенциальныеКлиентыПоГородам.КоличествоПотенциальных <> 0
	|	ИЛИ ГорячиеКлиентыПоГородам.КоличествоГорячих <> 0
	|	ИЛИ НеЦелевыеКлиентыПоГородам.КоличествоНеЦелевых <> 0
	|	ИЛИ ХолодныеКлиентыПоГородам.КоличествоХолодных <> 0
	|	ИЛИ ТеплыеКлиентыПоГородам.КоличествоТеплых <> 0
	|	ИЛИ ДолжникиПоГородам.КоличествоДолжников <> 0)
	|СГРУППИРОВАТЬ ПО
	|	СпрГород.Наименование
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ВсеГорода.Город) КАК Город,
	|	ВсеГорода.Область КАК Область,
	|	СУММА(ВсеГорода.КоличествоГорячих) КАК КоличествоГорячих,
	|	СУММА(ВсеГорода.КоличествоАктивных) КАК КоличествоАктивных,
	|	СУММА(ВсеГорода.КоличествоТеплых) КАК КоличествоТеплых,
	|	СУММА(ВсеГорода.КоличествоПотенциальных) КАК КоличествоПотенциальных,
	|	СУММА(ВсеГорода.КоличествоХолодных) КАК КоличествоХолодных,
	|	СУММА(ВсеГорода.КоличествоДолжников) КАК КоличествоДолжников,
	|	СУММА(ВсеГорода.КоличествоНеЦелевых) КАК КоличествоНеЦелевых,
	|	СУММА(ЕСТЬNULL(ВсеГорода.КоличествоГорячих, 0) + ЕСТЬNULL(ВсеГорода.КоличествоАктивных, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоТеплых, 0) + ЕСТЬNULL(ВсеГорода.КоличествоПотенциальных, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоХолодных, 0) + ЕСТЬNULL(ВсеГорода.КоличествоДолжников, 0) +
	|		ЕСТЬNULL(ВсеГорода.КоличествоНеЦелевых, 0)) КАК Итого
	|ИЗ
	|	ВсеГорода КАК ВсеГорода
	|СГРУППИРОВАТЬ ПО
	|	ВсеГорода.Область";
	СписокСегментацияКлиентовПоГородам.ПроизвольныйЗапрос = Истина;
	СписокСегментацияКлиентовПоГородам.ТекстЗапроса = Текст;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Фильтр = 1;
	ЗаполнитьПараметрыСписокСписокСегментацияКлиентовПоГородам();
КонецПроцедуры

Процедура ЗаполнитьПараметрыСписокСписокСегментацияКлиентовПоГородам()
	// Комлев АА 02/11/24 +++
	
	ДатаВПрошлом  = НачалоДня(ТекущаяДата() - (24 * 60 * 60) * 10);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаВПрошлом);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(
		ТекущаяДата()));

	ДатаНачалаАКБ = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 30;
	ДатаОкончанияАКБ = КонецДня(ТекущаяДата());
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаАКБ", ДатаНачалаАКБ);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияАКБ", ДатаОкончанияАКБ);

	ДатаНачалаТеплые = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 90;
	ДатаОкончанияТеплые = КонецДня(ТекущаяДата()) - (24 * 60 * 60) * 31;
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаТеплые", ДатаНачалаТеплые);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияТеплые", ДатаОкончанияТеплые);

	ДатаНачалаПотенциальные = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 90;
	ДатаОкончанияПотенциальные = КонецДня(ТекущаяДата());
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаПотенциальные",
		ДатаНачалаПотенциальные);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияПотенциальные",
		ДатаОкончанияПотенциальные);
		// Комлев АА 02/11/24 ---
КонецПроцедуры