
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьПараметрыСписокСписокСегментацияКлиентовПоГородам();
КонецПроцедуры

Процедура ЗаполнитьПараметрыСписокСписокСегментацияКлиентовПоГородам()
	// Комлев АА 02/11/24 +++
	
	ДатаВПрошлом  = НачалоДня(ТекущаяДата() - (24 * 60 * 60) * 10);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ДатаВПрошлом);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(
		ТекущаяДата()));

	ДатаНачалаАКБ = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 30;
	ДатаОкончанияАКБ = КонецДня(ТекущаяДата());
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаАКБ", ДатаНачалаАКБ);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияАКБ", ДатаОкончанияАКБ);

	ДатаНачалаТеплые = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 90;
	ДатаОкончанияТеплые = КонецДня(ТекущаяДата()) - (24 * 60 * 60) * 31;
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаТеплые", ДатаНачалаТеплые);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияТеплые", ДатаОкончанияТеплые);

	ДатаНачалаПотенциальные = НачалоДня(ТекущаяДата()) - (24 * 60 * 60) * 90;
	ДатаОкончанияПотенциальные = КонецДня(ТекущаяДата());
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаНачалаПотенциальные",
		ДатаНачалаПотенциальные);
	СписокСегментацияКлиентовПоГородам.Параметры.УстановитьЗначениеПараметра("ДатаОкончанияПотенциальные",
		ДатаОкончанияПотенциальные);
		// Комлев АА 02/11/24 ---
КонецПроцедуры