#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область СчетНаОплату_ТабличныеЧасти

Процедура ОбработкаИзмененияСтроки(Объект, ИмяТабличнойЧасти, ТекДанные, Поле = Неопределено) Экспорт

	//ТекДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	Коэф = 1;
	Если Поле = Неопределено Тогда
		ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество * Коэф;
	ИначеЕсли Поле = "Сумма" Тогда
		Если ТекДанные.Количество <> 0 Тогда
			ТекДанные.Цена = ТекДанные.Сумма / Коэф / ТекДанные.Количество;
		КонецЕсли;
	КонецЕсли;
	
	Объект.ИтогоРекв = Объект.Таблица.Итог("Сумма") - Объект.Таблица.Итог("Скидка") + Объект.Услуги.Итог("Сумма");

КонецПроцедуры // ОбработкаИзмененияСтроки()
#КонецОбласти


#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли