
&НаКлиенте
Процедура Команда1(Команда)
	Перем Стр,Сч;
        Стр = "";
	// Вставить содержимое обработчика.
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	Текст = "ru = ""Текст""; en = ""Text""";
	Фильтр = НСтр(Текст)+"(*.csv)|*.csv";
	ДиалогОткрытияФайла.Фильтр = Фильтр;
	ДиалогОткрытияФайла.МножественныйВыбор = Ложь;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	Имя = "";
	Если ДиалогОткрытияФайла.Выбрать() Тогда
	    МассивФайлов = ДиалогОткрытияФайла.ВыбранныеФайлы;
	    Для Каждого ИмяФайла Из МассивФайлов Цикл
	        ВыбФайл = Новый Файл(ИмяФайла);
	        Текст = "ru = ""; Размер = ""; en = ""; Size = """;
	        Имя =ИмяФайла;
	    КонецЦикла;
	Иначе
	    Текст = "ru = ""Файл(ы) не выбран!""; en = ""File(s) not selected!""";
	    Предупреждение(НСтр(Текст));
	КонецЕсли;
	
	Текст =Новый ЧтениеТекста;
        Текст.Открыть(Имя);
        Сч = 0;
	Пока Стр <> Неопределено Цикл

                Стр =Текст.ПрочитатьСтроку();

                //Создаем массив в который будем добавлять выбранные поля
                МассивПолей = Новый Массив();
                Назв = "";
				код = "";
				замен = "";
				колво = 0;
                //Цикл разбивает строку на подстроки по разделителю ";" и заносит их в массив
                Пока СтрДлина(Стр)> 0 Цикл

                       //Находим позицию первого вхождения символа ";"
                       ПозицияРазделителя =Найти(Стр, ";");
					   Если ПозицияРазделителя = 0 Тогда
						   Стр1 = Стр;
					   Иначе
						   Стр1 = Лев(Стр,ПозицияРазделителя - 1);
					   КонецЕсли;
					   Стр1 = СтрЗаменить(Стр1,"#","");
					   Стр1 = СтрЗаменить(Стр1,"""","");
                       //Считываем символы до первого найденного символа ";"
					   Если колво = 0 Тогда
						   Назв = Стр1;
					   КонецЕсли;
					   Если колво = 1 Тогда
						   код = Стр1;
					   КонецЕсли;

					   
                       Если ПозицияРазделителя = 0 Тогда
						   Стр="";
					   Иначе
						    Стр =Прав(Стр,СтрДлина(Стр) -ПозицияРазделителя);

					   КонецЕсли;
                       //Удаляем из строки найденную подстроку и повторяем цикл с оставшейся строкой
                                             колво = колво + 1;
                КонецЦикла;
                добавить(код,Назв,замен);
                //Выводим на экран первое прочитанное поле
                Попытка Сообщить(Назв + " " + код + " " + замен); Исключение КонецПопытки;

        КонецЦикла;

        Текст.Закрыть();

	КонецПроцедуры
	
	&НаСервере
	Процедура добавить(назв,код,замен)
		 об = Справочники.CatAutoline.СоздатьЭлемент();
		 об.catauto = код;
		 об.Наименование = назв;
		 об.Записать();
	 КонецПроцедуры

&НаКлиенте
	 Процедура Команда2(Команда)
		 // Вставить содержимое обработчика.
		 Сообщить("Старт");
		 п2();
		 Сообщить("Финиш");
	 КонецПроцедуры
	 
	 
	 
&НаСервере
	Процедура п2()	 
	  Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	Номенклатура.Код,
	               |	Номенклатура.Наименование,
	               |	Номенклатура.Артикул,
	               |	Номенклатура.НомерПроизводителя,
	               |	Номенклатура.МестоНаСкладе2,
	               |	РегистрНакопления1Остатки.КолвоОстаток,
	               |	Номенклатура.Бренд,
	               |	Номенклатура.Описание,
	               |	Номенклатура.Ссылка,
	               |	Номенклатура.Комплектность.(
	               |		НомерПоиск,
	               |		Артикул,
	               |		Наименование,
	               |		Количество,
	               |		Предложение
	               |	),
	               |	Номенклатура.Категория,
	               |	Номенклатура.КрупныйАгрегат,
	               |	Номенклатура.НомераЗамен.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		НомерЗамены
	               |	),
	               |	Номенклатура.Видео,
	               |	Номенклатура.РекомендованаяЦена,
	               |	Номенклатура.НаСайтеТракДонор,
	               |	Номенклатура.Производитель.Ссылка КАК произв1,
	               |	Номенклатура.catauto,
	               |	Номенклатура.Вес,
	               |	Номенклатура.Объем,
	               |	Номенклатура.ДляТэгов.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Реквизит1
	               |	),
	               |	Номенклатура.ЕстьТэги,
	               |	Номенклатура.Диаметр,
	               |	Номенклатура.ШагРезьбы,
	               |	Номенклатура.Прочность,
	               |	Номенклатура.ТипКрепеж,
	               |	Номенклатура.Длина,
	               |	Номенклатура.ВнутреннийДиаметр,
	               |	Номенклатура.podkategoria,
	               |	Номенклатура.Толщина,
	               |	Номенклатура.Title,
	               |	Номенклатура.Предложения.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Реквизит1
	               |	),
	               |	Номенклатура.длин,
	               |	Номенклатура.шир,
	               |	Номенклатура.выс,
	               |	Номенклатура.ЭтоНоваяЗапчасть,
	               |	Номенклатура.ЗапросыПоисковиков.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		Название
	               |	),
	               |	Номенклатура.podkat2,
	               |	Номенклатура.ДопКат.(
	               |		Ссылка,
	               |		НомерСтроки,
	               |		кат,
	               |		подкат
	               |	)
	               |ИЗ
	               |	Справочник.Номенклатура КАК Номенклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	               |		ПО Номенклатура.Ссылка = РегистрНакопления1Остатки.Товар";
	результат = Запрос.Выполнить();
	таблица = результат.Выгрузить();
	Текст = Новый ЗаписьТекста("d:\Dropbox\Public\sklad.xml", КодировкаТекста.UTF8);
	док = "<?xml version='1.0' encoding='UTF-8'?><info><items>";
	Текст.ЗаписатьСтроку(док);
	Сообщить("НАч");
	Для Каждого номстрока из таблица Цикл
		Запрос1 = Новый Запрос;
		Запрос1.Текст = "ВЫБРАТЬ
		                |	РегистрНакопления1Остатки.Цена
		                |ИЗ
		                |	РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
		                |ГДЕ
		                |	РегистрНакопления1Остатки.Товар = &Товар";
		Компл = "";
		Компл2 = "";
		компл21 = "";
		запросП = "";
		Для Каждого кпл из номстрока.Комплектность Цикл
			Компл = Компл + "/"+кпл.НомерПоиск;
			компл21 = компл21 + "<komplitem><nomer>"+кпл.Артикул+"</nomer><name>"+кпл.Наименование+"</name><predl>"+кпл.Предложение.Код+"</predl><kolvo>"+кпл.Количество+"</kolvo></komplitem>";
		КонецЦикла;
		Для Каждого кпл из номстрока.НомераЗамен Цикл
			Компл = Компл + "/"+кпл.НомерЗамены;
		КонецЦикла;
		Для Каждого зпр из номстрока.ЗапросыПоисковиков Цикл
			запросП = запросП + зпр.Название + "/";
		КонецЦикла;
		Компл = Компл + "/";
		насайте = 0;
		Если номстрока.НаСайтеТракДонор = ИСТИНА Тогда
			насайте = 1
		КонецЕсли;
		допкат = "<dopkats>";
		Для Каждого дк из номстрока.ДопКат Цикл
			допкат = допкат + "<dop><kat>"+дк.кат.Код+"</kat><podkat>"+дк.подкат.Код+"</podkat></dop>";
		КонецЦикла;
		допкат = допкат + "</dopkats>";
		крепеж = "<krep_info>";
		Если номстрока.Категория.код = "000000148" Тогда
			крепеж=крепеж + "<type>"+номстрока.ТипКрепеж+"</type><diametr>"+номстрока.Диаметр+"</diametr><shag>"+
			номстрока.ШагРезьбы+"</shag><dlina>"+номстрока.Длина+"</dlina><prochnost>"+номстрока.Прочность+
			"</prochnost><wd>"+номстрока.ВнутреннийДиаметр+"</wd><tol>"+номстрока.Толщина+"</tol>";
		КонецЕсли;
		крепеж=крепеж + "</krep_info>";
		цена = номстрока.РекомендованаяЦена;
		кагг = 0;
		Если номстрока.КрупныйАгрегат = Истина Тогда
			кагг = 1;
		КонецЕсли;
		ет = 0;
		Если номстрока.ЕстьТэги = Истина Тогда
			ет = 1;
		КонецЕсли;
		эт_н=0;
		Если номстрока.ЭтоНоваяЗапчасть = Истина Тогда
			эт_н=1;
		КонецЕсли;
		
		тд=0;		
		СтрокаЗапроса = "/common/api?key=ByTdEt87&id1c="+номстрока.Код + "&name="+номстрока.Наименование+"&oe="+номстрока.Артикул+
		"&analog="+номстрока.НомерПроизводителя+"&brend="+номстрока.Бренд+
		"&price="+Формат(цена,"ЧРГ=;ЧРД=.;")+"&warehouse="+номстрока.МестоНаСкладе2+"&kolvo="+номстрока.КолвоОстаток+"&kompl="+Компл+
		"&cat="+номстрока.Категория.Код+"&bigagg="+кагг+"&vidlink="+номстрока.Видео+"&pr_exp="+номстрока.РекомендованаяЦена+
		"&partdescr="+номстрока.Описание;
		док = "<item><id1c>"+номстрока.Код + "</id1c><name>"+номстрока.Наименование + "</name><title>"+номстрока.Title+"</title><oe>"+номстрока.Артикул + "</oe>
		| <analog>"+номстрока.НомерПроизводителя + "</analog><brend>"+номстрока.Бренд + "</brend><price>"+Формат(цена,"ЧРГ=;ЧРД=.;") + "</price>
		| <warehouse>"+номстрока.МестоНаСкладе2 + "</warehouse><kolvo>"+номстрока.КолвоОстаток + "</kolvo><kompl>"+Компл + "</kompl><kompl2>"+компл21 + "</kompl2>
		| <cat>"+номстрока.Категория.Код + "</cat><sitecat>"+номстрока.произв1 + "</sitecat><bigagg>"+кагг + "</bigagg><vidlink>"+номстрока.Видео + "</vidlink>
		| <pr_exp>"+номстрока.РекомендованаяЦена + "</pr_exp><podkat>"+номстрока.podkategoria.Код+"</podkat><podkat2>"+номстрока.podkat2.Код+"</podkat2>
		| <weigth>"+номстрока.Вес+"</weigth><volume>"+номстрока.Объем+"</volume>
		| <ontd>"+насайте + "</ontd><partdescr>"+номстрока.Описание + "</partdescr>
		| <dlin>"+номстрока.длин+"</dlin><shir>"+номстрока.шир+"</shir><isnew>"+эт_н+"</isnew><vis>"+номстрока.выс+"</vis>
		| <catauto>"+номстрока.catauto.catauto+"</catauto><zapros>"+запросП+"</zapros><hastags>"+ет+"</hastags>"+крепеж;
		
		Если номстрока.ЕстьТэги = Истина Тогда
			док = док + "<tags>";
			Для каждого тэг Из номстрока.ДляТэгов Цикл
				док = док + "<tag>"+тэг.Реквизит1.код+"</tag>";
			КонецЦикла;
			док = док + "</tags>";
		КонецЕсли;
		док = док + "<predlozenia>";
			Для каждого тэг Из номстрока.Предложения Цикл
				док = док + "<predl>"+тэг.Реквизит1.код+"</predl>";
			КонецЦикла;
			док = док + "</predlozenia>";
        док = док + допкат;
		док = док + "</item>";
		док = СтрЗаменить(док,"&","&amp;");
		Текст.ЗаписатьСтроку(док);
	КонецЦикла;
	док ="</items>";
	Текст.ЗаписатьСтроку(док);
	 Сообщить("СП");
	Запрос.Текст = "ВЫБРАТЬ
	               |	Спецпредложения.Код,
	               |	Спецпредложения.ДатаНачала,
	               |	Спецпредложения.ДатаОкончания,
	               |	Спецпредложения.ДатаОбновления,
	               |	Спецпредложения.Товар.Код КАК ткод,
	               |	Спецпредложения.Товар.ЭтоНоваяЗапчасть КАК этн,
	               |	Спецпредложения.Цена,
	               |	Спецпредложения.Условия
	               |ИЗ
	               |	Справочник.Спецпредложения КАК Спецпредложения";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = "<specpredl>";
	Текст.ЗаписатьСтроку(док);

	Для Каждого пред из рез1 Цикл
		этн = 0;
		Если пред.этн = Истина Тогда
			этн = 1;
		КонецЕсли;
		док = "<predl><id>"+пред.Код+"</id><id1c>"+пред.ткод+"</id1c><isnew>"+этн+"</isnew><updated>"+пред.ДатаОбновления+"</updated>
		|<from>"+пред.ДатаНачала+"</from><to>"+пред.ДатаОкончания+"</to>
		|<price>"+пред.Цена+"</price><description><![CDATA["+пред.Условия+"]]></description></predl>";
		док = СтрЗаменить(док,"&","&amp;");
		Текст.ЗаписатьСтроку(док);
	КонецЦикла;
    док = "</specpredl>";
	Текст.ЗаписатьСтроку(док);
      Сообщить("ТГ");
		
	Запрос.Текст = "ВЫБРАТЬ
	               |	Тэги.Ссылка,
	               |	Тэги.ВерсияДанных,
	               |	Тэги.ПометкаУдаления,
	               |	Тэги.Предопределенный,
	               |	Тэги.Код,
	               |	Тэги.Наименование
	               |ИЗ
	               |	Справочник.Тэги КАК Тэги";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = "<tags_table>";
	Для Каждого тэг из рез1 Цикл
		док = док + "<tag><id>"+тэг.Код+"</id><name>"+тэг.Наименование+"</name></tag>";
	КонецЦикла;
	док = док + "</tags_table>";
	док = СтрЗаменить(док,"&","&amp;");
	Текст.ЗаписатьСтроку(док);

	Запрос.Текст =  "ВЫБРАТЬ
	                |	Клиенты.Телефон
	                |ИЗ
	                |	Справочник.Клиенты КАК Клиенты" ;
	рез1 = Запрос.Выполнить().Выгрузить();
	док = "<phones>";
	Для Каждого тел из рез1 цикл
		док = док + "<phone>"+тел.Телефон+"</phone>";
	КонецЦикла;
	док = док + "</phones>";
	Текст.ЗаписатьСтроку(док);

	Запрос.Текст = "ВЫБРАТЬ
	               |	Podkategorii.Ссылка,
	               |	Podkategorii.ВерсияДанных,
	               |	Podkategorii.ПометкаУдаления,
	               |	Podkategorii.Предопределенный,
	               |	Podkategorii.Владелец,
	               |	Podkategorii.Код,
	               |	Podkategorii.Наименование,
	               |	Podkategorii.poryadok
	               |ИЗ
	               |	Справочник.Podkategorii КАК Podkategorii";
	рез1 = Запрос.Выполнить().Выгрузить();
	док = "<podkats>";
	Для Каждого подкат из рез1 цикл
		док = док + "<podkat><id>"+подкат.Код+"</id><catid>"+подкат.Владелец.Код+"</catid><name>"+подкат.Наименование+"</name><poryadok>"+подкат.poryadok+"</poryadok></podkat>";
	КонецЦикла;
	
	
	запрос333 = Новый Запрос;
запрос333.Текст =  "ВЫБРАТЬ
                   |	ПродажаЗапчастей.ЕстьДоставка,
                   |	ПродажаЗапчастей.ДоставкаНеЗаполнена,
                   |	ПродажаЗапчастей.ТранспортнаяКомпания,
                   |	ПродажаЗапчастей.Вес,
                   |	ПродажаЗапчастей.Объем,
                   |	ПродажаЗапчастей.КоличествоМест,
                   |	ПродажаЗапчастей.ГородОтправки,
                   |	ПродажаЗапчастей.РегионПолучения,
                   |	ПродажаЗапчастей.ГородПолучения,
                   |	ПродажаЗапчастей.СтоимостьДоставки,
                   |	ПродажаЗапчастей.Номер,
                   |	ПродажаЗапчастей.Таблица.(
                   |		Ссылка,
                   |		НомерСтроки,
                   |		Товар,
                   |		Количество,
                   |		Цена,
                   |		Скидка,
                   |		машина,
                   |		цена1,
                   |		Комментарий,
                   |		Сумма
                   |	)
                   |ИЗ
                   |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей" ;
рез = запрос333.Выполнить().Выгрузить();
хмл = "<dostavki>";
Для Каждого стр Из рез Цикл
	Если стр.ЕстьДоставка = Истина И стр.ДоставкаНеЗаполнена = Ложь Тогда
		хмл = хмл + "<dostavka><nomer>"+стр.Номер+"</nomer><from>"+стр.ГородОтправки+"</from><to>"+стр.РегионПолучения.Владелец+", "+стр.РегионПолучения+", г. "+стр.ГородПолучения+"</to><transport>"+стр.ТранспортнаяКомпания+"</transport>
		| <ves>"+стр.Вес+"</ves><obem>"+стр.Объем+"</obem><mest>"+стр.КоличествоМест+"</mest><stoimost>"+стр.СтоимостьДоставки+"</stoimost><tovari>";
		Для каждого стр1 Из стр.Таблица Цикл
			хмл = хмл + "<tovar><id>"+стр1.Товар.Код+"</id><name>"+стр1.Товар.Наименование+"</name><kolvo>"+стр1.Количество+"</kolvo></tovar>"; 
		КонецЦикла;
		хмл = хмл + "</tovari></dostavka>";
	КонецЕсли;
КонецЦикла;
хмл = хмл + "</dostavki>";

	
запрос333.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
                  |	Клиенты.Область,
                  |	Клиенты.Город2,
                  |	Клиенты.Страна2
                  |ИЗ
                  |	Справочник.Клиенты КАК Клиенты";	
	
рез = запрос333.Выполнить().Выгрузить();
хмл = хмл + "<cities>";
Для Каждого стр Из рез Цикл	
		хмл = хмл + "<city><to>"+стр.Страна2+", "+стр.Область+", г. "+стр.Город2+"</to></city>";
КонецЦикла;
хмл = хмл + "</cities>";

Запрос.Текст = "ВЫБРАТЬ
               |	Категории.Код,
               |	Категории.Наименование,
               |	Категории.Порядок1
               |ИЗ
               |	Справочник.Категории КАК Категории";
	рез1 = Запрос.Выполнить().Выгрузить();
	хмл = хмл + "<mainkats>";
	Для Каждого подкат из рез1 цикл
		хмл = хмл + "<kat><id>"+подкат.Код+"</id><name>"+подкат.Наименование+"</name><poryadok>"+подкат.Порядок1+"</poryadok></kat>";
	КонецЦикла;
	хмл = хмл + "</mainkats>";
	док = док + "</podkats>"+хмл+"</info>";
	док = СтрЗаменить(док,"&","&amp;");

	Текст.ЗаписатьСтроку(док);
	Текст.Закрыть();
 КонецПроцедуры

