
&НаКлиенте
Процедура Обновить(Команда)
Количество = КоличествоСтрокВСписке("СписокНоменклатурыНаПереоценку");
КонецПроцедуры

&НаСервере
Функция КоличествоСтрокВСписке(НазваниеСписка) // Строка 
	// Комлев АА +++
	СКД = Элементы[НазваниеСписка].ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы[НазваниеСписка].ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикКД.Выполнить(СКД, НастройкиКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД);
	ПроцессорВыводаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	РезультатКД_ТЗ = ПроцессорВыводаКД.Вывести(ПроцессорКД);

	Возврат РезультатКД_ТЗ.Количество();
	// Комлев АА ---
КонецФункции

&НаКлиенте
Процедура СписокПартий1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	// Комлев АА +++
	СтруктураЗаписи = Новый Структура("индкод", ПолучитьиндКод(Элементы.СписокПартий1.ТекущиеДанные.индКод));
	МассивСтруктураЗаписи = Новый Массив;
	МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
	КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ИндНомер", МассивСтруктураЗаписи);

	Параметрыформы = Новый Структура("Ключ", КлючЗаписи);                            
		
	ОткрытьФорму("РегистрСведений.ИндНомер.ФормаЗаписи", Параметрыформы);
	// Комлев АА +++
КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыНаПереоценкуПриАктивизацииСтроки(Элемент)
	// Комлев АА +++
	ТекДанные = Элементы.СписокНоменклатурыНаПереоценку.ТекущаяСтрока;
	СписокПартий.Параметры.УстановитьЗначениеПараметра("Товар", ТекДанные);
	// Комлев АА ---
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	// Комлев АА +++
	Если ТекущаяСтраница = Элементы.НоменклатураНаПереоценку Тогда
		ДатаВПрошлом = ДобавитьМесяц(ТекущаяДата(), -4);
		СписокНоменклатурыНаПереоценку.Параметры.УстановитьЗначениеПараметра("ДатаВПрошлом", ДатаВПрошлом);
	КонецЕсли;
	// Комлев АА ---
КонецПроцедуры
&НаКлиенте
Процедура ОбновитьОтборПартий()
	//////
	ТекДанные = Элементы.СписокНоменклатуры.ТекущаяСтрока;
	СписокПартий.Параметры.УстановитьЗначениеПараметра("Товар", ТекДанные);

КонецПроцедуры

&НаКлиенте
Процедура СписокНоменклатурыПриАктивизацииСтроки(Элемент)
	
	Если Элементы.СписокНоменклатуры.ТекущиеДанные <> Неопределено Тогда
		ОбновитьОтборПартий();
	КонецЕсли;

КонецПроцедуры


&НаКлиенте
Процедура ОткрытьДетальНаСайте1(Команда)
	
	
	ОбщДействия.ОткрытьДетальНаСайтеWT10(ЭтаФорма.Элементы.СписокПартий.ТекущиеДанные.индкод);
		


КонецПроцедуры
	
&НаКлиенте
Процедура ОткрытьКарточкуТовараНаСайте(Команда)

	ОбщДействия.ОткрытьКарточкуТовараНаСайтеWT10(ЭтаФорма.Элементы.СписокНоменклатуры.ТекущиеДанные.Код);
	
КонецПроцедуры




&НаКлиенте
Процедура СписокПартийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		
		СтруктураЗаписи = Новый Структура("индкод",  ПолучитьиндКод(Элементы.СписокПартий.ТекущиеДанные.индКод));
		МассивСтруктураЗаписи = Новый Массив;
		МассивСтруктураЗаписи.Добавить(СтруктураЗаписи);
		КлючЗаписи = Новый ("РегистрСведенийКлючЗаписи.ИндНомер", МассивСтруктураЗаписи);
		
		Параметрыформы = Новый Структура("Ключ", КлючЗаписи);                            
		ОткрытьФорму("РегистрСведений.ИндНомер.ФормаЗаписи", Параметрыформы);
		
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьиндКод(Код)
	Возврат Справочники.ИндКод.НайтиПоНаименованию(Код);
КонецФункции
