
&НаКлиенте
Процедура ДобавитьТовары(Команда)
	
	Если ЗначениеЗаполнено(Стеллаж)  И ЗначениеЗаполнено(ДатаПроведенияАкции) Тогда
		ДобавитьТоварыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьТоварыНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИндНомер.индкод
		|ИЗ
		|	РегистрСведений.ИндНомер КАК ИндНомер
		|ГДЕ
		|	ИндНомер.Стеллаж = &Стеллаж";
	
	Запрос.УстановитьПараметр("Стеллаж", Стеллаж);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_индкод = РезультатЗапроса.Выгрузить(); 
		Флаг = Истина; 
	КонецЕсли;

	Если Флаг ТОгда 
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаходАкция10.Ссылка
			|ИЗ
			|	Документ.ЗаходАкция10 КАК ЗаходАкция10
			|ГДЕ
			|	ЗаходАкция10.ДатаАкции = &ДатаАкции";
		
		Запрос.УстановитьПараметр("ДатаАкции", ДатаПроведенияАкции);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗаходАкция10 = Выборка.Ссылка; 
		иначе 
			 Сообщение = Новый СообщениеПользователю;
	         Сообщение.Текст = "Не найден документ ""ЗаходАкция10"" с актуальной датой проведения акции";
	         Сообщение.Сообщить();
			 Возврат; 
		КонецЕсли; 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РегистрНакопления1Остатки.Товар КАК Номенклатура,
			|	РегистрНакопления1Остатки.индкод КАК Партия,
			|	РегистрНакопления1Остатки.Склад КАК Склад,
			|	РегистрНакопления1Остатки.машина КАК Машина,
			|	Номенклатура.РекомендованаяЦена КАК ЦенаРек,
			|   1 КАК Количество
			|ИЗ
			|	РегистрНакопления.РегистрНакопления1.Остатки(&Дата, индкод В (&ТЗ)) КАК РегистрНакопления1Остатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО РегистрНакопления1Остатки.Товар = Номенклатура.Ссылка";
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ_индкод);
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
		РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ДокументЗаходАкция10 = ЗаходАкция10.ПолучитьОбъект(); 
				ДокументЗаходАкция10.Товары.Загрузить(РезультатЗапроса.Выгрузить());
				ДокументЗаходАкция10.Записать(РежимЗаписиДокумента.Проведение);
			Иначе 
				Сообщение = Новый СообщениеПользователю;
		        Сообщение.Текст = "На стеллаже нет деталей";
		        Сообщение.Сообщить();
				Возврат; 
			КонецЕсли; 
			
	КонецЕсли; 
	
	
КонецПроцедуры
