#Область Акция10_10

&НаКлиенте
Процедура ДобавитьТовары(Команда)
	
	Если ЗначениеЗаполнено(Стеллаж)  И ЗначениеЗаполнено(ДатаПроведенияАкции) Тогда
		ДобавитьТоварыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ДобавитьТоварыНаСервере()
	Флаг = Ложь; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИндНомер.индкод
		|ИЗ
		|	РегистрСведений.ИндНомер КАК ИндНомер
		|ГДЕ
		|	ИндНомер.Стеллаж = &Стеллаж";
	
	Запрос.УстановитьПараметр("Стеллаж", Стеллаж);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_индкод = РезультатЗапроса.Выгрузить(); 
		Флаг = Истина; 
	КонецЕсли;

	Если Флаг ТОгда 
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ЗаходАкция10.Ссылка
			|ИЗ
			|	Документ.ЗаходАкция10 КАК ЗаходАкция10
			|ГДЕ
			|	ЗаходАкция10.ДатаАкции = &ДатаАкции
			|	И ЗаходАкция10.Стеллаж = &Стеллаж";
		
		Запрос.УстановитьПараметр("ДатаАкции", ДатаПроведенияАкции);
		Запрос.УстановитьПараметр("Стеллаж", Стеллаж);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ЗаходАкция10 = Выборка.Ссылка; 
		иначе 
			 Сообщение = Новый СообщениеПользователю;
	         Сообщение.Текст = "Не найден документ ""ЗаходАкция10"" с актуальной датой проведения акции";
	         Сообщение.Сообщить();
			 Возврат; 
		КонецЕсли; 
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РегистрНакопления1Остатки.Товар КАК Номенклатура,
			|	РегистрНакопления1Остатки.индкод КАК Партия,
			|	РегистрНакопления1Остатки.Склад КАК Склад,
			|	РегистрНакопления1Остатки.машина КАК Машина,
			|	Номенклатура.РекомендованаяЦена КАК ЦенаРек,
			|   1 КАК Количество
			|ИЗ
			|	РегистрНакопления.РегистрНакопления1.Остатки(&Дата, индкод В (&ТЗ)) КАК РегистрНакопления1Остатки
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО РегистрНакопления1Остатки.Товар = Номенклатура.Ссылка";
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ_индкод);
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
		РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ДокументЗаходАкция10 = ЗаходАкция10.ПолучитьОбъект(); 
				ДокументЗаходАкция10.Товары.Очистить();
				ДокументЗаходАкция10.Товары.Загрузить(РезультатЗапроса.Выгрузить());
				ДокументЗаходАкция10.Записать(РежимЗаписиДокумента.Проведение);
			Иначе 
				Сообщение = Новый СообщениеПользователю;
		        Сообщение.Текст = "На стеллаже нет деталей";
		        Сообщение.Сообщить();
				Возврат; 
			КонецЕсли; 
			
	КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура УбратьТоварыИзАкции(Команда)
		Если ЗначениеЗаполнено(СтеллажУбратьТовары)  И ЗначениеЗаполнено(ДатаПроведенияАкцииУбратьТовары) Тогда
		УбратьТоварыНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура УбратьТоварыНаСервере()
	
	Флаг = Ложь; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ИндНомер.индкод
		|ПОМЕСТИТЬ ВТ_ИндНомер
		|ИЗ
		|	РегистрСведений.ИндНомер КАК ИндНомер
		|ГДЕ
		|	ИндНомер.Стеллаж = &Стеллаж
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ИндНомер.индкод
		|ИЗ
		|	ВТ_ИндНомер КАК ВТ_ИндНомер
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрАкция10.Остатки(&Дата, индкод В
		|			(ВЫБРАТЬ
		|				Т.индкод
		|			ИЗ
		|				ВТ_ИндНомер КАК Т)) КАК РегистрАкция10Остатки
		|		ПО РегистрАкция10Остатки.индкод = ВТ_ИндНомер.индкод
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0";
	
	Запрос.УстановитьПараметр("Стеллаж", СтеллажУбратьТовары);
	Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_индкод = РезультатЗапроса.Выгрузить(); 
		Флаг = Истина; 
	КонецЕсли;

	Если Флаг ТОгда 
	
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ВыходТоваровИзАкции10.Ссылка
			|ИЗ
			|	Документ.ВыходТоваровИзАкции10 КАК ВыходТоваровИзАкции10
			|ГДЕ
			|	ВыходТоваровИзАкции10.ДатаАкции = &ДатаАкции";
		
		Запрос.УстановитьПараметр("ДатаАкции", ДатаПроведенияАкцииУбратьТовары);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка = РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			ВыходТоваровИзАкции10 = Выборка.Ссылка; 
		иначе 
			 Сообщение = Новый СообщениеПользователю;
	         Сообщение.Текст = "Не найден документ ""Выход товаров из акции10"" с актуальной датой проведения акции";
	         Сообщение.Сообщить();
			 Возврат; 
		КонецЕсли; 
		
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РегистрАкция10.Товар КАК Номенклатура,
			|	РегистрАкция10.индкод КАК Партия,
			|	РегистрАкция10.Склад КАК Склад,
			|	РегистрАкция10.машина КАК Машина,
			|	Номенклатура.РекомендованаяЦена КАК ЦенаРек,
			|   1 КАК Количество
			|ИЗ
			|	РегистрНакопления.РегистрАкция10.Остатки(&Дата, индкод В (&ТЗ)) КАК РегистрАкция10
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
			|		ПО РегистрАкция10.Товар = Номенклатура.Ссылка";
		
		Запрос.УстановитьПараметр("ТЗ", ТЗ_индкод);
		Запрос.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
		РезультатЗапроса = Запрос.Выполнить();
			
			Если НЕ РезультатЗапроса.Пустой() Тогда
				ДокументВыходТоваровИзАкции10 = ВыходТоваровИзАкции10.ПолучитьОбъект(); 
				ДокументВыходТоваровИзАкции10.Товары.Очистить();
				ДокументВыходТоваровИзАкции10.Товары.Загрузить(РезультатЗапроса.Выгрузить());
				ДокументВыходТоваровИзАкции10.Записать(РежимЗаписиДокумента.Проведение);
			Иначе 
				Сообщение = Новый СообщениеПользователю;
		        Сообщение.Текст = "На стеллаже нет деталей";
		        Сообщение.Сообщить();
				Возврат; 
			КонецЕсли; 
			
	КонецЕсли; 
	
КонецПроцедуры
#КонецОбласти