
Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ДвижениеТМЦ Приход
	Движения.ДвижениеТМЦ.Записывать = Истина;
	Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
		Движение = Движения.ДвижениеТМЦ.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
		Движение.МестоХранения = Склад;
		Движение.Код = ТекСтрокаСписокТМЦ.Код;
		Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
		Движение.Цена = ТекСтрокаСписокТМЦ.Цена;
		Движение.ТМЦПоНакладной = ТекСтрокаСписокТМЦ.ТМЦ.ТМЦПоНакладной;
	КонецЦикла;
	
	//// регистр ДвижениеТМЦСкладСнабжение Приход
	//Движения.ДвижениеТМЦСкладСнабжение.Записывать = Истина;
	//Для Каждого ТекСтрокаСписокТМЦ Из СписокТМЦ Цикл
	//	Движение = Движения.ДвижениеТМЦСкладСнабжение.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.ТМЦ = ТекСтрокаСписокТМЦ.ТМЦ;
	//	Движение.МестоХранения = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//	Движение.ИндКод = ТекСтрокаСписокТМЦ.Код;
	//	Движение.Количество = ТекСтрокаСписокТМЦ.Количество;
	//	Движение.Цена = ТекСтрокаСписокТМЦ.Цена;
	//	Движение.ТМЦПоНакладной = ТекСтрокаСписокТМЦ.ТМЦ.ТМЦПоНакладной;
	//КонецЦикла;

КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
	Склад = Справочники.Стеллаж.НайтиПоКоду("000000530");
	
	///+ГомзМА 10.04.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаявкаНаРасход") Тогда
		
		Ответственный = Ответственный;
		Склад = Справочники.Стеллаж.НайтиПоКоду("000000530");
		Поставщик = ДанныеЗаполнения.Получатель;
		ЗаявкаНаРасход = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = СписокТМЦ.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Склад = Склад;
			НоваяСтрока.Сумма = ТекСтрокаТовары.Сумма;
			НоваяСтрока.ТМЦПоНакладной = ТекСтрокаТовары.Товар;
			НоваяСтрока.Цена = ТекСтрокаТовары.Цена;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 10.04.2023
	
КонецПроцедуры



Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	СуммаДокумента = СписокТМЦ.Итог("Сумма");
	
	
	/////+ГомзМА 11.04.2023
	////Проверка на существующую запись ПоступлениеТМЦСкладСнабжение для текущего документа
	//Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ
	//	|	ПоступлениеТМЦСкладСнабжение.Ссылка КАК Ссылка
	//	|ИЗ
	//	|	Документ.ПоступлениеТМЦСкладСнабжение КАК ПоступлениеТМЦСкладСнабжение
	//	|ГДЕ
	//	|	ПоступлениеТМЦСкладСнабжение.ПоступлениеТМЦ = &ПоступлениеТМЦ";
	//
	//Запрос.УстановитьПараметр("ПоступлениеТМЦ", Ссылка);
	//
	//РезультатЗапроса = Запрос.Выполнить().Выбрать();
	//
	//РезультатЗапроса.Следующий();
	//
	//Если РезультатЗапроса.Количество() = 0 И ЭтотОбъект.ПометкаУдаления = Ложь Тогда
	//	//Создание документа ПоступлениеТМЦСкладСнабжение на основании текущего документа
	//	НовыйДокумент = Документы.ПоступлениеТМЦСкладСнабжение.СоздатьДокумент();
	//	НовыйДокумент.Дата = ТекущаяДатаСеанса();
	//	НовыйДокумент.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//	НовыйДокумент.Ответственный = Ответственный;
	//	НовыйДокумент.Поставщик = Поставщик;
	//	НовыйДокумент.НомерСчета = НомерСчета;
	//	НовыйДокумент.УПД = УПД;
	//	НовыйДокумент.ДатаСчета = ДатаСчета;
	//	НовыйДокумент.ДатаУПД = ДатаУПД;
	//	НовыйДокумент.Да = Ложь;
	//	
	//	Для каждого СтрокаТЧ Из СписокТМЦ Цикл
	//		НоваяСтрокаТЧ = НовыйДокумент.СписокТМЦ.Добавить();
	//		НоваяСтрокаТЧ.Код = СтрокаТЧ.Код;
	//		НоваяСтрокаТЧ.ТМЦ = СтрокаТЧ.ТМЦ;
	//		НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество;
	//		НоваяСтрокаТЧ.Цена = СтрокаТЧ.Цена;
	//		НоваяСтрокаТЧ.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//		НоваяСтрокаТЧ.Сумма = СтрокаТЧ.Сумма;
	//		НоваяСтрокаТЧ.ТМЦПоНакладной = СтрокаТЧ.ТМЦПоНакладной;
	//	КонецЦикла;
	//	
	//	НовыйДокумент.ПоступлениеТМЦ = Ссылка;
	//	
	//	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	//ИначеЕсли РезультатЗапроса.Количество() <> 0 И ЭтотОбъект.ПометкаУдаления = Ложь Тогда
	//	//Если ФормаДокумента.Модифицированность = Истина Тогда
	//		ДокПоступлениеСкладСнабжение = РезультатЗапроса.Ссылка.ПолучитьОбъект();
	//		ДокПоступлениеСкладСнабжение.Дата = ТекущаяДатаСеанса();
	//		ДокПоступлениеСкладСнабжение.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//		ДокПоступлениеСкладСнабжение.Ответственный = Ответственный;
	//		ДокПоступлениеСкладСнабжение.Поставщик = Поставщик;
	//		ДокПоступлениеСкладСнабжение.НомерСчета = НомерСчета;
	//		ДокПоступлениеСкладСнабжение.УПД = УПД;
	//		ДокПоступлениеСкладСнабжение.ДатаСчета = ДатаСчета;
	//		ДокПоступлениеСкладСнабжение.ДатаУПД = ДатаУПД;
	//		ДокПоступлениеСкладСнабжение.Да = Ложь;
	//		ДокПоступлениеСкладСнабжение.СписокТМЦ.Очистить();
	//		
	//		Для каждого СтрокаТЧ Из СписокТМЦ Цикл
	//			НоваяСтрокаТЧ = ДокПоступлениеСкладСнабжение.СписокТМЦ.Добавить();
	//			НоваяСтрокаТЧ.Код = СтрокаТЧ.Код;
	//			НоваяСтрокаТЧ.ТМЦ = СтрокаТЧ.ТМЦ;
	//			НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество;
	//			НоваяСтрокаТЧ.Цена = СтрокаТЧ.Цена;
	//			НоваяСтрокаТЧ.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
	//			НоваяСтрокаТЧ.Сумма = СтрокаТЧ.Сумма;
	//			НоваяСтрокаТЧ.ТМЦПоНакладной = СтрокаТЧ.ТМЦПоНакладной;
	//		КонецЦикла;
	//		
	//		ДокПоступлениеСкладСнабжение.Записать(РежимЗаписиДокумента.Проведение);
	//		
	//	//КонецЕсли;
	//	
	//КонецЕсли;
	/////-ГомзМА 11.04.2023
	
КонецПроцедуры


Процедура ПриЗаписи(Отказ)
	
		///+ГомзМА 11.04.2023
	//Проверка на существующую запись ПоступлениеТМЦСкладСнабжение для текущего документа
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПоступлениеТМЦСкладСнабжение.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ПоступлениеТМЦСкладСнабжение КАК ПоступлениеТМЦСкладСнабжение
		|ГДЕ
		|	ПоступлениеТМЦСкладСнабжение.ПоступлениеТМЦ = &ПоступлениеТМЦ";
	
	Запрос.УстановитьПараметр("ПоступлениеТМЦ", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	Если РезультатЗапроса.Количество() = 0 И ЭтотОбъект.ПометкаУдаления = Ложь Тогда
		//Создание документа ПоступлениеТМЦСкладСнабжение на основании текущего документа
		НовыйДокумент = Документы.ПоступлениеТМЦСкладСнабжение.СоздатьДокумент();
		НовыйДокумент.Дата = ТекущаяДатаСеанса();
		НовыйДокумент.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
		НовыйДокумент.Ответственный = Ответственный;
		НовыйДокумент.Поставщик = Поставщик;
		НовыйДокумент.НомерСчета = НомерСчета;
		НовыйДокумент.УПД = УПД;
		НовыйДокумент.ДатаСчета = ДатаСчета;
		НовыйДокумент.ДатаУПД = ДатаУПД;
		//НовыйДокумент.Да = Ложь;
		НовыйДокумент.Организация = Организация;
		
		Для каждого СтрокаТЧ Из СписокТМЦ Цикл
			НоваяСтрокаТЧ = НовыйДокумент.СписокТМЦ.Добавить();
			НоваяСтрокаТЧ.Код = СтрокаТЧ.Код;
			НоваяСтрокаТЧ.ТМЦ = СтрокаТЧ.ТМЦ;
			НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество;
			НоваяСтрокаТЧ.Цена = СтрокаТЧ.Цена;
			НоваяСтрокаТЧ.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
			НоваяСтрокаТЧ.Сумма = СтрокаТЧ.Сумма;
			НоваяСтрокаТЧ.ТМЦПоНакладной = СтрокаТЧ.ТМЦПоНакладной;
		КонецЦикла;
		
		НовыйДокумент.ПоступлениеТМЦ = Ссылка;
		
		НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	ИначеЕсли РезультатЗапроса.Количество() <> 0 И ЭтотОбъект.ПометкаУдаления = Ложь Тогда
		//Если ФормаДокумента.Модифицированность = Истина Тогда
			ДокПоступлениеСкладСнабжение = РезультатЗапроса.Ссылка.ПолучитьОбъект();
			ДокПоступлениеСкладСнабжение.Дата = ТекущаяДатаСеанса();
			ДокПоступлениеСкладСнабжение.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
			ДокПоступлениеСкладСнабжение.Ответственный = Ответственный;
			ДокПоступлениеСкладСнабжение.Поставщик = Поставщик;
			ДокПоступлениеСкладСнабжение.НомерСчета = НомерСчета;
			ДокПоступлениеСкладСнабжение.УПД = УПД;
			ДокПоступлениеСкладСнабжение.ДатаСчета = ДатаСчета;
			ДокПоступлениеСкладСнабжение.ДатаУПД = ДатаУПД;
			//ДокПоступлениеСкладСнабжение.Да = Ложь;
			ДокПоступлениеСкладСнабжение.Организация = Организация;
			ДокПоступлениеСкладСнабжение.СписокТМЦ.Очистить();
			
			Для каждого СтрокаТЧ Из СписокТМЦ Цикл
				НоваяСтрокаТЧ = ДокПоступлениеСкладСнабжение.СписокТМЦ.Добавить();
				НоваяСтрокаТЧ.Код = СтрокаТЧ.Код;
				НоваяСтрокаТЧ.ТМЦ = СтрокаТЧ.ТМЦ;
				НоваяСтрокаТЧ.Количество = СтрокаТЧ.Количество;
				НоваяСтрокаТЧ.Цена = СтрокаТЧ.Цена;
				НоваяСтрокаТЧ.Склад = Справочники.Стеллаж.НайтиПоКоду("000000871");
				НоваяСтрокаТЧ.Сумма = СтрокаТЧ.Сумма;
				НоваяСтрокаТЧ.ТМЦПоНакладной = СтрокаТЧ.ТМЦПоНакладной;
			КонецЦикла;
			
			ДокПоступлениеСкладСнабжение.Записать(РежимЗаписиДокумента.Проведение);
			
			
			
		//КонецЕсли;
		
	КонецЕсли;
	///-ГомзМА 11.04.2023
	
КонецПроцедуры


