
&НаКлиенте
Процедура МестоНаСкладеПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	УстановитьПараметр(МестоНаСкладе);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
	Реквизит1.Параметры.УстановитьЗначениеПараметра("МестоНаСкладе",Справочники.Стеллаж.НайтиПоКоду("0000001"));
	МестоНаСкладе = Справочники.Стеллаж.НайтиПоКоду("0000001");
	
КонецПроцедуры


&НаСервере
Процедура УстановитьПараметр(МестоНаСкладе1)
	Реквизит1.Параметры.УстановитьЗначениеПараметра("МестоНаСкладе",МестоНаСкладе);
КонецПроцедуры

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДокумент = ПолучитьТабличныйДокумент();
	ТабДокумент.Показать();


КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция ПолучитьТабличныйДокумент()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("шапка");
	ТабДокумент.Вывести(ОбластьМакета);
	строка =   Макет.ПолучитьОбласть("строка");
	тбл = табл();
	Для Каждого стр Из тбл Цикл
		строка.Параметры.код = стр.Код;
		строка.Параметры.артикул = стр.Артикул;
		строка.Параметры.бренд = стр.Бренд;
		Если стр.Фото <> Ложь Тогда 
			строка.Параметры.фото = стр.Фото;
		КонецЕсли;
		строка.Параметры.название = стр.Наименование;
		строка.Параметры.колво = стр.КолвоОстаток;
		строка.Параметры.место = стр.МестоНаСкладе2;
		ТабДокумент.Вывести(строка);
	КонецЦикла;
	
	Возврат ТабДокумент;
	
КонецФункции // ПолучитьТабличныйДокумент()


&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.Отчет1.ПолучитьМакет(название);
КонецФункции

&НаСервере
Функция табл()
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	Номенклатура.Код КАК Код,
	                |	Номенклатура.Артикул,
					|	Номенклатура.Бренд,
					|	Номенклатура.Фото,
	                |	Номенклатура.Наименование,
	                |	Номенклатура.МестоНаСкладе2,
	                |	РегистрНакопления1Остатки.КолвоОстаток
	                |ИЗ
	                |	РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
	                |		ПО РегистрНакопления1Остатки.Товар = Номенклатура.Ссылка
	                |ГДЕ
	                |	РегистрНакопления1Остатки.КолвоОстаток > 0
	                |	И Номенклатура.МестоНаСкладе2 = &МестоНаСкладе
	                |
	                |УПОРЯДОЧИТЬ ПО
	                |	Код";
	Запрос.УстановитьПараметр("МестоНаСкладе",МестоНаСкладе);
	результат = Запрос.Выполнить();
	Возврат результат.Выгрузить();
КонецФункции




