&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание",  Запись.НомерТелефона);
	//ПараметрыФормы.Вставить("Клиент1С", Запись.Клиент);

		
ОткрытьФорму("Документ.заказклиента.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКлиента(Команда)
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Основание",  Запись.НомерТелефона);
	ОткрытьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьДопНомер(Команда)
	ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборКлиента",ЭтаФорма);
	//ОткрытьФорму("");
	ОткрытьФорму("Справочник.Клиенты.ФормаВыбора",,,,,,
ОписаниеВыбора,
РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Элементы.СписокЧек.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборКлиента(РезультатЗакрытия,ДопПараметры) Экспорт
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
ЗаписьДопНомера(РезультатЗакрытия);
КонецПроцедуры

Процедура ЗаписьДопНомера(Результат)
	Отбор = Новый Структура();
	Отбор.Вставить("Телефон", Запись.НомерТелефона);
	ОбОбъект = Результат.ссылка.ПолучитьОбъект();
	НайденныеСтроки = ОбОбъект.ДополнительныеКонтакты.НайтиСтроки(Отбор);
	Если  НайденныеСтроки.Количество() = 0 тогда
		НоваяСтрока = ОбОбъект.ДополнительныеКонтакты.Добавить();
		НоваяСтрока.Телефон = Запись.НомерТелефона;
		ОбОбъект.Записать();
	КонецЕсли;
МассивПараметров = Новый Массив;
МассивПараметров.Добавить(строка(Запись.НомерТелефона));

ФоновыеЗадания.Выполнить("МоиЗвонкиИЗаявки.ПолучитьТаблицуЗвонковПоНомеруТелефонаОбр",МассивПараметров,Новый УникальныйИдентификатор);	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Запись.РучноеРедактирование = Истина;
	Если ЗначениеЗаполнено(Запись.ФИОРОКК) Тогда
		Запись.АудитПроверен = Истина;
	Иначе
		Запись.АудитПроверен = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ЗаявкаПриИзменении(Элемент)
	Запись.Сумма        = ПолучитьСумму();
	Запись.СтатусЗаявки = ПолучитьСтатусЗаявки();
КонецПроцедуры

Функция ПолучитьСумму()
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Заявка,"СуммаДокумента");
КонецФункции

Функция ПолучитьСтатусЗаявки()
	Возврат ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Запись.Заявка,"Состояние");
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ГомзМА 25.01.2023
	ТекущийПользователь = Пользователи.ТекущийПользователь();
	
	Доступно = Ложь;
	Если ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Карпова Екатерина Николаевна") ИЛИ 
		 ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Шлеенкова Виктория Алексеевна") Тогда
		Доступно = Истина;
	КонецЕсли;
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("дт_ПолныеПрава")) ИЛИ
		 ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("ПолныеПрава")) ИЛИ 
		 ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("Руководитель")) ИЛИ
		 ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("Контролёр")) ИЛИ
		 Доступно Тогда
		Элементы.КомментарийАудитора.ТолькоПросмотр = Ложь;
	Иначе
		Элементы.КомментарийАудитора.ТолькоПросмотр = Истина;
	КонецЕсли;
	///-ГомзМА 25.01.2023
	
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("дт_ПолныеПрава")) ИЛИ
		 ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("ПолныеПрава")) Тогда
		 Элементы.РучноеРедактирование.ТолькоПросмотр = Ложь;
	 Иначе
		 Элементы.РучноеРедактирование.ТолькоПросмотр = Истина;
	КонецЕсли;

	Элементы.КомментарийАудитора.ПодсказкаВвода = "Обращение:" + Символы.пс + "Замечание:" + Символы.ПС + "Комментарий:" + Символы.ПС + "Рекомендация:";
	
	Если ТекущийПользователь = Справочники.Пользователи.НайтиПоНаименованию("Карпова Екатерина Николаевна") Тогда
		Элементы.КомментарийРОКК.ТолькоПросмотр = Ложь;
		Элементы.ФИОРОКК.ТолькоПросмотр 		= Ложь;
		Элементы.АудитПроверен.ТолькоПросмотр 	= Ложь;
	Иначе
		Элементы.КомментарийРОКК.ТолькоПросмотр = Истина;
		Элементы.ФИОРОКК.ТолькоПросмотр 		= Истина;
		Элементы.АудитПроверен.ТолькоПросмотр 	= Истина;
	КонецЕсли;	
		
КонецПроцедуры

&НаСервере
Процедура КомментарийАудитораПриИзмененииНаСервере()
Запись.ФИОАудитора = Пользователи.ТекущийПользователь();

КонецПроцедуры

&НаКлиенте
Процедура КомментарийАудитораПриИзменении(Элемент)
	КомментарийАудитораПриИзмененииНаСервере();
	//Запись.РучноеРедактирование = Истина;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	///+ГомзМА 07.03.2023
	Если Запись.НомерТелефона = "Unknown" Тогда
		Элементы.НомерТелефона.ТолькоПросмотр 	= Ложь;
		Элементы.НомерТелефона.Маска 			= "+7 999 999-99-99";
	Иначе
		Элементы.НомерТелефона.ТолькоПросмотр = Истина;
	КонецЕсли;
	
	Если Запись.Клиент.Пустая() Тогда
		Элементы.Клиент.ТолькоПросмотр 	= Ложь;
	Иначе
		Элементы.Клиент.ТолькоПросмотр 	= Истина;
	КонецЕсли;
	///-ГомзМА 07.03.2023
	
КонецПроцедуры

&НаКлиенте
Процедура НомерТелефонаПриИзменении(Элемент)
	
	Запись.РучноеРедактирование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КлиентПриИзменении(Элемент)
	
	Запись.РучноеРедактирование = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийПриИзменении(Элемент)
	Запись.РучноеРедактирование = Истина;
КонецПроцедуры

&НаСервере
Процедура КомментарийРОККПриИзмененииНаСервере()
	
	///+ГомзМА 21.04.2023
	Запись.ФИОРОКК = Пользователи.ТекущийПользователь();
	///-ГомзМА 21.04.2023
	
КонецПроцедуры

&НаКлиенте
Процедура КомментарийРОККПриИзменении(Элемент)
	КомментарийРОККПриИзмененииНаСервере();
КонецПроцедуры



