#Область ОбработчикиСобытийФормы



&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	//Элементы = Форма.Элементы;
	//ИспользоватьРазборку = Форма.ПолучитьФункциональнуюОпциюФормы("дт_ИспользоватьРазборку");
	//ИспользоватьАвтосервис = Форма.ПолучитьФункциональнуюОпциюФормы("дт_ИспользоватьАвтосервис");
	//
	//Элементы.СписокГруппаДетально.Видимость = ИспользоватьАвтосервис И НЕ ИспользоватьРазборку;
	
КонецПроцедуры

#КонецОбласти