Процедура ЗаполнитьПодвал()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаЗП.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаОкладов.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаБонусовИПремий.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаРасходов.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.Обязательные.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;	
	ЭтотОбъект.ЭтаФорма.Элементы.Переменные.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.НеПредвиденные.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
		
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаЗП.ТекстПодвала =  Формат(Результат.Итог("СуммаЗП"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаОкладов.ТекстПодвала =  Формат(Результат.Итог("СуммаОкладов"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаБонусовИПремий.ТекстПодвала =  Формат(Результат.Итог("СуммаБонусовИПремий"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СуммаРасходов.ТекстПодвала =  Формат(Результат.Итог("СуммаРасходов"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Обязательные.ТекстПодвала =  Формат(Результат.Итог("Обязательные"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.Переменные.ТекстПодвала =  Формат(Результат.Итог("Переменные"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.НеПредвиденные.ТекстПодвала =  Формат(Результат.Итог("НеПредвиденные"),"ЧДЦ=0; ЧН=-");
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьСвязиДляОтбора(Команда)
	ЗаполнитьСвязиДляОтбораНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСвязиДляОтбораНаСервере()
	
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВидыРасходов_3.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.ВидыРасходов_3 КАК ВидыРасходов_3";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		
		СсылкаНаВидРасх	=	ВыборкаДетальныеЗаписи.Ссылка; 
		ТоварОбъект = СсылкаНаВидРасх.ПолучитьОбъект(); 
		
		Категории 		= ТоварОбъект.Родитель; 	
		Одел			= Категории.Родитель; 
		ТоварОбъект.РодительРодитель = Одел; 
		
		ТоварОбъект.Записать(); 
	КонецЦикла;
	
	

КонецПроцедуры
