

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЦФО", ЦФО) Тогда
		
		Элементы.ЦФО.ТолькоПросмотр = Истина; 
	Иначе
		Элементы.ЦФО.Видимость = Ложь; 
	КонецЕсли;
	
	УправлениеФормой();
	
КонецПроцедуры

#Область ОбработчикиСобытийФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ЦФОПриИзменении(Элемент)
	УправлениеФормой();
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеФормой()
		
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Ссылка", 
		ЦФО, 
		ВидСравненияКомпоновкиДанных.ВИерархии, , ЗначениеЗаполнено(ЦФО)
	);
		
КонецПроцедуры



#КонецОбласти