
//Возвращает компоненту для генерации штрих-кодов (пример использования - см. общую форму))
//Возврат Неопределено - ошибка. Описание ошибки помещаетя в параметр ТекстОшибки
Функция ПолучитьКомпонентуШтрихКодирования(ТекстОшибки="") Экспорт
	
	//1. Для корректной работы в тонком и веб-клиентах где-то на клиенте нужно вызвать этот блок:
	//Если НЕ ГенераторШтрихКодаКлиент.УстановитьКомпонентуШтрихКодирования(ТекстОшибки) Тогда 
	//	//Предпринять что-то при ошибки установки компоненты на клиенте	
	//КонецЕсли;
	
	
	//2. Подключение компоненты из общего макета
	Местоположение		= "ОбщийМакет.КомпонентаПечатиШтрихкодов";
	Идентификатор		= "Barcode";
	СимволическоеИмя	= Идентификатор + "SymbolicName";
	ПодключаемыйМодуль	= Неопределено;
	
	Если ПодключитьВнешнююКомпоненту(Местоположение, СимволическоеИмя) Тогда
		
		Попытка
			ПодключаемыйМодуль = Новый("AddIn." + СимволическоеИмя + "." + Идентификатор);
			Если ПодключаемыйМодуль = Неопределено Тогда 
				ТекстОшибки = "Неизвестная ошибка подключения внешней компоненты";
				Возврат Неопределено; //ОШИБКА
			КонецЕсли;
		Исключение
			ТекстОшибки = "ОШИБКА ПОДКЛЮЧЕНИЯ ВНЕШНЕЙ КОМПОНЕНТЫ: " + ОписаниеОшибки();
			Возврат Неопределено; //ОШИБКА
		КонецПопытки;
		
	Иначе //подключение не удалось
		ТекстОшибки = "Ошибка подключения внешней компоненты. Метод подключения вернул Ложь";
		Возврат Неопределено; //ОШИБКА
	КонецЕсли;
	
	
	//3. Если нет возможности рисовать - ошибка
	Если НЕ ПодключаемыйМодуль.ГрафикаУстановлена Тогда
		// То картинку сформировать не сможем.
		ТекстОшибки = "Компонента не может сгенерировать графисеское представление штрихкода";
		Возврат Неопределено; //ОШИБКА
	КонецЕсли;
	
	
	Возврат ПодключаемыйМодуль;
	
	
КонецФункции//ПолучитьКомпонентуШтрихКодирования
