
&НаСервере
Процедура СтатусВакансииПриИзмененииНаСервере()
	Если Статус = "0" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Статус", 
		Ложь, // Значение отбора
		ВидСравненияКомпоновкиДанных.Равно,, Истина);
	КонецЕсли;
	
	Если Статус = "1" Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Статус", 
		Истина, // Значение отбора
		ВидСравненияКомпоновкиДанных.Равно,, Истина);	
	КонецЕсли;
	
	Если Статус = "2" Тогда
		ДоступныеСтатусы = Новый СписокЗначений;
		ДоступныеСтатусы.Добавить(Истина);
		ДоступныеСтатусы.Добавить(Ложь);
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Статус", 
		ДоступныеСтатусы, // Значение отбора
		ВидСравненияКомпоновкиДанных.ВСписке,, Истина);	
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СтатусВакансииПриИзменении(Элемент)
	СтатусВакансииПриИзмененииНаСервере();
	КонецПроцедуры

