Процедура ПеремещениеДеталейРВР(СтароеМестоХранения = неопределено,НовоеМестоХранения  = неопределено, Партия) ЭКСПОРТ

//=====================================================================================================================
//Работаем С РВР
БылаНаРВР = Ложь; 
БудетНаРВР = Ложь; 

Если СтрНайти(Строка(СтароеМестоХранения), "yachejka RVR") <> 0 ИЛИ СтрНайти(Строка(СтароеМестоХранения), "Сервисные услуги")  <> 0 ТОгда 
	БылаНаРВР = Истина; 
иначе 
	БылаНаРВР = Ложь; 
КонецЕСли; 

Если СтрНайти(Строка(НовоеМестоХранения), "yachejka RVR") <> 0 ИЛИ СтрНайти(Строка(НовоеМестоХранения), "Сервисные услуги")  <> 0 ТОгда 
	БудетНаРВР = Истина;
Иначе 
	БудетНаРВР = Ложь;  
КонецЕСли;

//======================================================================================================================
// Перенесли из РВР

		Если БылаНаРВР = Истина И БудетНаРВР = Ложь Тогда
				
				ЗапросПоПартии = Новый Запрос;
				ЗапросПоПартии.Текст =
				"ВЫБРАТЬ
				|	ЗаказНарядТовары.Ссылка
				|ИЗ
				|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
				|ГДЕ
				|	ЗаказНарядТовары.Партия.Наименование = &Партия";

				ЗапросПоПартии.УстановитьПараметр("Партия", Партия);
				РезультатЗапроса = ЗапросПоПартии.Выполнить();
				Если НЕ РезультатЗапроса.Пустой() Тогда
					
					Выборка = РезультатЗапроса.Выбрать();
					Выборка.Следующий();
					ЗаказНарядОбъект = Выборка.Ссылка.ПолучитьОбъект();
					СсылкаПартия = Справочники.ИндКод.НайтиПоНаименованию(Партия);
					ПараметрыОтбора = Новый Структура;
					ПараметрыОтбора.Вставить("Партия", СсылкаПартия);
					Массив = ЗаказНарядОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
					НайденнаяСтрока = Массив[0];
					
					Если НайденнаяСтрока <> Неопределено тогда 
						
						НайденнаяСтрока.Партия 		= Справочники.ИндКод.ПустаяСсылка(); 
						НайденнаяСтрока.Состояние	= Перечисления.СтатусыТовараВЗаказНаряде.Планово; 
						НайденнаяСтрока.Склад	 	= Справочники.Склады.ПустаяСсылка();   
						НайденнаяСтрока.Автомобиль 	= Справочники.Машины.ПустаяСсылка();
						ЗаказНарядОбъект.Записать(РежимЗаписиДокумента.Проведение); 
						
						Возврат;
					КонецЕсли;
				КонецЕсли; 
			КонецЕсли;

//======================================================================================================================
 
//======================================================================================================================
// Добавляем Партию В РВР
// При записи Регистра Сведений проверяется стеллаж, Если это ячейка РВР тогда в Заказ наряде в тч Товары меняется статус с "Планово" на "Собрано"
			
	Если БылаНаРВР = Ложь И БудетНаРВР = Истина Тогда
	// Сначала ищещем Заказ наряд по Партии в тч
		ЗапросПоПартии = Новый Запрос;
		ЗапросПоПартии.Текст =
		"ВЫБРАТЬ
		|	ЗаказНарядТовары.Ссылка,
		|	ЗаказНарядТовары.Состояние
		|ИЗ
		|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
		|ГДЕ
		|	ЗаказНарядТовары.Партия.Наименование = &Партия";

		ЗапросПоПартии.УстановитьПараметр("Партия", Партия);
		РезультатЗапроса = ЗапросПоПартии.Выполнить();
	
			
		Если РезультатЗапроса.Пустой() Тогда
		// Если не нашли по Партии, ищем по Номенклатуре
			СсылкаПартия = Справочники.ИндКод.НайтиПоНаименованию(Партия);	
			Номенклатура = СсылкаПартия.Владелец;  		
					
						ЗапросПоНоменклатуре = Новый Запрос;
						ЗапросПоНоменклатуре.Текст =
						"ВЫБРАТЬ
						|	ЗаказНарядТовары.Ссылка КАК Ссылка,
						|	ЗаказНарядТовары.Состояние КАК Состояние
						|ИЗ
						|	Документ.ЗаказНаряд.Товары КАК ЗаказНарядТовары
						|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ЗаказНаряд КАК ЗаказНаряд
						|		ПО (ЗаказНарядТовары.Ссылка = ЗаказНаряд.Ссылка)
						|ГДЕ
						|	ЗаказНарядТовары.Номенклатура = &Номенклатура
						|	И ЗаказНаряд.ЯчейкаРВР.Наименование = &ЯчейкаРВР";
	
						ЗапросПоНоменклатуре.УстановитьПараметр("Номенклатура"	, Номенклатура);
						ЗапросПоНоменклатуре.УстановитьПараметр("ЯчейкаРВР"		, НовоеМестоХранения);
						
						РезультатЗапроса = ЗапросПоНоменклатуре.Выполнить();
						Выборка = РезультатЗапроса.Выбрать();
						Пока	Выборка.Следующий() Цикл
							//ЗаказНарядОбъект = Выборка.Ссылка.ПолучитьОбъект();
							//НайденнаяСтрока = ЗаказНарядОбъект.Товары.НайтиСтроки(Стр.индкод.Владелец, "Номенклатура");									
			
								Если Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Планово
								Или Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.ПустаяСсылка()
								или Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Срочно
								или Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Ожидание 
								или Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Заказано Тогда   // "Ожидание" для WT10 | "Планово" для приложение склад
									
									ЗаказНарядОбъект = Выборка.Ссылка.ПолучитьОбъект();
									
									ПараметрыОтбора = Новый Структура;
									ПараметрыОтбора.Вставить("Номенклатура", Номенклатура);
									Массив = ЗаказНарядОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
									Строка = Массив[0]; 
																	
									Строка.Состояние		= Перечисления.СтатусыТовараВЗаказНаряде.Собрано;
									Строка.Партия			= СсылкаПартия;
									Стуктура 				= ЗаполнитьАвтомобильНаСервере(СсылкаПартия);
									Строка.Автомобиль		= Стуктура.Машина; 
									Строка.Склад			= Стуктура.Склад; 
									ЗаказНарядОбъект.Записать(РежимЗаписиДокумента.Проведение);
									Возврат;  
								КонецЕсли;   
						КонецЦикла; 			
					// Если нашли заказ по Партии в ТЧ, то дальше не ищем
					Иначе
						Выборка = РезультатЗапроса.Выбрать();
						Пока Выборка.Следующий() Цикл
							Если Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Планово
								Или Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.ПустаяСсылка() 
								или Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Срочно
								или Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Ожидание
								или Выборка.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Заказано Тогда   
									
									ЗаказНарядОбъект = Выборка.Ссылка.ПолучитьОбъект();
									ПараметрыОтбора = Новый Структура;
									ПараметрыОтбора.Вставить("Партия", СсылкаПартия);
									Массив = ЗаказНарядОбъект.Товары.НайтиСтроки(ПараметрыОтбора);
									НайденнаяСтрока = Массив[0];
									НайденнаяСтрока.Состояние = Перечисления.СтатусыТовараВЗаказНаряде.Собрано;
									ЗаказНарядОбъект.Записать(РежимЗаписиДокумента.Проведение);
									Возврат;
							КонецЕсли;
						КонецЦикла; 
					КонецЕсли;
	КонецЕсли; 

//=====================================================================================================================
//Работаем С ЗАЯВКАМИ	
	
	БылаВЗаявке = Ложь; 
	БудетВЗаявке = Ложь; 

Если СтрНайти(Строка(СтароеМестоХранения), "Korzina") <> 0  ТОгда 
	БылаВЗаявке = Истина; 
иначе 
	БылаВЗаявке = Ложь; 
КонецЕСли; 

Если СтрНайти(Строка(НовоеМестоХранения), "Korzina") <> 0  Тогда 
	БудетВЗаявке = Истина;
Иначе 
	БудетВЗаявке = Ложь;  
КонецЕСли;	

	Если БудетВЗаявке = Истина и БылаВЗаявке = Ложь ТОгда
			
			СсылкаПартия = Справочники.ИндКод.НайтиПоНаименованию(Партия);	
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|ГДЕ
				|	ЗаказКлиентаТовары.Партия.Наименование = &Партия";  
			
			Запрос.УстановитьПараметр("Партия", Партия);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			
			Пока Выборка.Следующий() Цикл
				Попытка
					ЗаказКлиента = 	Выборка.Ссылка.ПолучитьОбъект(); 
					ЗаказКлиента.Записать(РежимЗаписиДокумента.Запись); 
				Исключение 
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Ошибка!!! не получилось синхронизовать заявку. Пишите в тех поддержку! Код ошибки Инд432"; 
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЦикла;	
	
	ИначеЕСЛИ  БылаВЗаявке = Истина И БудетВЗаявке = Ложь Тогда 
			
			Запрос = Новый Запрос;
			Запрос.Текст = 
				"ВЫБРАТЬ
				|	ЗаказКлиентаТовары.Ссылка КАК Ссылка
				|ИЗ
				|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
				|ГДЕ
				|	ЗаказКлиентаТовары.Партия.Наименование = &Партия";  
			
			Запрос.УстановитьПараметр("Партия", Партия);
			РезультатЗапроса = Запрос.Выполнить();
			Выборка = РезультатЗапроса.Выбрать();
			Пока Выборка.Следующий() Цикл
				Попытка
					ЗаказКлиента = 	Выборка.Ссылка.ПолучитьОбъект(); 
					ЗаказКлиента.Записать(РежимЗаписиДокумента.Запись); 
				Исключение 
					Сообщение = Новый СообщениеПользователю();
					Сообщение.Текст = "Ошибка!!! не получилось синхронизовать заявку. Пишите в тех поддержку! Код ошибки Инд433"; 
					Сообщение.Сообщить();
				КонецПопытки;
			КонецЦикла;	
	КонецЕСли;

//=====================================================================================================================	
	
	
КонецПроцедуры

Функция ЗаполнитьАвтомобильНаСервере(Партия)
	
	Структура = новый Структура();	
	
	Запрос = Новый запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РегистрНакопления1Остатки.машина КАК Машина,
	|	РегистрНакопления1Остатки.Склад КАК Склад
	|ИЗ
	|	РегистрНакопления.РегистрНакопления1.Остатки(, индкод = &Партия) КАК РегистрНакопления1Остатки";
	Запрос.УстановитьПараметр("Партия",Партия);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Структура.Вставить("Машина",Выборка.Машина);
	Структура.Вставить("Склад",Выборка.Склад);
	Возврат Структура;
КонецФункции
