
&НаКлиенте
Процедура Печать(Команда)
	
	ТабДокумент = ПечатьСервер();
	ТабДокумент.Показать();

	
КонецПроцедуры

&НаСервере
Функция ПечатьСервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.ИтогСумма = ""+ИтогоРасходов()+"р.";
	ТабДокумент.Вывести(ОбластьМакета);
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Таблица1 = ПолучитьТаблицу();
	
	Для Каждого строка1 Из Таблица1 Цикл
		Строка.Параметры.Дата = строка1.Период;
		Строка.Параметры.Тип = строка1.ВидРасхода;
		Строка.Параметры.Комментарий = строка1.Комментарий;
		Строка.Параметры.НомДок = строка1.ДокНо;
		Строка.Параметры.Сумма = строка1.Сумма;
		ТабДокумент.Вывести(Строка);
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()


&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.РасходыДетальный.ПолучитьМакет(название);
КонецФункции

&НаСервере
Функция ПолучитьТаблицу()
	Запрос = Новый Запрос();
	Если ПериодС = ПериодПо Тогда
		Если ВидРасхода.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
	               |	ЛичныеРасходы.ВидРасхода,
	               |	ЛичныеРасходы.ДокНо,
	               |	ЛичныеРасходы.Сумма,
	               |	ЛичныеРасходы.Комментарий,
	               |	ЛичныеРасходы.Период
	               |ИЗ
	               |	РегистрНакопления.ЛичныеРасходы КАК ЛичныеРасходы";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
	               |	ЛичныеРасходы.ВидРасхода,
	               |	ЛичныеРасходы.ДокНо,
	               |	ЛичныеРасходы.Сумма,
	               |	ЛичныеРасходы.Комментарий,
	               |	ЛичныеРасходы.Период
	               |ИЗ
	               |	РегистрНакопления.ЛичныеРасходы КАК ЛичныеРасходы
				   |ГДЕ
				   |    ЛичныеРасходы.ВидРасхода = &ВидРасхода";
			Запрос.УстановитьПараметр("ВидРасхода",ВидРасхода) ;  
		КонецЕсли;
	Иначе
		Если ВидРасхода.Пустая() Тогда
		Запрос.Текст = "ВЫБРАТЬ
		               |	ЛичныеРасходы.ВидРасхода,
		               |	ЛичныеРасходы.ДокНо,
		               |	ЛичныеРасходы.Сумма,
		               |	ЛичныеРасходы.Комментарий,
		               |	ЛичныеРасходы.Период
		               |ИЗ
		               |	РегистрНакопления.ЛичныеРасходы КАК ЛичныеРасходы
		               |ГДЕ
		               |	ЛичныеРасходы.Период > &ДатНач
		               |	И ЛичныеРасходы.Период < &ДатКон";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
	               |	ЛичныеРасходы.ВидРасхода,
	               |	ЛичныеРасходы.ДокНо,
	               |	ЛичныеРасходы.Сумма,
	               |	ЛичныеРасходы.Комментарий,
	               |	ЛичныеРасходы.Период
	               |ИЗ
	               |	РегистрНакопления.ЛичныеРасходы КАК ЛичныеРасходы
				   |ГДЕ
				   |    ЛичныеРасходы.ВидРасхода = &ВидРасхода
				   |	И ЛичныеРасходы.Период > &ДатНач
		           |	И ЛичныеРасходы.Период < &ДатКон";
			Запрос.УстановитьПараметр("ВидРасхода",ВидРасхода) ;  
		КонецЕсли;
		Запрос.УстановитьПараметр("ДатНач",ПериодС);
		Запрос.УстановитьПараметр("ДатКон",ПериодПо);
	КонецЕсли;
	
		
	Реультат = Запрос.Выполнить();
    Возврат Реультат.Выгрузить();
КонецФункции

&НаСервере
Функция ИтогоРасходов()
	Запрос = Новый Запрос();
	Если ПериодС = ПериодПо Тогда
		Если ВидРасхода.Пустая() Тогда
			Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(ЛичныеРасходыОстатки.СуммаОстаток) КАК СуммаОстаток
		               |ИЗ
		               |	РегистрНакопления.ЛичныеРасходы.Остатки КАК ЛичныеРасходыОстатки";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(ЛичныеРасходыОстатки.СуммаОстаток) КАК СуммаОстаток
		               |ИЗ
		               |	РегистрНакопления.ЛичныеРасходы.Остатки КАК ЛичныеРасходыОстатки
		               |ГДЕ
		               |	ЛичныеРасходыОстатки.ВидРасхода = &ВидРасхода";
			Запрос.УстановитьПараметр("ВидРасхода",ВидРасхода);   
		КонецЕсли;
	Иначе
		Если ВидРасхода.Пустая() Тогда
			Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(ЛичныеРасходыОстатки.СуммаОборот) КАК СуммаОстаток
		               |ИЗ
		               |	РегистрНакопления.ЛичныеРасходы.Обороты(&ДатаНач, &ДатаКон) КАК ЛичныеРасходыОстатки";
		Иначе
			Запрос.Текст = "ВЫБРАТЬ
		               |	СУММА(ЛичныеРасходыОстатки.СуммаОборот) КАК СуммаОстаток
		               |ИЗ
		               |	РегистрНакопления.ЛичныеРасходы.Обороты(&ДатаНач, &ДатаКон) КАК ЛичныеРасходыОстатки
		               |ГДЕ
		               |	ЛичныеРасходыОстатки.ВидРасхода = &ВидРасхода";
			Запрос.УстановитьПараметр("ВидРасхода",ВидРасхода);   
		КонецЕсли;
		Запрос.УстановитьПараметр("ДатаНач",ПериодС);
		Запрос.УстановитьПараметр("ДатаКон",ПериодПо);
	КонецЕсли;
	
	Реультат = Запрос.Выполнить();
    Таблица = Реультат.Выгрузить();
	Возврат Таблица.Итог("СуммаОстаток");
КонецФункции;

