
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	ТаблицаДляСкрипта = ПолучитьСкрипт();
	пока  ТаблицаДляСкрипта.следующий() Цикл
		НоваяСтрока = Скрипт.Добавить();
		НоваяСтрока.Описание = ТаблицаДляСкрипта.Описание;	
	КонецЦикла
	
КонецПроцедуры




Функция  ПолучитьСкрипт()
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЧекЛистЧекЛист.Описание КАК Описание
	               |ИЗ
	               |	Документ.ЧекЛист.ЧекЛист КАК ЧекЛистЧекЛист
	               |ГДЕ
	               |	ЧекЛистЧекЛист.Ссылка = &Чеклист";
	Запрос.УстановитьПараметр("Чеклист", Константы.БЗДляДозвона.Получить());
	Выборка = запрос.Выполнить().Выбрать();

	Возврат Выборка;
	
КонецФункции

