
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		
		Дата		   = ТекущаяДата();
		Склад 		   = ДанныеЗаполнения.Склад;
		Клиент 	       = ДанныеЗаполнения.Клиент;
		Продажа 	   = ДанныеЗаполнения.Ссылка;
		Ответственный  = ДанныеЗаполнения.КтоПродал;
		СлужбаДоставки = ДанныеЗаполнения.Доставка;
		Инициатор 	   = Пользователи.ТекущийПользователь();
		Организация    = ДанныеЗаполнения.Организация;
		
		Для Каждого ТекСтрокаТаблица Из ДанныеЗаполнения.Таблица Цикл
			Если ТекСтрокаТаблица.Отменено Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Комментарий = ТекСтрокаТаблица.Комментарий;
				НоваяСтрока.Количество  = ТекСтрокаТаблица.Количество;
				НоваяСтрока.Отменено 	= ТекСтрокаТаблица.Отменено;
				НоваяСтрока.ПродНак 	= ТекСтрокаТаблица.ПродНак;
				НоваяСтрока.машина 		= ТекСтрокаТаблица.машина;
				НоваяСтрока.Партия 		= ТекСтрокаТаблица.Партия;
				НоваяСтрока.Скидка 		= ТекСтрокаТаблица.Скидка;
				НоваяСтрока.Склад 		= ДанныеЗаполнения.Склад;
				НоваяСтрока.Сумма 		= ТекСтрокаТаблица.Сумма;
				НоваяСтрока.Товар 		= ТекСтрокаТаблица.Товар;
				НоваяСтрока.укод 		= ТекСтрокаТаблица.Товар.Код; 
				НоваяСтрока.Цена		= ТекСтрокаТаблица.Цена;	
				НоваяСтрока.Артикул     = ТекСтрокаТаблица.Товар.Артикул;  
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Состояние = Перечисления.СтатусыАктаВозврата.Разнесено Тогда	
		Движения.РегистрНакопления1.Записывать = Истина;
		
		Для Каждого ТекСтрокаТаблица Из Таблица Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Колво  	 = ТекСтрокаТаблица.Количество;
			Движение.машина 	 = ТекСтрокаТаблица.машина;
			Движение.индкод 	 = ТекСтрокаТаблица.партия;
			Движение.Товар 	  	 = ТекСтрокаТаблица.Товар;
			Движение.Склад  	 = Склад;
			Движение.Период 	 = Дата;					
		КонецЦикла;	
	КонецЕсли
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
		
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	///+ГомзМА 29.07.2024
	Если Дата > '00010101' Тогда //Дата начала действия бонусов
		Сумма = РаботаСДокументамиВызовСервера.ПолучитьСуммуПродажи(Продажа);

		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	БонусыСотрудниковОтПродажи.Сотрудник КАК Сотрудник,
		|	БонусыСотрудниковОтПродажи.Период КАК Период
		|ИЗ
		|	РегистрСведений.БонусыСотрудниковОтПродажи КАК БонусыСотрудниковОтПродажи
		|ГДЕ
		|	БонусыСотрудниковОтПродажи.Продажа = &Продажа";

		Запрос.УстановитьПараметр("Продажа", Продажа);

		РезультатЗапроса = Запрос.Выполнить().Выбрать();

		Пока РезультатЗапроса.Следующий() Цикл
			ЗаписьВРегистреСведений = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
			ЗаписьВРегистреСведений.Период 		= РезультатЗапроса.Период;
			ЗаписьВРегистреСведений.Сотрудник 	= РезультатЗапроса.Сотрудник;
			ЗаписьВРегистреСведений.Прочитать();
			Если ЗаписьВРегистреСведений.Выбран() Тогда
				ЗаписьВРегистреСведений.Сумма = Сумма;
				ЗаписьВРегистреСведений.Бонус = Сумма * 0.03;
			КонецЕсли;
			ЗаписьВРегистреСведений.Записать();
			СписокУчастниковРаботы = РаботаСДокументамиВызовСервера.ПолучитьСписокУчастниковРаботы(Продажа.ЗаказКлиента);

			Для Каждого СтрокаТЧ Из СписокУчастниковРаботы Цикл
				ЗаписьВРегистреСведений = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
				ЗаписьВРегистреСведений.Период 		= РезультатЗапроса.Период;
				ЗаписьВРегистреСведений.Сотрудник 	= СтрокаТЧ.Сотрудник;
				Если ЗаписьВРегистреСведений.Выбран() Тогда
					ЗаписьВРегистреСведений.Сумма 		= Сумма;
					ЗаписьВРегистреСведений.Бонус 		= Сумма * 0.005;
				КонецЕсли;
				ЗаписьВРегистреСведений.Записать();
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	///-ГомзМА 29.07.2024
	
КонецПроцедуры

