
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		
		Дата		   = ТекущаяДата();
		Склад 		   = ДанныеЗаполнения.Склад;
		Клиент 	       = ДанныеЗаполнения.Клиент;
		Продажа 	   = ДанныеЗаполнения.Ссылка;
		Ответственный  = ДанныеЗаполнения.КтоПродал;
		СлужбаДоставки = ДанныеЗаполнения.Доставка;
		Инициатор 	   = Пользователи.ТекущийПользователь();
		Организация    = ДанныеЗаполнения.Организация;
		
		Для Каждого ТекСтрокаТаблица Из ДанныеЗаполнения.Таблица Цикл
			Если ТекСтрокаТаблица.Отменено Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Комментарий = ТекСтрокаТаблица.Комментарий;
				НоваяСтрока.Количество  = ТекСтрокаТаблица.Количество;
				НоваяСтрока.Отменено 	= ТекСтрокаТаблица.Отменено;
				НоваяСтрока.ПродНак 	= ТекСтрокаТаблица.ПродНак;
				НоваяСтрока.машина 		= ТекСтрокаТаблица.машина;
				НоваяСтрока.Партия 		= ТекСтрокаТаблица.Партия;
				НоваяСтрока.Скидка 		= ТекСтрокаТаблица.Скидка;
				НоваяСтрока.Склад 		= ДанныеЗаполнения.Склад;
				НоваяСтрока.Сумма 		= ТекСтрокаТаблица.Сумма;
				НоваяСтрока.Товар 		= ТекСтрокаТаблица.Товар;
				НоваяСтрока.укод 		= ТекСтрокаТаблица.Товар.Код; 
				НоваяСтрока.Цена		= ТекСтрокаТаблица.Цена;	
				НоваяСтрока.Артикул     = ТекСтрокаТаблица.Товар.Артикул;  
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Состояние = Перечисления.СтатусыАктаВозврата.Разнесено Тогда	
		Движения.РегистрНакопления1.Записывать = Истина;
		
		Для Каждого ТекСтрокаТаблица Из Таблица Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Колво  	 = ТекСтрокаТаблица.Количество;
			Движение.машина 	 = ТекСтрокаТаблица.машина;
			Движение.индкод 	 = ТекСтрокаТаблица.партия;
			Движение.Товар 	  	 = ТекСтрокаТаблица.Товар;
			Движение.Склад  	 = Склад;
			Движение.Период 	 = Дата;					
		КонецЦикла;	
	КонецЕсли
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
		
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	///+ГомзМА 29.07.2024
	Если Дата > '20240701' Тогда //Дата начала действия бонусов	
			НаборЗаписей = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументРег.Установить(ссылка);
			НаборЗаписей.Прочитать();
//
			Если НаборЗаписей.Количество() = 0 Тогда
				//@skip-check reading-attribute-from-database
				Менеджер = Продажа.КтоПродал;
				//Сумма = РаботаСДокументамиВызовСервера.ПолучитьСуммуПродажи(Продажа);
				Сумма = ОбщаяСумма;
				ЗаписьВРегистреСведений = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
				ЗаписьВРегистреСведений.Период 		= Дата;
				ЗаписьВРегистреСведений.Сотрудник 	= Менеджер;
				ЗаписьВРегистреСведений.Сумма 		= Сумма;
				ЗаписьВРегистреСведений.ДокументРег = ссылка;
				ЗаписьВРегистреСведений.Продажа 	= Продажа;
				ЗаписьВРегистреСведений.Роль 		= Справочники.ДолжностиДляУК.НайтиПоКоду("000000001"); //Менеджер
				ЗаписьВРегистреСведений.Бонус 		= 0 - (Сумма * 0.03);
				ЗаписьВРегистреСведений.Записать();

				СписокУчастниковРаботы = РаботаСДокументамиВызовСервера.ПолучитьСписокУчастниковРаботы(Продажа.ЗаказКлиента);
				Итер = 1;
				Для Каждого СтрокаТЧ Из СписокУчастниковРаботы Цикл
					ЗаписьВРегистреСведений = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
					ЗаписьВРегистреСведений.Период 		= Дата + Итер;
					ЗаписьВРегистреСведений.Сотрудник 	= СтрокаТЧ.Сотрудник;
					ЗаписьВРегистреСведений.Сумма 		= Сумма;
					ЗаписьВРегистреСведений.ДокументРег = ссылка;
					ЗаписьВРегистреСведений.Продажа 	= Продажа;
					ЗаписьВРегистреСведений.Роль 		= Справочники.ДолжностиДляУК.НайтиПоКоду("000000003"); //Кладовщик
					ЗаписьВРегистреСведений.Бонус 		= 0 - (Сумма * 0.005);
					ЗаписьВРегистреСведений.Записать();
					Итер = Итер +1;
				КонецЦикла;
			КонецЕсли;
		КонецЕсли;
	///-ГомзМА 29.07.2024
	
КонецПроцедуры

