
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		
		Дата		   = ТекущаяДата();
		Склад 		   = ДанныеЗаполнения.Склад;
		Клиент 	       = ДанныеЗаполнения.Клиент;
		Продажа 	   = ДанныеЗаполнения.Ссылка;
		Ответственный  = ДанныеЗаполнения.КтоПродал;
		СлужбаДоставки = ДанныеЗаполнения.Доставка;
		Инициатор 	   = Пользователи.ТекущийПользователь();
		Организация    = ДанныеЗаполнения.Организация;
		
		Для Каждого ТекСтрокаТаблица Из ДанныеЗаполнения.Таблица Цикл
			Если ТекСтрокаТаблица.Отменено Тогда
				НоваяСтрока = Таблица.Добавить();
				НоваяСтрока.Комментарий = ТекСтрокаТаблица.Комментарий;
				НоваяСтрока.Количество  = ТекСтрокаТаблица.Количество;
				НоваяСтрока.Отменено 	= ТекСтрокаТаблица.Отменено;
				НоваяСтрока.ПродНак 	= ТекСтрокаТаблица.ПродНак;
				НоваяСтрока.машина 		= ТекСтрокаТаблица.машина;
				НоваяСтрока.Партия 		= ТекСтрокаТаблица.Партия;
				НоваяСтрока.Скидка 		= ТекСтрокаТаблица.Скидка;
				НоваяСтрока.Склад 		= ДанныеЗаполнения.Склад;
				НоваяСтрока.Сумма 		= ТекСтрокаТаблица.Сумма;
				НоваяСтрока.Товар 		= ТекСтрокаТаблица.Товар;
				НоваяСтрока.укод 		= ТекСтрокаТаблица.Товар.Код; 
				НоваяСтрока.Цена		= ТекСтрокаТаблица.Цена;	
				НоваяСтрока.Артикул     = ТекСтрокаТаблица.Товар.Артикул;  
			КонецЕсли;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	Если Состояние = Перечисления.СтатусыАктаВозврата.Разнесено Тогда	
		Движения.РегистрНакопления1.Записывать = Истина;
		
		Для Каждого ТекСтрокаТаблица Из Таблица Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Колво  	 = ТекСтрокаТаблица.Количество;
			Движение.машина 	 = ТекСтрокаТаблица.машина;
			Движение.индкод 	 = ТекСтрокаТаблица.партия;
			Движение.Товар 	  	 = ТекСтрокаТаблица.Товар;
			Движение.Склад  	 = Склад;
			Движение.Период 	 = Дата;					
		КонецЦикла;	
	КонецЕсли;
	
	///+++МазинЕС 15.08.2024 
	
	Если ЗначениеЗаполнено(Продажа) И ТипЗнч(Продажа) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		Если Дата > '20240701' Тогда //Дата начала действия бонусов	
			НаборЗаписей = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ДокументРег.Установить(Ссылка);
			НаборЗаписей.Прочитать();
			
			Если НаборЗаписей.Количество() <> 0 Тогда 
				НаборЗаписей.Очистить();
				НаборЗаписей.Записать();
			КонецЕсли; 
			
		Стуктура = БонусыКладовщикиСПродажи(Ссылка,Продажа);
		
		Если Стуктура <> Неопределено Тогда 
	
			Если НаборЗаписей.Количество() = 0 Тогда
				Менеджер = Продажа.КтоПродал;
				
				ЗаписьВРегистреСведений 			= РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
				ЗаписьВРегистреСведений.Период 		= Дата;
				ЗаписьВРегистреСведений.Сотрудник 	= Менеджер;
				ЗаписьВРегистреСведений.Сумма 		= ОбщаяСумма;
				ЗаписьВРегистреСведений.ДокументРег = ссылка;
				ЗаписьВРегистреСведений.Продажа 	= Продажа;
				ЗаписьВРегистреСведений.Роль 		= Справочники.ДолжностиДляУК.НайтиПоКоду("000000001"); //Менеджер
				ЗаписьВРегистреСведений.Бонус 		= 0 - (ОбщаяСумма * 0.03);
				ЗаписьВРегистреСведений.Записать();

				СписокУчастниковРаботы = Стуктура.ТаблицаОтветственные;
				Итер = 1;
				
				МестоРаботыННКод			= "000000003";
				МестоРаботыМСККод			= "000000002";
				МестоРаботыЕКБКод			= "000000004";
				
				Для Каждого СтрокаТЧ Из СписокУчастниковРаботы Цикл 
					
					Если СтрокаТЧ.МестоРаботыКод 			= МестоРаботыННКод И Стуктура.ДоляКладовщикаНН <> 0 Тогда 
						ЗаписьВРегистреСведений 			= РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
						ЗаписьВРегистреСведений.Период 		= Дата + Итер;
						ЗаписьВРегистреСведений.Сотрудник 	= СтрокаТЧ.Сотрудник;
						ЗаписьВРегистреСведений.Сумма 		= ОбщаяСумма;
						ЗаписьВРегистреСведений.ДокументРег = ссылка;
						ЗаписьВРегистреСведений.Продажа 	= Продажа;
						ЗаписьВРегистреСведений.Роль 		= Справочники.ДолжностиДляУК.НайтиПоКоду("000000003"); //Кладовщик
						ЗаписьВРегистреСведений.Бонус 		=  0 - (ОбщаяСумма *  Стуктура.ДоляКладовщикаНН * 0.005);
						ЗаписьВРегистреСведений.Записать();
						Итер = Итер +1;
					КонецЕсли;
					Если СтрокаТЧ.МестоРаботыКод 			= МестоРаботыМСККод И Стуктура.ДоляКладовщикаМСК <> 0 Тогда
						ЗаписьВРегистреСведений 			= РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
						ЗаписьВРегистреСведений.Период 		= Дата + Итер;
						ЗаписьВРегистреСведений.Сотрудник 	= СтрокаТЧ.Сотрудник;
						ЗаписьВРегистреСведений.Сумма 		= ОбщаяСумма;
						ЗаписьВРегистреСведений.ДокументРег = ссылка;
						ЗаписьВРегистреСведений.Продажа 	= Продажа;
						ЗаписьВРегистреСведений.Роль 		= Справочники.ДолжностиДляУК.НайтиПоКоду("000000003"); //Кладовщик
						ЗаписьВРегистреСведений.Бонус 		=  0 - (ОбщаяСумма * Стуктура.ДоляКладовщикаМСК * 0.005); 
						ЗаписьВРегистреСведений.Записать();
						Итер = Итер +1;	
					КонецЕсли;
					
					Если СтрокаТЧ.МестоРаботыКод 			= МестоРаботыЕКБКод И Стуктура.ДоляКладовщикаЕКБ <> 0 Тогда
						ЗаписьВРегистреСведений 			= РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
						ЗаписьВРегистреСведений.Период 		= Дата + Итер;
						ЗаписьВРегистреСведений.Сотрудник 	= СтрокаТЧ.Сотрудник;
						ЗаписьВРегистреСведений.Сумма 		= ОбщаяСумма;
						ЗаписьВРегистреСведений.ДокументРег = ссылка;
						ЗаписьВРегистреСведений.Продажа 	= Продажа;
						ЗаписьВРегистреСведений.Роль 		= Справочники.ДолжностиДляУК.НайтиПоКоду("000000003"); //Кладовщик
						ЗаписьВРегистреСведений.Бонус 		=  0 - (ОбщаяСумма * Стуктура.ДоляКладовщикаЕКБ * 0.005);
						ЗаписьВРегистреСведений.Записать();
						Итер = Итер +1;	
					КонецЕсли;
					
				КонецЦикла; 
			КонецЕсли;
		КонецЕсли;
		КонецЕсли;
КонецЕсли;		
	///---МазинЕС 15.08.2024
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
		
	
	
КонецПроцедуры
Функция БонусыКладовщикиСПродажи(Ссылка,Продажа)
//+++ МазинЕС 14.08.2024	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АктВозвратаТаблица.Партия КАК Партия,
		|	АктВозвратаТаблица.Товар КАК Товар,
		|	АктВозвратаТаблица.Сумма КАК Сумма,
		|	АктВозвратаТаблица.Склад.Код КАК СкладКод,
		|	АктВозвратаТаблица.Ссылка.ОбщаяСумма КАК СуммаДокумент
		|ИЗ
		|	Документ.АктВозврата.Таблица КАК АктВозвратаТаблица
		|ГДЕ
		|	АктВозвратаТаблица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	ТаблицаТовары = Запрос.Выполнить().Выгрузить();
	
	Запрос2 = Новый Запрос;
	Запрос2.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.МестоРаботы.Код КАК МестоРаботыКод,
		|	Сотрудники.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ВТ_Сотрудник
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажаЗапчастейОтветственные.Сотрудник КАК Сотрудник,
		|	ПродажаЗапчастейОтветственные.Роль КАК Роль,
		|	ВТ_Сотрудник.МестоРаботыКод КАК МестоРаботыКод
		|ИЗ
		|	Документ.ПродажаЗапчастей.Ответственные КАК ПродажаЗапчастейОтветственные
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Сотрудник КАК ВТ_Сотрудник
		|		ПО (ПродажаЗапчастейОтветственные.Сотрудник = ВТ_Сотрудник.Пользователь.Ссылка)
		|ГДЕ
		|	ПродажаЗапчастейОтветственные.Ссылка = &Ссылка
		|	И ПродажаЗапчастейОтветственные.Роль = ЗНАЧЕНИЕ(Перечисление.дт_РолиВПродаже.Кладовщик)";
	
	
	Запрос2.УстановитьПараметр("Ссылка", Продажа);
	ТаблицаОтветственные = Запрос2.Выполнить().Выгрузить();
	
	МестоРаботыННКод			= "000000003"; 
	СкладНН 					= "000000002";
	СуммаСтрокиТовараНН			= 0;
	КоличествоКладовщиковНН 	= 0;
				
	МестоРаботыМСККод			= "000000002";
	СкладМСК					= "000000005";
	СуммаСтрокиТовараМСК		= 0;
	КоличествоКладовщиковМСК 	= 0;
	
	МестоРаботыЕКБКод			= "000000004";
	СкладЕКБ					= "000000008";
	СуммаСтрокиТовараЕКБ		= 0;
	КоличествоКладовщиковЕКБ 	= 0;
	
Если ТаблицаТовары.Количество() <> 0 Тогда 
	Если ТаблицаОтветственные.Количество() <> 0 Тогда 
	
	Для Каждого Строка ИЗ ТаблицаОтветственные Цикл 
		Если  Строка.МестоРаботыКод = МестоРаботыННКод Тогда  		
			КоличествоКладовщиковНН = КоличествоКладовщиковНН +1; 		
		КонецЕсли;
		Если  Строка.МестоРаботыКод = МестоРаботыМСККод Тогда  		
			КоличествоКладовщиковМСК = КоличествоКладовщиковМСК +1; 		
		КонецЕсли;
		Если  Строка.МестоРаботыКод = МестоРаботыЕКБКод Тогда  		
			КоличествоКладовщиковЕКБ = КоличествоКладовщиковЕКБ +1; 		
		КонецЕсли;
	КонецЦикла; 
	
	
	Для Каждого СтрокаТовары ИЗ ТаблицаТовары Цикл 
		Если  СтрокаТовары.СкладКод = СкладНН  Тогда  		
			СуммаСтрокиТовараНН = СуммаСтрокиТовараНН + СтрокаТовары.Сумма; 		
		КонецЕсли;
		Если  СтрокаТовары.СкладКод = СкладМСК Тогда  		
			СуммаСтрокиТовараМСК = СуммаСтрокиТовараМСК + СтрокаТовары.Сумма;		
		КонецЕсли;
		Если  СтрокаТовары.СкладКод = СкладЕКБ Тогда  		
			СуммаСтрокиТовараЕКБ = СуммаСтрокиТовараЕКБ + СтрокаТовары.Сумма		
		КонецЕсли;
		СуммаДокумент = СтрокаТовары.СуммаДокумент; 
	КонецЦикла;  
	
	Структура  = Новый Структура; 
	
	Если СуммаСтрокиТовараНН <> 0  И КоличествоКладовщиковНН <> 0 Тогда 
		Структура.Вставить("ДоляКладовщикаНН",	СуммаСтрокиТовараНН 	/ СуммаДокумент / КоличествоКладовщиковНН);
	Иначе 
		Структура.Вставить("ДоляКладовщикаНН",	0);
	КонецЕсли; 
	
	Если СуммаСтрокиТовараМСК <> 0 И КоличествоКладовщиковМСК <> 0 Тогда 
		Структура.Вставить("ДоляКладовщикаМСК",	СуммаСтрокиТовараМСК 	/ СуммаДокумент / КоличествоКладовщиковМСК);
	Иначе 
		Структура.Вставить("ДоляКладовщикаМСК",	0);	
	КонецЕсли; 
	
	Если СуммаСтрокиТовараЕКБ <> 0  И КоличествоКладовщиковЕКБ <> 0 Тогда 
		Структура.Вставить("ДоляКладовщикаЕКБ",	СуммаСтрокиТовараЕКБ 	/ СуммаДокумент / КоличествоКладовщиковЕКБ);
	Иначе 
		Структура.Вставить("ДоляКладовщикаЕКБ",	0);
	КонецЕсли; 
	
	Если ТаблицаОтветственные.Количество() <> 0 Тогда 
		Структура.Вставить("ТаблицаОтветственные",ТаблицаОтветственные);
	Иначе 
		Структура.Вставить("ТаблицаОтветственные",	ТаблицаОтветственные = Новый ТаблицаЗначений);	 
	КонецЕсли; 
	
	Если Структура.Количество() <> 0 Тогда 
		Возврат Структура;
	КонецЕсли; 

КонецЕсли; 	
КонецЕсли; 
//--- МазинЕС 14.08.2024
КонецФункции 


Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	

	///+ГомзМА 29.07.2024
//	Если Дата > '20240701' Тогда //Дата начала действия бонусов	
//			НаборЗаписей = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьНаборЗаписей();
//			НаборЗаписей.Отбор.ДокументРег.Установить(ссылка);
//			НаборЗаписей.Прочитать();
////
//			Если НаборЗаписей.Количество() = 0 Тогда
//				//@skip-check reading-attribute-from-database
//				Менеджер = Продажа.КтоПродал;
//				//Сумма = РаботаСДокументамиВызовСервера.ПолучитьСуммуПродажи(Продажа);
//				Сумма = ОбщаяСумма;
//				ЗаписьВРегистреСведений = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
//				ЗаписьВРегистреСведений.Период 		= ТекущаяДата();
//				ЗаписьВРегистреСведений.Сотрудник 	= Менеджер;
//				ЗаписьВРегистреСведений.Сумма 		= Сумма;
//				ЗаписьВРегистреСведений.ДокументРег = ссылка;
//				ЗаписьВРегистреСведений.Продажа 	= Продажа;
//				ЗаписьВРегистреСведений.Роль 		= Справочники.ДолжностиДляУК.НайтиПоКоду("000000001"); //Менеджер
//				ЗаписьВРегистреСведений.Бонус 		= 0 - (Сумма * 0.03);
//				ЗаписьВРегистреСведений.Записать();
//
//				СписокУчастниковРаботы = РаботаСДокументамиВызовСервера.ПолучитьСписокУчастниковРаботы(Продажа.ЗаказКлиента);
//				Итер = 1;
//				Для Каждого СтрокаТЧ Из СписокУчастниковРаботы Цикл
//					ЗаписьВРегистреСведений = РегистрыСведений.БонусыСотрудниковОтПродажи.СоздатьМенеджерЗаписи();
//					ЗаписьВРегистреСведений.Период 		= ТекущаяДата() + Итер;
//					ЗаписьВРегистреСведений.Сотрудник 	= СтрокаТЧ.Сотрудник;
//					ЗаписьВРегистреСведений.Сумма 		= Сумма;
//					ЗаписьВРегистреСведений.ДокументРег = ссылка;
//					ЗаписьВРегистреСведений.Продажа 	= Продажа;
//					ЗаписьВРегистреСведений.Роль 		= Справочники.ДолжностиДляУК.НайтиПоКоду("000000003"); //Кладовщик
//					ЗаписьВРегистреСведений.Бонус 		= 0 - (Сумма * 0.005);
//					ЗаписьВРегистреСведений.Записать();
//					Итер = Итер +1;
//				КонецЦикла;
//			КонецЕсли;
//		КонецЕсли;
//	///-ГомзМА 29.07.2024
	
КонецПроцедуры

