Функция СписокТоваровАкция10() ЭКСПОРТ
	//==================================================================================================================
	ТЗ_Товары = Новый ТаблицаЗначений(); 
	ТЗ_Фото	  = Новый ТаблицаЗначений(); 
	ТЗ_КодНоменкл = Новый Массив(); 
	МассивТоваров = Новый Массив();
	
	//==================================================================================================================
	ТЗ_Товары 	= СписокТоваров();
	Если НЕ ТЗ_Товары.Количество() > 0 ТОгда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,404);
		Возврат СтруктураТоваров; 
	КонецЕсли; 

	ТЗ_КодНоменкл = ТЗ_Товары.ВыгрузитьКолонку("Код");
	ТЗ_Фото = РаботаССайтомWT.ПолучениеФотокарточек(ТЗ_КодНоменкл);
	
	//==================================================================================================================
	Для Каждого стр Из ТЗ_Товары Цикл
		
		Для Каждого Строка Из ТЗ_Фото Цикл
			Если Строка.id = стр.Код Тогда
				Структура = Новый Структура;
				Если Строка.images.main <> "" Тогда
					СтруктураТоваров = Новый Структура;
					СтруктураТоваров.Вставить("cardId"		,стр.Код );
					СтруктураТоваров.Вставить("photo"		,Строка.images.main);
					СтруктураТоваров.Вставить("name"		,стр.Товар);
					СтруктураТоваров.Вставить("article"		,стр.Артикул);
					СтруктураТоваров.Вставить("count"		,стр.КолвоОстаток);
					СтруктураТоваров.Вставить("price"		,стр.ЦенаРекОстаток / стр.КолвоОстаток);
					СтруктураТоваров.Вставить("salePrice"	,стр.ЦенаОстаток / стр.КолвоОстаток);
					МассивТоваров.Добавить(СтруктураТоваров);
					Прервать;
				Иначе
					Если Строка.images.common.Количество() > 0 Тогда
						СтруктураТоваров = Новый Структура;
						СтруктураТоваров.Вставить("cardId"		,стр.Код );
						СтруктураТоваров.Вставить("photo"		,Строка.images.common[0]);
						СтруктураТоваров.Вставить("name"		,стр.Товар);
						СтруктураТоваров.Вставить("article"		,стр.Артикул);
						СтруктураТоваров.Вставить("count"		,стр.КолвоОстаток);
						СтруктураТоваров.Вставить("price"		,стр.ЦенаРекОстаток / стр.КолвоОстаток);
						СтруктураТоваров.Вставить("salePrice"	,стр.ЦенаОстаток / стр.КолвоОстаток);
						МассивТоваров.Добавить(СтруктураТоваров);
						Прервать;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
		
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивТоваров) Тогда 
		Возврат МассивТоваров; 
	Иначе 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,404);
		Возврат СтруктураТоваров; 
	КонецЕсли; 
	
	//==================================================================================================================
КонецФункции

Функция СписокТоваров() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
		|	РегистрАкция10Остатки.Товар.Код КАК Код,
		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 

		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
		Возврат ТЗ_Товары; 
		
	КонецЕсли; 
КонецФункции	

Функция ПолучитьТоварыКарточкиАкция10(КодТовара) ЭКСПОРТ
	//==================================================================================================================
	ТЗ_Товары 		 = Новый ТаблицаЗначений(); 
	ТЗ_Фото	  		 = Новый ТаблицаЗначений(); 
	ТЗ_Фото_Карточек = Новый ТаблицаЗначений(); 
	ТЗ_ИндКод		 = Новый Массив(); 
	МассивТоваров 	 = Новый Массив();
	Массив			 = Новый Массив();
	
	//==================================================================================================================
	ТЗ_Товары 	= СписокТоваровКарточки(КодТовара);
	
	Если НЕ ТЗ_Товары.Количество() > 0 ТОгда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,404);
		Возврат СтруктураТоваров; 
	КонецЕсли; 
	
	ТЗ_ИндКод 		= ТЗ_Товары.ВыгрузитьКолонку("индкод");
	ТЗ_Фото 		= РаботаССайтомWT.ПолучениеФотоБезИндНомер(ТЗ_ИндКод);
	Массив.Добавить(КодТовара);
	ТЗ_Фото_Карточки = РаботаССайтомWT.ПолучениеФотокарточек(Массив);
	
	//==================================================================================================================
	Для Каждого стр Из ТЗ_Товары Цикл
		
		Для Каждого Строка Из ТЗ_Фото Цикл
			Если Строка.indCode = стр.индкод Тогда
				Если Строка.urls.Количество() > 0 Тогда
					МассивФото = Новый Массив();
					Счетчик = 0; 
					Флаг = Ложь;
					Для Каждого СтрокаУрл ИЗ Строка.urls Цикл
						МассивФото.Добавить(СтрокаУрл);
						Счетчик = Счетчик + 1 ;
						Флаг = Истина; 
						Если Счетчик = 2 Тогда 
							Прервать;
						КонецЕсли; 
					КонецЦикла; 
					
					Если Флаг = Истина Тогда 
						СтруктураТоваров = Новый Структура;
						СтруктураТоваров.Вставить("name"	,стр.Товар);
						СтруктураТоваров.Вставить("article"	,стр.Артикул);
						СтруктураТоваров.Вставить("photo"	,МассивФото);
						СтруктураТоваров.Вставить("tovId"	,стр.индкод);
						СтруктураТоваров.Вставить("price"	,стр.ЦенаОстаток);
						МассивТоваров.Добавить(СтруктураТоваров);
						Прервать;
						
					КонецЕсли; 
				Иначе 
					Для Каждого Строка1 Из ТЗ_Фото_Карточки Цикл
						Если Строка1.images.main <> "" Тогда
							МассивФото = Новый Массив();
							МассивФото.Добавить(Строка1.images.main);
							СтруктураТоваров = Новый Структура;
							СтруктураТоваров.Вставить("name"	,стр.Товар);
							СтруктураТоваров.Вставить("article"	,стр.Артикул);
							СтруктураТоваров.Вставить("photo"	,МассивФото);
							СтруктураТоваров.Вставить("tovId"	,стр.индкод);
							СтруктураТоваров.Вставить("price"	,стр.ЦенаОстаток);
							МассивТоваров.Добавить(СтруктураТоваров);
							Прервать;
						Иначе
							Если Строка1.images.common.Количество() > 0 Тогда
								СтруктураТоваров = Новый Структура;
								МассивФото = Новый Массив();
								МассивФото.Вставить(Строка1.images.common[0]);
								СтруктураТоваров.Вставить("name"	,стр.Товар);
								СтруктураТоваров.Вставить("article"	,стр.Артикул);
								СтруктураТоваров.Вставить("photo"	,МассивФото);
								СтруктураТоваров.Вставить("tovId"	,стр.индкод);
								СтруктураТоваров.Вставить("price"	,стр.ЦенаОстаток);
								МассивТоваров.Добавить(СтруктураТоваров);
								Прервать;	
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				//=======================================================================================================	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивТоваров) Тогда 
		Возврат МассивТоваров; 
	Иначе 
		
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,404);
		Возврат СтруктураТоваров; 
		
	КонецЕсли; 
	
	//==================================================================================================================
КонецФункции

Функция СписокТоваровКарточки(КодТовара) 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
		|	РегистрАкция10Остатки.индкод.Наименование КАК индкод,
		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
		|	РегистрАкция10Остатки.Товар.Код КАК Код,
		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|	И РегистрАкция10Остатки.Товар.Код = &КодТовара";
	
	Запрос.УстановитьПараметр("КодТовара",КодТовара );
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 

		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
		Возврат ТЗ_Товары; 
		
	КонецЕсли; 
КонецФункции

Функция ЗабронироватьТовар(АйдиТовара,НомерТелефона) ЭКСПОРТ
	
	//==================================================================================================================
	НомерТелефона = "+7" + " " + Сред(НомерТелефона, 3, 1) + Сред(НомерТелефона, 4, 1) + Сред(НомерТелефона, 5, 1) 
	+ " " + Сред(НомерТелефона, 6, 1) + Сред(НомерТелефона, 7, 1) + Сред(НомерТелефона, 8, 1) + "-" 
	+ Сред(НомерТелефона, 9, 1) + Сред(НомерТелефона, 10, 1) 
	+ "-" + Сред(НомерТелефона, 11, 1) + Сред(НомерТелефона, 12, 1);

	//==================================================================================================================
	СсылкаЗаявка  	= Справочники.УчастникиАкции10.ПустаяСсылка(); 
	ТЗ_Товар		= Новый ТаблицаЗначений();
	МассивТоваров	= Новый Массив(); 
	СтрокаЗаявка	= "";
	СтрокаМенеджер	= "";
	НомерПродажи	= "";
	//===================================================================================================================

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаказКлиента.Ссылка КАК Ссылка
		|	
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.УчаствуетВАкции10 = ИСТИНА
//		|	И ЗаказКлиента.Ссылка.Клиент ССЫЛКА Справочник.УчастникиАкции10
		|	И ЗаказКлиента.НомерТелефона = &НомерТелефона
		|	И ЗаказКлиента.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка УБЫВ";
	
	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		СсылкаЗаявка = Выборка.Ссылка; 
	Иначе 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("status",405); 
		Возврат СтруктураТоваров; 
	КонецЕсли; 

	Запрос1 = Новый Запрос;
	Запрос1.Текст =
		"ВЫБРАТЬ
		|	ПродажаЗапчастей.Номер
		|ИЗ
		|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
		|ГДЕ
		|	ПродажаЗапчастей.ЗаказКлиента = &ЗаказКлиента";
	
	Запрос1.УстановитьПараметр("ЗаказКлиента", СсылкаЗаявка);
	
	РезультатЗапроса = Запрос1.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
			
//			СтруктураТоваров = Новый Структура;
//			СтруктураТоваров.Вставить("status",406); //405 - товар не удалось заблокировать
//			Возврат СтруктураТоваров; 
	КонецЕсли;
	
	//===================================================================================================================
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ 
		|	РегистрАкция10Остатки.Товар КАК Номенклатура, 
		|	РегистрАкция10Остатки.индкод КАК Партия,
		|	РегистрАкция10Остатки.Склад КАК Склад,
		|	РегистрАкция10Остатки.машина КАК машина,
		|	РегистрАкция10Остатки.КолвоОстаток КАК Количество,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК Цена
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|	И РегистрАкция10Остатки.индкод.Наименование = &Наименование";
	
	Запрос.УстановитьПараметр("Наименование",АйдиТовара);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		Выбока = РезультатЗапроса.Выбрать(); 
		Выбока.Следующий(); 
		ОбъектЗаявка 	= СсылкаЗаявка.ПолучитьОбъект(); 
		НоваяСтрока 	= ОбъектЗаявка.Товары.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока,Выбока); 
		СтрокаЗаявка	= Строка(ОбъектЗаявка.Номер);
		СтрокаМенеджер	= Строка(ОбъектЗаявка.Ответственный);
		
		
		ОбъектЗаявка.Записать(РежимЗаписиДокумента.Проведение); 
	Иначе 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error",404);
		Возврат СтруктураТоваров; 
	КонецЕсли; 
	
	//==================================================================================================================

	СтруктураТоваров = Новый Структура;
	СтруктураТоваров.Вставить("status",200);
	СтруктураТоваров.Вставить("application",СтрокаЗаявка);
	СтруктураТоваров.Вставить("manager",СтрокаМенеджер);
	
	
	Возврат СтруктураТоваров; 
КонецФункции















