Функция СписокТоваровАкция10() ЭКСПОРТ
	//==================================================================================================================
	ТЗ_Товары = Новый ТаблицаЗначений(); 
	ТЗ_Фото	  = Новый ТаблицаЗначений(); 
	ТЗ_КодНоменкл = Новый Массив(); 
	МассивТоваров = Новый Массив();
	
	//==================================================================================================================
	ТЗ_Товары 	= СписокТоваров();
	Если НЕ ТЗ_Товары.Количество() > 0 ТОгда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,404);
		Возврат СтруктураТоваров; 
	КонецЕсли; 

	ТЗ_КодНоменкл = ТЗ_Товары.ВыгрузитьКолонку("Код");
	ТЗ_Фото = РаботаССайтомWT.ПолучениеФотокарточек(ТЗ_КодНоменкл);
	
	//==================================================================================================================
	Для Каждого стр Из ТЗ_Товары Цикл
		Для Каждого Строка Из ТЗ_Фото Цикл
			Если Строка.id = стр.Код Тогда
				Структура = Новый Структура;
				Если Строка.images.main <> "" Тогда
					СтруктураТоваров = Новый Структура;
					СтруктураТоваров.Вставить("cardId"		,стр.Код );
					СтруктураТоваров.Вставить("photo"		,Строка.images.main);
					СтруктураТоваров.Вставить("name"		,стр.Товар);
					СтруктураТоваров.Вставить("article"		,стр.Артикул);
					СтруктураТоваров.Вставить("count"		,стр.КолвоОстаток);
					СтруктураТоваров.Вставить("price"		,стр.ЦенаРекОстаток);
					СтруктураТоваров.Вставить("salePrice"	,стр.ЦенаОстаток);
					СтруктураТоваров.Вставить("all"			,стр.КолвоОстаток + стр.ПроданноКоличество);
					МассивТоваров.Добавить(СтруктураТоваров);
					Прервать;
				Иначе
					Если Строка.images.common.Количество() > 0 Тогда
						СтруктураТоваров = Новый Структура;
						СтруктураТоваров.Вставить("cardId"		,стр.Код );
						СтруктураТоваров.Вставить("photo"		,Строка.images.common[0]);
						СтруктураТоваров.Вставить("name"		,стр.Товар);
						СтруктураТоваров.Вставить("article"		,стр.Артикул);
						СтруктураТоваров.Вставить("count"		,стр.КолвоОстаток);
						СтруктураТоваров.Вставить("price"		,стр.ЦенаРекОстаток);
						СтруктураТоваров.Вставить("salePrice"	,стр.ЦенаОстаток);
						СтруктураТоваров.Вставить("all"			,стр.КолвоОстаток + стр.ПроданноКоличество);
						МассивТоваров.Добавить(СтруктураТоваров);
						Прервать;	
					КонецЕсли;
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если МассивТоваров.Количество() > 0 Тогда 
		Возврат МассивТоваров; 
	Иначе 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,404);
		Возврат СтруктураТоваров; 
	КонецЕсли; 
	
	//===================================================================================================================
КонецФункции

Функция СписокТоваров() 
	
	ТЗ_ПроданныеТовары  = Новый ТаблицаЗначений();
	ТЗ_Товары			= Новый ТаблицаЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
		|	РегистрАкция10Остатки.Товар.Код КАК Код,
		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток,
		|	РегистрАкция10Остатки.индкод КАК индкод
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Товар КАК Товар,
		|	ВТ_1.Код КАК Код,
		|	ВТ_1.Артикул КАК Артикул,
		|	МИНИМУМ(ВТ_1.ЦенаРекОстаток) КАК ЦенаРекОстаток,
		|	СУММА(ВТ_1.КолвоОстаток) КАК КолвоОстаток, 
		|	МИНИМУМ(ВТ_1.ЦенаОстаток) КАК ЦенаОстаток,
		|	0 КАК ПроданноКоличество
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|СГРУППИРОВАТЬ ПО
		|	ВТ_1.Товар,
		|	ВТ_1.Код,
		|	ВТ_1.Артикул
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаОстаток УБЫВ";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
	КонецЕсли; 
	
	//==================================================================================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10ОстаткиИОбороты.индкод КАК индкод,
		|	РегистрАкция10ОстаткиИОбороты.КолвоРасход КАК КолвоРасход,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Артикул КАК Артикул,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Наименование КАК Товар,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Код КАК ТоварКод,
		|	РегистрАкция10ОстаткиИОбороты.ЦенаРасход КАК ЦенаРасход,
		|	РегистрАкция10ОстаткиИОбороты.ЦенаРекРасход КАК ЦенаРекРасход
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.ОстаткиИОбороты(&Дата1, &Дата2, День,,) КАК РегистрАкция10ОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаходАкция10Товары.Партия КАК Партия,
		|	ЗаходАкция10Товары.ЦенаАкция КАК ЦенаАкция,
		|	ЗаходАкция10Товары.ЦенаРек КАК ЦенаРек
		|ПОМЕСТИТЬ ВТ_2
		|ИЗ
		|	Документ.ЗаходАкция10.Товары КАК ЗаходАкция10Товары
		|ГДЕ
		|	ЗаходАкция10Товары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ЗаходАкция10Товары.Ссылка.ДатаАкции = &ДатаАкции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Товар КАК Товар,
		|	ВТ_1.ТоварКод КАК Код,
		|	ВТ_1.Артикул КАК Артикул,
		|	ЕСТЬNULL(МИНИМУМ(ВТ_2.ЦенаРек),0) КАК ЦенаРекОстаток,
		|	0 КАК КолвоОстаток,
		|	ЕСТЬNULL(МИНИМУМ(ВТ_2.ЦенаАкция),0) КАК ЦенаОстаток,
		|	ЕСТЬNULL(СУММА(ВТ_1.КолвоРасход),0) КАК ПроданноКоличество
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_2 КАК ВТ_2
		|		ПО (ВТ_1.индкод = ВТ_2.Партия)
		|СГРУППИРОВАТЬ ПО
		|	ВТ_1.Товар,
		|	ВТ_1.ТоварКод,
		|	ВТ_1.Артикул
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня			(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Дата2", КонецДня				(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаАкции", НачалоДня		(ТекущаяДатаСеанса()));
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_ПроданныеТовары = РезультатЗапроса.Выгрузить(); 
		
			Для каждого Строка ИЗ ТЗ_ПроданныеТовары Цикл 
		
			НайденнаяСтрока = ТЗ_Товары.Найти(Строка(Строка.Товар) ,"Товар");	
			Если НайденнаяСтрока <> Неопределено Тогда
	        	
	        	НайденнаяСтрока.ПроданноКоличество = Строка.ПроданноКоличество; 
	        	
			Иначе 
				НовыяСтрока = ТЗ_Товары.Добавить(); 
				ЗаполнитьЗначенияСвойств(НовыяСтрока,Строка);
	    	КонецЕсли;	
			
			КонецЦикла; 
	КонецЕсли; 
	
	Возврат ТЗ_Товары; 
	//==================================================================================================================
	
КонецФункции	

Функция ПолучитьТоварыКарточкиАкция10(КодТовара) ЭКСПОРТ
	//==================================================================================================================
	ТЗ_Товары 		 = Новый ТаблицаЗначений(); 
	ТЗ_Фото	  		 = Новый ТаблицаЗначений(); 
	ТЗ_Фото_Карточек = Новый ТаблицаЗначений(); 
	ТЗ_ИндКод		 = Новый Массив(); 
	МассивТоваров 	 = Новый Массив();
	Массив			 = Новый Массив();
	
	//===================================================================================================================
	ТЗ_Товары 	= СписокТоваровКарточки(КодТовара);
	Если  НЕ ЗначениеЗаполнено(ТЗ_Товары) ТОгда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,404);
		Возврат СтруктураТоваров; 
	КонецЕсли; 
	
	ТЗ_ИндКод 		= ТЗ_Товары.ВыгрузитьКолонку("индкод");
	ТЗ_Фото 		= РаботаССайтомWT.ПолучениеФотоБезИндНомер(ТЗ_ИндКод);
	Массив.Добавить(КодТовара);
	ТЗ_Фото_Карточки = РаботаССайтомWT.ПолучениеФотокарточек(Массив);
	
	//===================================================================================================================
	Для Каждого стр Из ТЗ_Товары Цикл
		
		Для Каждого Строка Из ТЗ_Фото Цикл
			Если Строка.indCode = стр.индкод Тогда
				Если Строка.urls.Количество() > 0 Тогда
					МассивФото = Новый Массив();
					Счетчик = 0; 
					Флаг = Ложь;
					Для Каждого СтрокаУрл ИЗ Строка.urls Цикл
						МассивФото.Добавить(СтрокаУрл);
						Счетчик = Счетчик + 1 ;
						Флаг = Истина; 
						Если Счетчик = 2 Тогда 
							Прервать;
						КонецЕсли; 
					КонецЦикла; 
					
					Если Флаг = Истина Тогда 
						СтруктураТоваров = Новый Структура;
						СтруктураТоваров.Вставить("name"	,стр.Товар);
						СтруктураТоваров.Вставить("article"	,стр.Артикул);
						СтруктураТоваров.Вставить("photo"	,МассивФото);
						СтруктураТоваров.Вставить("tovId"	,стр.индкод);
						СтруктураТоваров.Вставить("price"	,стр.ЦенаОстаток);
						СтруктураТоваров.Вставить("sold"	,стр.ПроданноКоличество);
						МассивТоваров.Добавить(СтруктураТоваров);
						Прервать;
						
					КонецЕсли; 
				Иначе 
					Для Каждого Строка1 Из ТЗ_Фото_Карточки Цикл
						Если Строка1.images.main <> "" Тогда
							МассивФото = Новый Массив();
							МассивФото.Добавить(Строка1.images.main);
							СтруктураТоваров = Новый Структура;
							СтруктураТоваров.Вставить("name"	,стр.Товар);
							СтруктураТоваров.Вставить("article"	,стр.Артикул);
							СтруктураТоваров.Вставить("photo"	,МассивФото);
							СтруктураТоваров.Вставить("tovId"	,стр.индкод);
							СтруктураТоваров.Вставить("price"	,стр.ЦенаОстаток);
							СтруктураТоваров.Вставить("sold"	,стр.ПроданноКоличество);
							МассивТоваров.Добавить(СтруктураТоваров);
							Прервать;
						Иначе
							Если Строка1.images.common.Количество() > 0 Тогда
								СтруктураТоваров = Новый Структура;
								МассивФото = Новый Массив();
								МассивФото.Вставить(Строка1.images.common[0]);
								СтруктураТоваров.Вставить("name"	,стр.Товар);
								СтруктураТоваров.Вставить("article"	,стр.Артикул);
								СтруктураТоваров.Вставить("photo"	,МассивФото);
								СтруктураТоваров.Вставить("tovId"	,стр.индкод);
								СтруктураТоваров.Вставить("price"	,стр.ЦенаОстаток);
								СтруктураТоваров.Вставить("sold"	,стр.ПроданноКоличество);
								МассивТоваров.Добавить(СтруктураТоваров);
								Прервать;	
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				//=======================================================================================================	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивТоваров) Тогда 
		Возврат МассивТоваров; 
	Иначе 
		
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,404);
		Возврат СтруктураТоваров; 
		
	КонецЕсли; 
	
	//==================================================================================================================
КонецФункции

Функция СписокТоваровКарточки(КодТовара) 
	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
//		|	РегистрАкция10Остатки.индкод.Наименование КАК индкод,
//		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
//		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
//		|	РегистрАкция10Остатки.Товар.Код КАК Код,
//		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
//		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток
//		|ИЗ
//		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
//		|ГДЕ
//		|	РегистрАкция10Остатки.КолвоОстаток > 0
//		|	И РегистрАкция10Остатки.Товар.Код = &КодТовара";
//	
//	Запрос.УстановитьПараметр("КодТовара",КодТовара );
//	РезультатЗапроса = Запрос.Выполнить();
//	Если НЕ РезультатЗапроса.Пустой() Тогда 
//		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
////		Возврат ТЗ_Товары; 
//	КонецЕсли; 
	
//======================================================================================================================
// НЬЮ==================================================================================================================

	ТЗ_ПроданныеТовары  = Новый ТаблицаЗначений();
	ТЗ_Товары			= Новый ТаблицаЗначений();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
		|	РегистрАкция10Остатки.Товар.Код КАК Код,
		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток,
		|	РегистрАкция10Остатки.индкод.Наименование КАК индкод
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки(, Товар.Код = &КодТовара) КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Товар КАК Товар,
		|	ВТ_1.Код КАК Код,
		|	ВТ_1.Артикул КАК Артикул,
		|	МИНИМУМ(ВТ_1.ЦенаРекОстаток) КАК ЦенаРекОстаток,
		|	СУММА(ВТ_1.КолвоОстаток) КАК КолвоОстаток,
		|	МИНИМУМ(ВТ_1.ЦенаОстаток) КАК ЦенаОстаток,
		|	0 КАК ПроданноКоличество,
		|	ВТ_1.индкод КАК индкод
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|СГРУППИРОВАТЬ ПО
		|	ВТ_1.Товар,
		|	ВТ_1.Код,
		|	ВТ_1.Артикул,
		|	ВТ_1.индкод
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("КодТовара",КодТовара);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
	КонецЕсли; 
	
	//==================================================================================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10ОстаткиИОбороты.индкод.Наименование КАК индкод,
		|	РегистрАкция10ОстаткиИОбороты.КолвоРасход КАК КолвоРасход,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Артикул КАК Артикул,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Наименование КАК Товар,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Код КАК ТоварКод,
		|	РегистрАкция10ОстаткиИОбороты.ЦенаРасход КАК ЦенаРасход,
		|	РегистрАкция10ОстаткиИОбороты.ЦенаРекРасход КАК ЦенаРекРасход
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.ОстаткиИОбороты(&Дата1, &Дата2, День,, Товар.Код = &КодТовара) КАК
		|		РегистрАкция10ОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаходАкция10Товары.Партия КАК Партия,
		|	ЗаходАкция10Товары.ЦенаАкция КАК ЦенаАкция,
		|	ЗаходАкция10Товары.ЦенаРек КАК ЦенаРек
		|ПОМЕСТИТЬ ВТ_2
		|ИЗ
		|	Документ.ЗаходАкция10.Товары КАК ЗаходАкция10Товары
		|ГДЕ
		|	ЗаходАкция10Товары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ЗаходАкция10Товары.Ссылка.ДатаАкции = &ДатаАкции
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Товар КАК Товар,
		|	ВТ_1.ТоварКод КАК Код,
		|	ВТ_1.Артикул КАК Артикул,
		|   ВТ_1.индкод КАК индкод,
		|	ЕСТЬNULL(МИНИМУМ(ВТ_2.ЦенаРек), 0) КАК ЦенаРекОстаток,
		|	0 КАК КолвоОстаток,
		|	ЕСТЬNULL(МИНИМУМ(ВТ_2.ЦенаАкция), 0) КАК ЦенаОстаток,
		|	ЕСТЬNULL(СУММА(ВТ_1.КолвоРасход), 0) КАК ПроданноКоличество
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_2 КАК ВТ_2
		|		ПО (ВТ_1.индкод = ВТ_2.Партия)
		|СГРУППИРОВАТЬ ПО
		|	ВТ_1.Товар,
		|	ВТ_1.ТоварКод,
		|	ВТ_1.Артикул,
		|   ВТ_1.индкод 
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня			(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Дата2", КонецДня			(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("ДатаАкции", НачалоДня		(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("КодТовара",КодТовара);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_ПроданныеТовары = РезультатЗапроса.Выгрузить(); 
			Для каждого Строка ИЗ ТЗ_ПроданныеТовары Цикл 
				ЕСли ТЗ_Товары.Количество() > 0 Тогда  
					НайденнаяСтрока = ТЗ_Товары.Найти(Строка(Строка.индкод) ,"индкод");	
					Если НайденнаяСтрока <> Неопределено Тогда   	
				    	НайденнаяСтрока.ПроданноКоличество = Строка.ПроданноКоличество;   	
					Иначе 
						НовыяСтрока = ТЗ_Товары.Добавить(); 
						ЗаполнитьЗначенияСвойств(НовыяСтрока,Строка);
			    	КонецЕсли;	
				Иначе
					//НовыяСтрока = ТЗ_Товары.Добавить(); 
					//ЗаполнитьЗначенияСвойств(НовыяСтрока,Строка);	//
					Возврат ТЗ_ПроданныеТовары;
					
				КонецЕсли; 
			КонецЦикла; 
	КонецЕсли; 

	Возврат ТЗ_Товары; 
	
КонецФункции

Функция ЗабронироватьТовар(АйдиТовара,НомерТелефона) ЭКСПОРТ
	
	//==================================================================================================================
	НомерТелефона = "+7" + " " + Сред(НомерТелефона, 3, 1) + Сред(НомерТелефона, 4, 1) + Сред(НомерТелефона, 5, 1) 
	+ " " + Сред(НомерТелефона, 6, 1) + Сред(НомерТелефона, 7, 1) + Сред(НомерТелефона, 8, 1) + "-" 
	+ Сред(НомерТелефона, 9, 1) + Сред(НомерТелефона, 10, 1) 
	+ "-" + Сред(НомерТелефона, 11, 1) + Сред(НомерТелефона, 12, 1);

	//==================================================================================================================
	НомерЗаявка  	= "";
	СтрокаМенеджер	= "";
	НомерПродажи	= "";
	Массив_Товары_ЕстьНаличие 		= Новый Массив(); 
	Массив_Товары_НетНаличие 		= Новый Массив(); 
	ТЗ_Промежуток 					= Новый ТаблицаЗначений(); 
	//==================================================================================================================
	//Проверка Товара 
	Запрос0 = Новый Запрос;
	Запрос0.Текст =
		"ВЫБРАТЬ 
		|	РегистрАкция10Остатки.Товар КАК Номенклатура, 
		|	РегистрАкция10Остатки.индкод.Наименование КАК Партия,
		|	РегистрАкция10Остатки.Склад КАК Склад,
		|	РегистрАкция10Остатки.машина КАК машина,
		|	РегистрАкция10Остатки.КолвоОстаток КАК Количество,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК Цена
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|	И РегистрАкция10Остатки.индкод.Наименование В (&Наименование)";
	
	Запрос0.УстановитьПараметр("Наименование",АйдиТовара);
	РезультатЗапроса4 = Запрос0.Выполнить();
	ТЗ_Промежуток = РезультатЗапроса4.Выгрузить(); 
	
	Для Каждого  ЭлементМассива ИЗ АйдиТовара Цикл 
		НайденнаяСтрока = ТЗ_Промежуток.Найти(Строка(ЭлементМассива) ,"Партия");	
		Если НайденнаяСтрока <> Неопределено Тогда   	
	    	Массив_Товары_ЕстьНаличие.Добавить(ЭлементМассива);   	
		Иначе 
			Массив_Товары_НетНаличие.Добавить(ЭлементМассива); 
    	КонецЕсли;		
	КонецЦикла; 
	
	//==================================================================================================================
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	ПродажаЗапчастей.Номер КАК НомерПродажи,
	|	ПродажаЗапчастей.ЗаказКлиента КАК ЗаказКлиентаВПродаже
	|ПОМЕСТИТЬ ВТ_Продажа
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Ответственный.Наименование КАК Ответственный,
	|	ВТ_Продажа.НомерПродажи КАК НомерПродажи
	|ИЗ
	|	ВТ_Продажа КАК ВТ_Продажа
	|		Правое СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ВТ_Продажа.ЗаказКлиентаВПродаже = ЗаказКлиента.Ссылка
	|ГДЕ
	|	ЗаказКлиента.УчаствуетВАкции10 = ИСТИНА
	|	И ЗаказКлиента.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЗаказКлиента.НомерТелефонаАкция10 = &НомерТелефона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	
	Запрос1.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	Выборка = РезультатЗапроса1.Выбрать();
	Выборка.Следующий();
		
	Если НЕ РезультатЗапроса1.Пустой() и НЕ ЗначениеЗаполнено(Выборка.НомерПродажи) Тогда 
		НомерЗаявка 	= Выборка.Номер; 
		СтрокаМенеджер 	= Выборка.Ответственный;
		НомерПродажи	= Выборка.НомерПродажи; 
	ИначеЕсли  ЗначениеЗаполнено(Выборка.НомерПродажи) ИЛИ РезультатЗапроса1.Пустой() Тогда
// Создать Заявку ======================================================================================================	
		Запрос2 = Новый Запрос;
		
		Запрос2.Текст =
			"ВЫБРАТЬ
			|	УчастникиАкции10.Ссылка
			|ИЗ
			|	Справочник.УчастникиАкции10 КАК УчастникиАкции10
			|ГДЕ
			|	УчастникиАкции10.НомерТелефона = &НомерТелефона";
		
		Запрос2.УстановитьПараметр("НомерТелефона", НомерТелефона);
		
		РезультатЗапроса2 = Запрос2.Выполнить();
		Если НЕ РезультатЗапроса2.Пустой() Тогда 
			Выборка 		= РезультатЗапроса2.Выбрать();
			Выборка.Следующий();
			НовыйУчастник 	= Выборка.Ссылка;
			Структура 		= СоздатьЗаявку(НомерТелефона,НовыйУчастник);
			НомерЗаявка 	= Структура.НомерЗаявка;
			СтрокаМенеджер 	= Структура.Ответственный; 
			
		Иначе 
			СтуктураОшибки = Новый Структура;
			СтуктураОшибки.Вставить("error","4567");
			Ответ = Новый HTTPСервисОтвет(404); // Не найдено
			Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, СтуктураОшибки);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
			Возврат Ответ;
		КонецЕсли; 
		
	ИначеЕсли НомерЗаявка = "" Тогда
		СтуктураОшибки = Новый Структура;
		СтуктураОшибки.Вставить("error","4223");
		Ответ = Новый HTTPСервисОтвет(500); // Не найдено
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтуктураОшибки);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;	
	КонецЕсли; 
	
	//===================================================================================================================
	// Если Товор уже есть в заявке
	
//	Запрос3 = Новый Запрос;
//	Запрос3.Текст =
//		"ВЫБРАТЬ
//		|	ЗаказКлиентаТовары.Ссылка.Номер
//		|ИЗ
//		|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
//		|ГДЕ
//		|	ЗаказКлиентаТовары.Партия.Наименование = &Наименование
//		|	И ЗаказКлиентаТовары.Ссылка.Номер = &НомерЗаявка";
//	
//	Запрос3.УстановитьПараметр("Наименование", АйдиТовара);
//	Запрос3.УстановитьПараметр("НомерЗаявка", НомерЗаявка);
//	
//	РезультатЗапроса3 = Запрос3.Выполнить();
//	Если НЕ РезультатЗапроса3.Пустой() Тогда 
//		
//		СтруктураТоваров = Новый Структура;
//		СтруктураТоваров.Вставить("application",НомерЗаявка);
//		СтруктураТоваров.Вставить("manager",	СтрокаМенеджер);
//		Ответ = Новый HTTPСервисОтвет(200); 
//		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
//		ЗаписьJSON = Новый ЗаписьJSON;
//		ЗаписьJSON.УстановитьСтроку();
//		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
//		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
//		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
//		Возврат Ответ;
//		
//	КонецЕсли; 
	
	//===================================================================================================================
	Запрос4 = Новый Запрос;
	Запрос4.Текст =
		"ВЫБРАТЬ 
		|	РегистрАкция10Остатки.Товар КАК Номенклатура, 
		|	РегистрАкция10Остатки.индкод КАК Партия,
		|	РегистрАкция10Остатки.Склад КАК Склад,
		|	РегистрАкция10Остатки.машина КАК машина,
		|	РегистрАкция10Остатки.КолвоОстаток КАК Количество,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК Цена
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|	И РегистрАкция10Остатки.индкод.Наименование В (&Наименование)";
	
	Запрос4.УстановитьПараметр("Наименование",Массив_Товары_ЕстьНаличие);
	РезультатЗапроса4 = Запрос4.Выполнить();
	Если НЕ РезультатЗапроса4.Пустой() Тогда 
		
		СсылкаЗаявка = Документы.ЗаказКлиента.НайтиПоНомеру(НомерЗаявка); 
		ОбъектЗаявка = СсылкаЗаявка.ПолучитьОбъект();
		
		Выбока = РезультатЗапроса4.Выбрать(); 
		ПОКА Выбока.Следующий() Цикл 
			НоваяСтрока 	= ОбъектЗаявка.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выбока); 
		КонецЦикла; 
		ОбъектЗаявка.Записать(РежимЗаписиДокумента.Проведение); 
		
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("application",НомерЗаявка);
		СтруктураТоваров.Вставить("manager",СтрокаМенеджер);
		СтруктураТоваров.Вставить("tovId",Массив_Товары_ЕстьНаличие);
		СтруктураТоваров.Вставить("tovIdSole",Массив_Товары_НетНаличие);
		Ответ = Новый HTTPСервисОтвет(201); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
		
	ИначеЕсли Массив_Товары_НетНаличие.Количество()	> 0 Тогда 
		
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("application",НомерЗаявка);
		СтруктураТоваров.Вставить("manager",СтрокаМенеджер);
		СтруктураТоваров.Вставить("tovId",Массив_Товары_ЕстьНаличие);
		СтруктураТоваров.Вставить("tovIdSole",Массив_Товары_НетНаличие);
		Ответ = Новый HTTPСервисОтвет(201); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;

	Иначе 
		СтуктураОшибки = Новый Структура;
		СтуктураОшибки.Вставить("error","3436");
		Ответ = Новый HTTPСервисОтвет(404); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтуктураОшибки);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
	КонецЕсли; 
	
	//==================================================================================================================
КонецФункции

Функция СоздатьЗаявку (НомерТелефона,НовыйУчастник) ЭКСПОРТ
	
	ЗаявкаУчастника 					= 	Документы.ЗаказКлиента.СоздатьДокумент(); 
	ЗаявкаУчастника.Дата 				= 	ТекущаяДатаСеанса();
	ЗаявкаУчастника.КлиентАкция10 		= 	НовыйУчастник.Ссылка; 
	ЗаявкаУчастника.НомерТелефонаАкция10 = 	НомерТелефона;
	ЗаявкаУчастника.УчаствуетВАкции10 	= 	истина; 
	ЗаявкаУчастника.Ответственный		= 	НайтиОтветственногоЗаКлиента(НомерТелефона);
	Ответственный						= 	ЗаявкаУчастника.Ответственный.Наименование;
	ЗаявкаУчастника.Состояние			= 	перечисления.дт_СостоянияЗаказовКлиента.ВРаботе;
	ЗаявкаУчастника.Целевая				= 	Истина; 
	ЗаявкаУчастника.Записать();
	
	Структура = Новый Структура; 
	Структура.Вставить("Ответственный",Ответственный);
	Структура.Вставить("НомерЗаявка",ЗаявкаУчастника.Номер);
	
	Возврат Структура; 
КонецФункции

Функция СоздатьНовогоучастникаАкции(Имя,НомерТелефона) ЭКСПОРТ 
	УчастникСсылка = Справочники.УчастникиАкции10.ПустаяСсылка();
	НомерЗаявка= "";
	НомерТелефона = "+7" + " " + Сред(НомерТелефона, 3, 1) + Сред(НомерТелефона, 4, 1) + Сред(НомерТелефона, 5, 1) + " " + Сред(НомерТелефона, 6, 1) + Сред(НомерТелефона, 7, 1) + Сред(НомерТелефона, 8, 1) + "-" + Сред(НомерТелефона, 9, 1) + Сред(НомерТелефона, 10, 1) + "-" + Сред(НомерТелефона, 11, 1) + Сред(НомерТелефона, 12, 1);
	
	//==================================================================================================================
	// проверка уникальности номера телефона
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчастникиАкции10.Код
		|ИЗ
		|	Справочник.УчастникиАкции10 КАК УчастникиАкции10
		|ГДЕ
		|	УчастникиАкции10.НомерТелефона = &НомерТелефона
		|	И УчастникиАкции10.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда 

		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("message","Пользователь с таким номером уже участвует в акции");
		Ответ = Новый HTTPСервисОтвет(403); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
		
	КонецЕсли; 
	//==================================================================================================================
	
	НовыйУчастник 				= Справочники.УчастникиАкции10.СоздатьЭлемент(); 
	НовыйУчастник.Наименование 	= Имя; 

	НовыйУчастник.НомерТелефона = НомерТелефона;
	НовыйУчастник.ДатаРегистрации = ТекущаяДатаСеанса(); 
	НовыйУчастник.Записать();
	УчастникСсылка = НовыйУчастник.Ссылка;
	
	Структура 		= СоздатьЗаявку(НомерТелефона,УчастникСсылка);
	НомерЗаявка 	= Структура.НомерЗаявка;
	СтрокаМенеджер 	= Структура.Ответственный; 

	Если НомерЗаявка <> "" ИЛИ УчастникСсылка <> Справочники.УчастникиАкции10.ПустаяСсылка() Тогда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("message","Вы успешно зарегистрировались в акции");
		Ответ = Новый HTTPСервисОтвет(201); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
	Иначе 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error","3996");
		Ответ = Новый HTTPСервисОтвет(500); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
	КонецЕСли; 
КонецФункции

Функция НайтиОтветственногоЗаКлиента(Знач НомерТелефона)

	Результат = Справочники.Пользователи.ПустаяСсылка();

	Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Клиенты.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.ПометкаУдаления
	|	И (Клиенты.Телефон = &НомерТелефона
	|	ИЛИ Клиенты.ДополнительныеКонтакты.Телефон = &НомерТелефона)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиенты.Код УБЫВ";

	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ответственный;
	Иначе 
		Возврат Результат; 	
	КонецЕсли;

КонецФункции












