//Функция СписокТоваровАкция10() ЭКСПОРТ
//	//==================================================================================================================
//	ТЗ_Товары = Новый ТаблицаЗначений(); 
//	ТЗ_Фото	  = Новый ТаблицаЗначений(); 
//	ТЗ_КодНоменкл = Новый Массив(); 
//	МассивТоваров = Новый Массив();
//	
//	//==================================================================================================================
//	ТЗ_Товары 	= СписокТоваров();
//	Если НЕ ТЗ_Товары.Количество() > 0 ТОгда 
//		СтруктураТоваров = Новый Структура;
//		СтруктураТоваров.Вставить("error"	,404);
//		Возврат СтруктураТоваров; 
//	КонецЕсли; 
//
//	ТЗ_КодНоменкл = ТЗ_Товары.ВыгрузитьКолонку("Код");
//	ТЗ_Фото = РаботаССайтомWT.ПолучениеФотокарточек(ТЗ_КодНоменкл);
//	
//	//==================================================================================================================
//	Для Каждого стр Из ТЗ_Товары Цикл
//		Для Каждого Строка Из ТЗ_Фото Цикл
//			Если Строка.id = стр.Код Тогда
//				Структура = Новый Структура;
//				Если Строка.images.main <> "" Тогда
//					СтруктураТоваров = Новый Структура;
//					СтруктураТоваров.Вставить("cardId"		,стр.Код );
//					СтруктураТоваров.Вставить("photo"		,Строка.images.main);
//					СтруктураТоваров.Вставить("name"		,стр.Товар);
//					СтруктураТоваров.Вставить("article"		,стр.Артикул);
//					СтруктураТоваров.Вставить("count"		,стр.КолвоОстаток);
//					СтруктураТоваров.Вставить("price"		,стр.ЦенаРекОстаток);
//					СтруктураТоваров.Вставить("salePrice"	,стр.ЦенаОстаток);
//					СтруктураТоваров.Вставить("all"			,стр.КолвоОстаток + стр.ПроданноКоличество);
//					МассивТоваров.Добавить(СтруктураТоваров);
//					Прервать;
//				Иначе
//					Если Строка.images.common.Количество() > 0 Тогда
//						СтруктураТоваров = Новый Структура;
//						СтруктураТоваров.Вставить("cardId"		,стр.Код );
//						СтруктураТоваров.Вставить("photo"		,Строка.images.common[0]);
//						СтруктураТоваров.Вставить("name"		,стр.Товар);
//						СтруктураТоваров.Вставить("article"		,стр.Артикул);
//						СтруктураТоваров.Вставить("count"		,стр.КолвоОстаток);
//						СтруктураТоваров.Вставить("price"		,стр.ЦенаРекОстаток);
//						СтруктураТоваров.Вставить("salePrice"	,стр.ЦенаОстаток);
//						СтруктураТоваров.Вставить("all"			,стр.КолвоОстаток + стр.ПроданноКоличество);
//						МассивТоваров.Добавить(СтруктураТоваров);
//						Прервать;	
//					КонецЕсли;
//				КонецЕсли;
//			КонецЕсли;
//		КонецЦикла;
//	КонецЦикла;
//	
//	Если МассивТоваров.Количество() > 0 Тогда 
//		Возврат МассивТоваров; 
//	Иначе 
//		СтруктураТоваров = Новый Структура;
//		СтруктураТоваров.Вставить("error"	,404);
//		Возврат СтруктураТоваров; 
//	КонецЕсли; 
//	
//	//===================================================================================================================
//КонецФункции

//Функция СписокТоваров() 
//	
//	ТЗ_ПроданныеТовары  = Новый ТаблицаЗначений();
//	ТЗ_Товары			= Новый ТаблицаЗначений();
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
//		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
//		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
//		|	РегистрАкция10Остатки.Товар.Код КАК Код,
//		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
//		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток,
//		|	РегистрАкция10Остатки.индкод КАК индкод
//		|ПОМЕСТИТЬ ВТ_1
//		|ИЗ
//		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
//		|ГДЕ
//		|	РегистрАкция10Остатки.КолвоОстаток > 0
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТ_1.Товар КАК Товар,
//		|	ВТ_1.Код КАК Код,
//		|	ВТ_1.Артикул КАК Артикул,
//		|	МИНИМУМ(ВТ_1.ЦенаРекОстаток) КАК ЦенаРекОстаток,
//		|	СУММА(ВТ_1.КолвоОстаток) КАК КолвоОстаток, 
//		|	МИНИМУМ(ВТ_1.ЦенаОстаток) КАК ЦенаОстаток,
//		|	0 КАК ПроданноКоличество
//		|ИЗ
//		|	ВТ_1 КАК ВТ_1
//		|СГРУППИРОВАТЬ ПО
//		|	ВТ_1.Товар,
//		|	ВТ_1.Код,
//		|	ВТ_1.Артикул
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ЦенаОстаток УБЫВ";
//	
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	Если НЕ РезультатЗапроса.Пустой() Тогда 
//		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
//	КонецЕсли; 
//	
//	//==================================================================================================================
//	
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//		"ВЫБРАТЬ
//		|	РегистрАкция10ОстаткиИОбороты.индкод КАК индкод,
//		|	МИНИМУМ(РегистрАкция10ОстаткиИОбороты.КолвоРасход) КАК КолвоРасход,
//		|	РегистрАкция10ОстаткиИОбороты.Товар.Артикул КАК Артикул,
//		|	РегистрАкция10ОстаткиИОбороты.Товар.Наименование КАК Товар,
//		|	РегистрАкция10ОстаткиИОбороты.Товар.Код КАК ТоварКод,
//		|	МИНИМУМ(РегистрАкция10ОстаткиИОбороты.ЦенаРасход) КАК ЦенаРасход,
//		|	МИНИМУМ(РегистрАкция10ОстаткиИОбороты.ЦенаРекРасход) КАК ЦенаРекРасход
//		|ПОМЕСТИТЬ ВТ_1
//		|ИЗ
//		|	РегистрНакопления.РегистрАкция10.ОстаткиИОбороты(&Дата1, &Дата2, День,,) КАК РегистрАкция10ОстаткиИОбороты
//		|СГРУППИРОВАТЬ ПО
//		|	РегистрАкция10ОстаткиИОбороты.индкод,
//		|	РегистрАкция10ОстаткиИОбороты.Товар.Наименование,
//		|	РегистрАкция10ОстаткиИОбороты.Товар.Код,
//		|	РегистрАкция10ОстаткиИОбороты.Товар.Артикул
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ЗаходАкция10Товары.Партия КАК Партия,
//		|	ЗаходАкция10Товары.ЦенаАкция КАК ЦенаАкция,
//		|	ЗаходАкция10Товары.ЦенаРек КАК ЦенаРек
//		|ПОМЕСТИТЬ ВТ_2
//		|ИЗ
//		|	Документ.ЗаходАкция10.Товары КАК ЗаходАкция10Товары
//		|ГДЕ
//		|	ЗаходАкция10Товары.Ссылка.ПометкаУдаления = ЛОЖЬ
////		|	И ЗаходАкция10Товары.Ссылка.ДатаАкции = &ДатаАкции
//		|;
//		|
//		|////////////////////////////////////////////////////////////////////////////////
//		|ВЫБРАТЬ
//		|	ВТ_1.Товар КАК Товар,
//		|	ВТ_1.ТоварКод КАК Код,
//		|	ВТ_1.Артикул КАК Артикул,
//		|	ЕСТЬNULL(МИНИМУМ(ВТ_2.ЦенаРек), 0) КАК ЦенаРекОстаток,
//		|	0 КАК КолвоОстаток,
//		|	ЕСТЬNULL(МИНИМУМ(ВТ_2.ЦенаАкция), 0) КАК ЦенаОстаток,
//		|	ЕСТЬNULL(СУММА(ВТ_1.КолвоРасход), 0) КАК ПроданноКоличество
//		|ИЗ
//		|	ВТ_1 КАК ВТ_1
//		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_2 КАК ВТ_2
//		|		ПО (ВТ_1.индкод = ВТ_2.Партия)
//		|СГРУППИРОВАТЬ ПО
//		|	ВТ_1.Товар,
//		|	ВТ_1.ТоварКод,
//		|	ВТ_1.Артикул
//		|
//		|УПОРЯДОЧИТЬ ПО
//		|	ЦенаОстаток УБЫВ";
//	
//	Запрос.УстановитьПараметр("Дата1", НачалоДня			(ТекущаяДатаСеанса()));
//	Запрос.УстановитьПараметр("Дата2", КонецДня				(ТекущаяДатаСеанса()));
////	Запрос.УстановитьПараметр("ДатаАкции", НачалоДня		(ТекущаяДатаСеанса()));
//	
//	РезультатЗапроса = Запрос.Выполнить();
//	
//	Если НЕ РезультатЗапроса.Пустой() Тогда 
//		ТЗ_ПроданныеТовары = РезультатЗапроса.Выгрузить(); 
//		
//			Для каждого Строка ИЗ ТЗ_ПроданныеТовары Цикл 
//		
//			НайденнаяСтрока = ТЗ_Товары.Найти(Строка(Строка.Товар) ,"Товар");	
//			Если НайденнаяСтрока <> Неопределено Тогда
//	        	
//	        	НайденнаяСтрока.ПроданноКоличество = Строка.ПроданноКоличество; 
//	        	
//			Иначе 
//				НовыяСтрока = ТЗ_Товары.Добавить(); 
//				ЗаполнитьЗначенияСвойств(НовыяСтрока,Строка);
//	    	КонецЕсли;	
//			
//			КонецЦикла; 
//	КонецЕсли; 
//	
//	Возврат ТЗ_Товары; 
//	//==================================================================================================================
//	
//КонецФункции	

Функция ПолучитьТоварыАкция10(count,page) ЭКСПОРТ //(КодТовара)
	
	//==================================================================================================================
	ТЗ_Товары 		 = Новый ТаблицаЗначений(); 
	ТЗ_Фото	  		 = Новый ТаблицаЗначений(); 
	ТЗ_Фото_Карточек = Новый ТаблицаЗначений(); 
	Массив_ИндКод	 = Новый Массив(); 
	МассивТоваров 	 = Новый Массив();
	Массив_Кодов	 = Новый Массив();
	СтраницВсего     = Новый Структура; 
	//====================================================================================================================
	
	СтрукткраОтвета = СписокТоваров(count,page); 
	Если СтрукткраОтвета = Неопределено Тогда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,6666);
		Возврат СтруктураТоваров; 
	КонецЕсли; 
	
	ТЗ_Товары =  СтрукткраОтвета.МассивТовары;
	СтраницВсего.Вставить("allPages", СтрукткраОтвета.СтраницВсего); 
	МассивТоваров.Добавить(СтраницВсего); 
	
	Если ТЗ_Товары.Количество() < 1  Тогда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,7777);
		Возврат СтруктураТоваров; 
	КонецЕсли;
	
	Массив_ИндКод 	= ТЗ_Товары.ВыгрузитьКолонку("индкод");
	Массив_Кодов	= ТЗ_Товары.ВыгрузитьКолонку("Код");
	//=====================================================================================================================
	ТЗ_Фото 		= РаботаССайтомWT.ПолучениеФотоБезИндНомер(Массив_ИндКод);
	ТЗ_Фото_Карточки = РаботаССайтомWT.ПолучениеФотокарточек(Массив_Кодов);
	//====================================================================================================================
	Для Каждого стр Из ТЗ_Товары Цикл
		
		Для Каждого Строка Из ТЗ_Фото Цикл
			Если Строка.indCode = стр.индкод Тогда
				Если Строка.urls.Количество() > 0 Тогда
					МассивФото = Новый Массив();
					Счетчик = 0; 
					Флаг = Ложь;
					Для Каждого СтрокаУрл ИЗ Строка.urls Цикл
						МассивФото.Добавить(СтрокаУрл);
						Счетчик = Счетчик + 1 ;
						Флаг = Истина; 
						Если Счетчик = 2 Тогда 
							Прервать;
						КонецЕсли; 
					КонецЦикла; 
					
					Если Флаг = Истина Тогда 
						СтруктураТоваров = Новый Структура;
						СтруктураТоваров.Вставить("name"	 ,стр.Товар);
						СтруктураТоваров.Вставить("article"	 ,стр.Артикул);
						СтруктураТоваров.Вставить("photo"	 ,МассивФото);
						СтруктураТоваров.Вставить("tovId"	 ,стр.индкод);
						СтруктураТоваров.Вставить("salePrice",стр.ЦенаОстаток);
						СтруктураТоваров.Вставить("price"    ,стр.ЦенаРекОстаток);
						СтруктураТоваров.Вставить("sold"	 ,стр.ПроданноКоличество);
						
						Если стр.НомерТелефона = "     " Тогда 
							СтруктураТоваров.Вставить("phoneClients",""); 
						ИНаче 
							СтруктураТоваров.Вставить("phoneClients",стр.НомерТелефона); 
						КонецЕсли; 
						
						МассивТоваров.Добавить(СтруктураТоваров);
						Прервать;
						
					КонецЕсли; 
				Иначе 
					Для Каждого Строка1 Из ТЗ_Фото_Карточки Цикл
						Если Строка1.images.main <> "" Тогда
							МассивФото = Новый Массив();
							МассивФото.Добавить(Строка1.images.main);
							СтруктураТоваров = Новый Структура;
							СтруктураТоваров.Вставить("name"	 ,стр.Товар);
							СтруктураТоваров.Вставить("article"	 ,стр.Артикул);
							СтруктураТоваров.Вставить("photo"	 ,МассивФото);
							СтруктураТоваров.Вставить("tovId"	 ,стр.индкод);
							СтруктураТоваров.Вставить("salePrice",стр.ЦенаОстаток);
							СтруктураТоваров.Вставить("price"	 ,стр.ЦенаРекОстаток);
							СтруктураТоваров.Вставить("sold"	 ,стр.ПроданноКоличество);
							
							Если стр.НомерТелефона = "     " Тогда 
								СтруктураТоваров.Вставить("phoneClients",""); 
							ИНаче 
								СтруктураТоваров.Вставить("phoneClients",стр.НомерТелефона); 
							КонецЕсли;
							
							МассивТоваров.Добавить(СтруктураТоваров);
							Прервать;
						Иначе
							Если Строка1.images.common.Количество() > 0 Тогда
								СтруктураТоваров = Новый Структура;
								МассивФото = Новый Массив();
								МассивФото.Добавить(Строка1.images.common[0]);
								СтруктураТоваров.Вставить("name"	 ,стр.Товар);
								СтруктураТоваров.Вставить("article"	 ,стр.Артикул);
								СтруктураТоваров.Вставить("photo"	 ,МассивФото);
								СтруктураТоваров.Вставить("tovId"	 ,стр.индкод);
								СтруктураТоваров.Вставить("salePrice",стр.ЦенаОстаток);
								СтруктураТоваров.Вставить("price"    ,стр.ЦенаРекОстаток);
								СтруктураТоваров.Вставить("sold"	 ,стр.ПроданноКоличество);
								
								Если стр.НомерТелефона = "     " Тогда 
									СтруктураТоваров.Вставить("phoneClients",""); 
								ИНаче 
									СтруктураТоваров.Вставить("phoneClients",стр.НомерТелефона); 
								КонецЕсли;
								
								МассивТоваров.Добавить(СтруктураТоваров);
								Прервать;	
							КонецЕсли;
						КонецЕсли;
					КонецЦикла;
				//=======================================================================================================	
				КонецЕсли;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(МассивТоваров) Тогда 
		Возврат МассивТоваров; 
	Иначе 
		
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error"	,1313);
		Возврат СтруктураТоваров; 
		
	КонецЕсли; 
	
	//==================================================================================================================
КонецФункции

Функция СписокТоваров(Количество,Страница) 
	
//======================================================================================================================

	ТЗ_ПроданныеТовары  = Новый ТаблицаЗначений();
	ТЗ_Товары			= Новый ТаблицаЗначений();
	
	ТЗ_Товары_2 = Новый  ТаблицаЗначений(); 
	ТЗ_Товары_2.Колонки.Добавить("Товар"); 
	ТЗ_Товары_2.Колонки.Добавить("Код"); 
	ТЗ_Товары_2.Колонки.Добавить("Артикул"); 
	ТЗ_Товары_2.Колонки.Добавить("ЦенаРекОстаток"); 
	ТЗ_Товары_2.Колонки.Добавить("КолвоОстаток"); 
	ТЗ_Товары_2.Колонки.Добавить("ЦенаОстаток"); 
	ТЗ_Товары_2.Колонки.Добавить("ПроданноКоличество"); 
	ТЗ_Товары_2.Колонки.Добавить("НомерТелефона"); 
	ТЗ_Товары_2.Колонки.Добавить("индкод");
	
	count = 0;
	page = 0; 
    КоличествоВсего = 0;
	СтраницВсего = 0; 
	Остаток = 0;
	Начало = 0;
	Конец =  0;
	
	СтрукткраОтвета = Новый Структура; 
//=========================================================================================================	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.Товар.Наименование КАК Товар,
		|	РегистрАкция10Остатки.КолвоОстаток КАК КолвоОстаток,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК ЦенаОстаток,
		|	РегистрАкция10Остатки.Товар.Код КАК Код,
		|	РегистрАкция10Остатки.Товар.Артикул КАК Артикул,
		|	РегистрАкция10Остатки.ЦенаРекОстаток КАК ЦенаРекОстаток,
		|	РегистрАкция10Остатки.индкод.Наименование КАК индкод
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки(,) КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Товар КАК Товар,
		|	ВТ_1.Код КАК Код,
		|	ВТ_1.Артикул КАК Артикул,
		|	МИНИМУМ(ВТ_1.ЦенаРекОстаток) КАК ЦенаРекОстаток,
		|	СУММА(ВТ_1.КолвоОстаток) КАК КолвоОстаток,
		|	МИНИМУМ(ВТ_1.ЦенаОстаток) КАК ЦенаОстаток,
		|	0 КАК ПроданноКоличество,
		|   ""     "" КАК НомерТелефона,
		|	ВТ_1.индкод КАК индкод
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|СГРУППИРОВАТЬ ПО
		|	ВТ_1.Товар,
		|	ВТ_1.Код,
		|	ВТ_1.Артикул,
		|	ВТ_1.индкод
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаОстаток УБЫВ";
	
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_Товары = РезультатЗапроса.Выгрузить(); 
	КонецЕсли; 
	
	//==================================================================================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10ОстаткиИОбороты.индкод.Наименование КАК индкод,
		|	РегистрАкция10ОстаткиИОбороты.КолвоРасход КАК КолвоРасход,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Артикул КАК Артикул,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Наименование КАК Товар,
		|	РегистрАкция10ОстаткиИОбороты.Товар.Код КАК ТоварКод,
		|	РегистрАкция10ОстаткиИОбороты.ЦенаРасход КАК ЦенаРасход,
		|	РегистрАкция10ОстаткиИОбороты.ЦенаРекРасход КАК ЦенаРекРасход
		|ПОМЕСТИТЬ ВТ_1
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.ОстаткиИОбороты(&Дата1, &Дата2, День, , ) КАК РегистрАкция10ОстаткиИОбороты
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	МАКСИМУМ(ЗаходАкция10Товары.Ссылка) КАК Ссылка,
		|	ЗаходАкция10Товары.Партия КАК Партия
		|ПОМЕСТИТЬ ВТ_3
		|ИЗ
		|	Документ.ЗаходАкция10.Товары КАК ЗаходАкция10Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_1 КАК ВТ_1
		|		ПО (ВТ_1.индкод = ЗаходАкция10Товары.Партия.Наименование)
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаходАкция10Товары.Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЗаходАкция10Товары.Партия КАК Партия,
		|	МИНИМУМ(ЕСТЬNULL(ЗаходАкция10Товары.ЦенаАкция, 0)) КАК ЦенаАкция,
		|	МИНИМУМ(ЕСТЬNULL(ЗаходАкция10Товары.ЦенаРек, 0)) КАК ЦенаРек,
		|	МАКСИМУМ(ЗаходАкция10Товары.Ссылка) КАК Ссылка
		|ПОМЕСТИТЬ ВТ_2
		|ИЗ
		|	Документ.ЗаходАкция10.Товары КАК ЗаходАкция10Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_3 КАК ВТ_3
		|		ПО (ВТ_3.Ссылка = ЗаходАкция10Товары.Ссылка)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_1 КАК ВТ_1
		|		ПО ЗаходАкция10Товары.Партия.Наименование = ВТ_1.индкод
		|ГДЕ
		|	ЗаходАкция10Товары.Ссылка.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	ЗаходАкция10Товары.Партия
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_1.Товар КАК Товар,
		|	ВТ_1.ТоварКод КАК Код,
		|	ВТ_1.Артикул КАК Артикул,
		|	ВТ_1.индкод КАК индкод,
		|	ЕСТЬNULL(ВТ_1.КолвоРасход, 0) КАК ПроданноКоличество,
		|	ЕСТЬNULL(ВТ_2.ЦенаРек, 0) КАК ЦенаРекОстаток,
		|	0 КАК КолвоОстаток,
		|	ЕСТЬNULL(ВТ_2.ЦенаАкция, 0) КАК ЦенаОстаток,
		|	ЗаказКлиентаТовары.Ссылка.НомерТелефонаАкция10  КАК НомерТелефона2
		|ИЗ
		|	ВТ_1 КАК ВТ_1
		|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_2 КАК ВТ_2
		|		ПО ВТ_1.индкод = ВТ_2.Партия.Наименование
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаказКлиента.Товары КАК ЗаказКлиентаТовары
		|		ПО (ЗаказКлиентаТовары.Партия.Наименование = ВТ_1.индкод)
		|			И (ЗаказКлиентаТовары.Ссылка.НомерТелефонаАкция10 <> """")
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЦенаОстаток УБЫВ";
	
	Запрос.УстановитьПараметр("Дата1", НачалоДня(ТекущаяДатаСеанса()));
	Запрос.УстановитьПараметр("Дата2", КонецДня(ТекущаяДатаСеанса()));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		ТЗ_ПроданныеТовары = РезультатЗапроса.Выгрузить(); 
			Для каждого Строка ИЗ ТЗ_ПроданныеТовары Цикл 
				ЕСли ТЗ_Товары.Количество() > 0 Тогда  
					НайденнаяСтрока = ТЗ_Товары.Найти(Строка(Строка.индкод) ,"индкод");	
					Если НайденнаяСтрока <> Неопределено Тогда   	 	
					Иначе 
						НовыяСтрока = ТЗ_Товары.Добавить();
						НовыяСтрока.НомерТелефона  =  Прав(СтрЗаменить(Строка.НомерТелефона2," ",""), 5);
						ЗаполнитьЗначенияСвойств(НовыяСтрока,Строка);
			    	КонецЕсли;	
				Иначе
					 ТЗ_Товары = ТЗ_ПроданныеТовары;
				КонецЕсли; 
			КонецЦикла; 
	КонецЕсли; 
	
//	Возврат ТЗ_Товары; 
	//================================================================================================================================
	ТЗ_Товары.Сортировать("ЦенаОстаток УБЫВ"); 
	
	КоличествоВсего = ТЗ_Товары.Количество();
	СтраницВсего = Цел(КоличествоВсего / Количество); 
	Остаток = КоличествоВсего % Количество;
	Если Остаток > 0 Тогда 
		СтраницВсего = СтраницВсего + 1;	
	КонецЕСли; 
	
	Начало = Количество * (Страница - 1) + 1;
	Конец	=  Начало +  Количество - 1;
	
	Счетчик = 1; 
	Для каждого Строка ИЗ ТЗ_Товары Цикл 
		Если Счетчик >= Начало И Счетчик <= Конец  Тогда 
			НовыяСтрока = ТЗ_Товары_2.Добавить();
			ЗаполнитьЗначенияСвойств(НовыяСтрока,Строка); 
		КонецЕСли;                                        
		Счетчик = Счетчик + 1;
	КонецЦикла; 
	
	Если ЗначениеЗаполнено(ТЗ_Товары_2) Тогда 
		СтрукткраОтвета.Вставить("МассивТовары",ТЗ_Товары_2); 
		СтрукткраОтвета.Вставить("СтраницВсего",СтраницВсего);
		Возврат СтрукткраОтвета;  
	Иначе 
		Возврат Неопределено; 
	КонецЕСли; 
	
	//==================================================================================================================
	
КонецФункции

Функция ЗабронироватьТовар (АйдиТовара,НомерТелефона) ЭКСПОРТ
	
	//==================================================================================================================
	НомерТелефона = "+7" + " " + Сред(НомерТелефона, 3, 1) + Сред(НомерТелефона, 4, 1) + Сред(НомерТелефона, 5, 1) 
	+ " " + Сред(НомерТелефона, 6, 1) + Сред(НомерТелефона, 7, 1) + Сред(НомерТелефона, 8, 1) + "-" 
	+ Сред(НомерТелефона, 9, 1) + Сред(НомерТелефона, 10, 1) 
	+ "-" + Сред(НомерТелефона, 11, 1) + Сред(НомерТелефона, 12, 1);

	//==================================================================================================================
	НомерЗаявка  	= "";
	СтрокаМенеджер	= "";
	НомерПродажи	= "";
	Массив_Товары_ЕстьНаличие 		= Новый Массив(); 
	Массив_Товары_НетНаличие 		= Новый Массив(); 
	ТЗ_Промежуток 					= Новый ТаблицаЗначений(); 
	//==================================================================================================================
	//Проверка Товара 
	Запрос0 = Новый Запрос;
	Запрос0.Текст =
		"ВЫБРАТЬ 
		|	РегистрАкция10Остатки.Товар КАК Номенклатура, 
		|	РегистрАкция10Остатки.индкод.Наименование КАК Партия,
		|	РегистрАкция10Остатки.Склад КАК Склад,
		|	РегистрАкция10Остатки.машина КАК машина,
		|	РегистрАкция10Остатки.КолвоОстаток КАК Количество,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК Цена
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|	И РегистрАкция10Остатки.индкод.Наименование В (&Наименование)";
	
	Запрос0.УстановитьПараметр("Наименование",АйдиТовара);
	РезультатЗапроса4 = Запрос0.Выполнить();
	ТЗ_Промежуток = РезультатЗапроса4.Выгрузить(); 
	
	Для Каждого  ЭлементМассива ИЗ АйдиТовара Цикл 
		НайденнаяСтрока = ТЗ_Промежуток.Найти(Строка(ЭлементМассива) ,"Партия");	
		Если НайденнаяСтрока <> Неопределено Тогда   	
	    	Массив_Товары_ЕстьНаличие.Добавить(ЭлементМассива);   	
		Иначе 
			Массив_Товары_НетНаличие.Добавить(ЭлементМассива); 
    	КонецЕсли;		
	КонецЦикла; 
	
	//==================================================================================================================
	Запрос1 = Новый Запрос;
	Запрос1.Текст = 
	"ВЫБРАТЬ
	|	ПродажаЗапчастей.Номер КАК НомерПродажи,
	|	ПродажаЗапчастей.ЗаказКлиента КАК ЗаказКлиентаВПродаже
	|ПОМЕСТИТЬ ВТ_Продажа
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЗаказКлиента.Номер КАК Номер,
	|	ЗаказКлиента.Ответственный.Наименование КАК Ответственный,
	|	ВТ_Продажа.НомерПродажи КАК НомерПродажи
	|ИЗ
	|	ВТ_Продажа КАК ВТ_Продажа
	|		Правое СОЕДИНЕНИЕ Документ.ЗаказКлиента КАК ЗаказКлиента
	|		ПО ВТ_Продажа.ЗаказКлиентаВПродаже = ЗаказКлиента.Ссылка
	|ГДЕ
	|	ЗаказКлиента.УчаствуетВАкции10 = ИСТИНА
	|	И ЗаказКлиента.Ссылка.ПометкаУдаления = ЛОЖЬ
	|	И ЗаказКлиента.НомерТелефонаАкция10 = &НомерТелефона
	|
	|УПОРЯДОЧИТЬ ПО
	|	Номер УБЫВ";
	
	Запрос1.УстановитьПараметр("НомерТелефона", НомерТелефона);
	
	РезультатЗапроса1 = Запрос1.Выполнить();
	Выборка = РезультатЗапроса1.Выбрать();
	Выборка.Следующий();
		
	Если НЕ РезультатЗапроса1.Пустой() и НЕ ЗначениеЗаполнено(Выборка.НомерПродажи) Тогда 
		НомерЗаявка 	= Выборка.Номер; 
		Если ЗначениеЗаполнено(Выборка.Ответственный) Тогда 
			СтрокаМенеджер 	= Строка(Выборка.Ответственный);
		КонецЕсли; 
	//	НомерПродажи	= Выборка.НомерПродажи; 
	ИначеЕсли  ЗначениеЗаполнено(Выборка.НомерПродажи) ИЛИ РезультатЗапроса1.Пустой() Тогда
// Создать Заявку ======================================================================================================	
		Запрос2 = Новый Запрос;
		
		Запрос2.Текст =
			"ВЫБРАТЬ
			|	УчастникиАкции10.Ссылка
			|ИЗ
			|	Справочник.УчастникиАкции10 КАК УчастникиАкции10
			|ГДЕ
			|	УчастникиАкции10.НомерТелефона = &НомерТелефона";
		
		Запрос2.УстановитьПараметр("НомерТелефона", НомерТелефона);
		
		РезультатЗапроса2 = Запрос2.Выполнить();
		Если НЕ РезультатЗапроса2.Пустой() Тогда 
			Выборка 		= РезультатЗапроса2.Выбрать();
			Выборка.Следующий();
			НовыйУчастник 	= Выборка.Ссылка;
			Структура 		= СоздатьЗаявку(НомерТелефона,НовыйУчастник);
			НомерЗаявка 	= Структура.НомерЗаявка;
			Если ЗначениеЗаполнено(Структура.Ответственный) Тогда 
				СтрокаМенеджер 	= Строка(Структура.Ответственный); 
			КонецЕсли; 
		Иначе 
			СтуктураОшибки = Новый Структура;
			СтуктураОшибки.Вставить("error","4567");
			Ответ = Новый HTTPСервисОтвет(404); // Не найдено
			Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, СтуктураОшибки);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
			Возврат Ответ;
		КонецЕсли; 
		
	ИначеЕсли НомерЗаявка = "" Тогда
		СтуктураОшибки = Новый Структура;
		СтуктураОшибки.Вставить("error","4223");
		Ответ = Новый HTTPСервисОтвет(500); // Не найдено
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтуктураОшибки);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;	
	КонецЕсли; 
	
//======================================================================================================================

	Запрос4 = Новый Запрос;
	Запрос4.Текст =
		"ВЫБРАТЬ 
		|	РегистрАкция10Остатки.Товар КАК Номенклатура, 
		|	РегистрАкция10Остатки.индкод КАК Партия,
		|	РегистрАкция10Остатки.Склад КАК Склад,
		|	РегистрАкция10Остатки.машина КАК машина,
		|	РегистрАкция10Остатки.КолвоОстаток КАК Количество,
		|	РегистрАкция10Остатки.ЦенаОстаток КАК Цена
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0
		|	И РегистрАкция10Остатки.индкод.Наименование В (&Наименование)";
	
	Запрос4.УстановитьПараметр("Наименование",Массив_Товары_ЕстьНаличие);
	РезультатЗапроса4 = Запрос4.Выполнить();
	Если НЕ РезультатЗапроса4.Пустой() Тогда 
		
		СсылкаЗаявка = Документы.ЗаказКлиента.НайтиПоНомеру(НомерЗаявка); 
		ОбъектЗаявка = СсылкаЗаявка.ПолучитьОбъект();
		
		Выбока = РезультатЗапроса4.Выбрать(); 
		ПОКА Выбока.Следующий() Цикл 
			НоваяСтрока 	= ОбъектЗаявка.Товары.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выбока); 
		КонецЦикла; 
		ОбъектЗаявка.Записать(РежимЗаписиДокумента.Проведение); 
		
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("application",НомерЗаявка);
		СтруктураТоваров.Вставить("manager",СтрокаМенеджер);
		СтруктураТоваров.Вставить("tovIdReserved",Массив_Товары_ЕстьНаличие);
		СтруктураТоваров.Вставить("tovIdSold",Массив_Товары_НетНаличие);
		Ответ = Новый HTTPСервисОтвет(200); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
		
	ИначеЕсли Массив_Товары_НетНаличие.Количество()	> 0 Тогда 
		
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("application",НомерЗаявка);
		СтруктураТоваров.Вставить("manager",	СтрокаМенеджер);
		СтруктураТоваров.Вставить("tovIdReserved",Массив_Товары_ЕстьНаличие);
		СтруктураТоваров.Вставить("tovIdSold",	Массив_Товары_НетНаличие);
		Ответ = Новый HTTPСервисОтвет(200); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;	    
	Иначе 
		СтуктураОшибки = Новый Структура;
		СтуктураОшибки.Вставить("error","3436");
		Ответ = Новый HTTPСервисОтвет(404); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтуктураОшибки);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
	КонецЕсли; 
	
	//==================================================================================================================
КонецФункции

Функция СоздатьЗаявку (НомерТелефона,НовыйУчастник) ЭКСПОРТ
	
	ЗаявкаУчастника 					= 	Документы.ЗаказКлиента.СоздатьДокумент(); 
	ЗаявкаУчастника.Дата 				= 	ТекущаяДатаСеанса();
	ЗаявкаУчастника.КлиентАкция10 		= 	НовыйУчастник.Ссылка; 
	ЗаявкаУчастника.НомерТелефонаАкция10 = 	НомерТелефона;
	ЗаявкаУчастника.УчаствуетВАкции10 	= 	истина; 
	ЗаявкаУчастника.Ответственный		= 	НайтиОтветственногоЗаКлиента(НомерТелефона);
	Ответственный						= 	ЗаявкаУчастника.Ответственный.Наименование;
	ЗаявкаУчастника.Состояние			= 	перечисления.дт_СостоянияЗаказовКлиента.ВРаботе;
	ЗаявкаУчастника.Целевая				= 	Истина; 
	ЗаявкаУчастника.Записать();
	
	Структура = Новый Структура; 
	Структура.Вставить("Ответственный",Ответственный);
	Структура.Вставить("НомерЗаявка",ЗаявкаУчастника.Номер);
	
	Возврат Структура; 
КонецФункции

Функция СоздатьНовогоучастникаАкции(Имя,НомерТелефона) ЭКСПОРТ 
	УчастникСсылка = Справочники.УчастникиАкции10.ПустаяСсылка();
	НомерЗаявка= "";
	НомерТелефона = "+7" + " " + Сред(НомерТелефона, 3, 1) + Сред(НомерТелефона, 4, 1) + Сред(НомерТелефона, 5, 1) + " " + Сред(НомерТелефона, 6, 1) + Сред(НомерТелефона, 7, 1) + Сред(НомерТелефона, 8, 1) + "-" + Сред(НомерТелефона, 9, 1) + Сред(НомерТелефона, 10, 1) + "-" + Сред(НомерТелефона, 11, 1) + Сред(НомерТелефона, 12, 1);
	
	//==================================================================================================================
	// проверка уникальности номера телефона
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УчастникиАкции10.Код
		|ИЗ
		|	Справочник.УчастникиАкции10 КАК УчастникиАкции10
		|ГДЕ
		|	УчастникиАкции10.НомерТелефона = &НомерТелефона
		|	И УчастникиАкции10.ПометкаУдаления = ЛОЖЬ";

	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда 

		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("message","Пользователь с таким номером уже участвует в акции");
		Ответ = Новый HTTPСервисОтвет(403); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
		
	КонецЕсли; 
	//==================================================================================================================
	
	НовыйУчастник 				= Справочники.УчастникиАкции10.СоздатьЭлемент(); 
	НовыйУчастник.Наименование 	= Имя; 

	НовыйУчастник.НомерТелефона = НомерТелефона;
	НовыйУчастник.ДатаРегистрации = ТекущаяДатаСеанса(); 
	НовыйУчастник.Записать();
	УчастникСсылка = НовыйУчастник.Ссылка;
	
	Структура 		= СоздатьЗаявку(НомерТелефона,УчастникСсылка);
	НомерЗаявка 	= Структура.НомерЗаявка;
	СтрокаМенеджер 	= Структура.Ответственный; 

	Если НомерЗаявка <> "" ИЛИ УчастникСсылка <> Справочники.УчастникиАкции10.ПустаяСсылка() Тогда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("message","Вы успешно зарегистрировались в акции");
		Ответ = Новый HTTPСервисОтвет(201); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
	Иначе 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error","3996");
		Ответ = Новый HTTPСервисОтвет(500); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
	КонецЕСли; 
КонецФункции

Функция НайтиОтветственногоЗаКлиента(Знач НомерТелефона)

	Результат = Справочники.Пользователи.ПустаяСсылка();
	
	Если Не ЗначениеЗаполнено(НомерТелефона) Тогда
		Возврат Результат;
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Клиенты.Ответственный КАК Ответственный
	|ИЗ
	|	Справочник.Клиенты КАК Клиенты
	|ГДЕ
	|	НЕ Клиенты.ПометкаУдаления
	|	И (Клиенты.Телефон = &НомерТелефона
	|	ИЛИ Клиенты.ДополнительныеКонтакты.Телефон = &НомерТелефона)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Клиенты.Код УБЫВ";

	Запрос.УстановитьПараметр("НомерТелефона", НомерТелефона);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Возврат Выборка.Ответственный;
	Иначе 
		Возврат Результат; 	
	КонецЕсли;

КонецФункции

Функция ДобавитьВАкциюТовар(АйдиТовара) ЭКСПОРТ
	
	ДокументПоступления 		= Документы.ЗаходАкция10.ПустаяСсылка(); 
	НомерДокументПоступления 	= ""; 
	СсылкаАйдиТовара = Справочники.ИндКод.НайтиПоНаименованию(АйдиТовара); 
	//==================================================================================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрНакопления1Остатки.индкод.Наименование
		|ИЗ
		|	РегистрНакопления.РегистрНакопления1.Остатки(, индкод = &индкод) КАК РегистрНакопления1Остатки
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток < 1";
	
	Запрос.УстановитьПараметр("индкод", СсылкаАйдиТовара);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("error","4564");
		Ответ = Новый HTTPСервисОтвет(404); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
	КонецЕсли; 
	//==================================================================================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.индкод.Наименование КАК индкод
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки(, индкод = &индкод) КАК РегистрАкция10Остатки
		|ГДЕ
		|	РегистрАкция10Остатки.КолвоОстаток > 0";
	
	Запрос.УстановитьПараметр("индкод", СсылкаАйдиТовара);
	РезультатЗапроса = Запрос.Выполнить();
	Если НЕ РезультатЗапроса.Пустой() Тогда 
		СтруктураТоваров = Новый Структура;
		СтруктураТоваров.Вставить("message","Товар участвует в акции");
		Ответ = Новый HTTPСервисОтвет(200); 
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		ЗаписьJSON = Новый ЗаписьJSON;
		ЗаписьJSON.УстановитьСтроку();
		ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
		СтрокаДляОтвета = ЗаписьJSON.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
		Возврат Ответ;
	КонецЕсли; 
	
	//====================================================================================================================		
	Запрос01 = Новый Запрос;
	Запрос01.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ЗаходАкция10.Номер КАК Номер,
		|	ЗаходАкция10.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ЗаходАкция10 КАК ЗаходАкция10
		|ГДЕ
		|	ЗаходАкция10.СозданЗапросам = ИСТИНА
		|	И ЗаходАкция10.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";

	РезультатЗапроса01 = Запрос01.Выполнить();
	
	Если НЕ РезультатЗапроса01.Пустой() Тогда 
		
		Выборка01 = РезультатЗапроса01.Выбрать();
		Выборка01.Следующий();
		НомерДокументПоступления = Выборка01.Номер; 
		СсылкаДокументПоступления = Выборка01.Ссылка;
		
		Запрос02 = Новый Запрос;
		Запрос02.Текст =
			"ВЫБРАТЬ
			|	ЗаходАкция10Товары.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ЗаходАкция10.Товары КАК ЗаходАкция10Товары
			|ГДЕ
			|	ЗаходАкция10Товары.НомерСтроки = 200
			|	И ЗаходАкция10Товары.Ссылка.Номер = &Номер
			|	И ЗаходАкция10Товары.Ссылка.ПометкаУдаления = ЛОЖЬ";
		
		Запрос02.УстановитьПараметр("Номер", НомерДокументПоступления);
		РезультатЗапроса02 = Запрос02.Выполнить();
		Выборка02 = РезультатЗапроса02.Выбрать();
		Выборка02.Следующий();
		
		Если  НЕ РезультатЗапроса02.Пустой() Тогда 
			ДокументПоступления = Документы.ЗаходАкция10.СоздатьДокумент(); 
  			ДокументПоступления.Дата = ТекущаяДатаСеанса();
  			ДокументПоступления.СозданЗапросам = Истина; 
  			ДокументПоступления.Записать();
  			СсылкаДокументПоступления = ДокументПоступления.Ссылка;  
		Иначе 
			СсылкаДокументПоступления = Выборка01.Ссылка;
		КонецЕсли; 

	Иначе 
		ДокументПоступления = Документы.ЗаходАкция10.СоздатьДокумент(); 
  		ДокументПоступления.Дата = ТекущаяДатаСеанса();
  		ДокументПоступления.СозданЗапросам = Истина; 
  		ДокументПоступления.Записать();
  		СсылкаДокументПоступления = ДокументПоступления.Ссылка;  
	КонецЕсли; 

	//===================================================================================================================	

	Запрос2 = Новый Запрос;
	Запрос2.Текст =
		"ВЫБРАТЬ
		|	РегистрНакопления1Остатки.Товар КАК Номенклатура,
		|	РегистрНакопления1Остатки.индкод КАК Партия,
		|	РегистрНакопления1Остатки.Склад КАК Склад,
		|	РегистрНакопления1Остатки.машина КАК Машина,
		|	Номенклатура.РекомендованаяЦена КАК ЦенаРек,
		|	1 КАК Количество
		|ИЗ
		|	РегистрНакопления.РегистрНакопления1.Остатки(&Дата, индкод = &индкод) КАК РегистрНакопления1Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО РегистрНакопления1Остатки.Товар = Номенклатура.Ссылка
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток > 0";
	
	Запрос2.УстановитьПараметр("индкод", СсылкаАйдиТовара);
	Запрос2.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос2.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка =  РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ОбъектДокументПоступления = СсылкаДокументПоступления.ПолучитьОбъект(); 
			НоваяСтрока = ОбъектДокументПоступления.Товары.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			ОбъектДокументПоступления.Записать(РежимЗаписиДокумента.Проведение);
			
			СтруктураТоваров = Новый Структура;
			СтруктураТоваров.Вставить("message","Товар добавлен в акцию");
			Ответ = Новый HTTPСервисОтвет(201); 
			Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
			Возврат Ответ; 
		Иначе 
			СтруктураТоваров = Новый Структура;
			СтруктураТоваров.Вставить("error","1164");
			Ответ = Новый HTTPСервисОтвет(404); 
			Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
			Возврат Ответ; 
		КонецЕсли; 

КонецФункции

Функция УдалитьТоварИзАкции(АйдиТовара) ЭКСПОРТ
	
	ДокументСписания		= Документы.ВыходТоваровИзАкции10.ПустаяСсылка(); 
	НомерДокументСписания	= ""; 
	СсылкаАйдиТовара = Справочники.ИндКод.НайтиПоНаименованию(АйдиТовара); 
	//==================================================================================================================
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	РегистрАкция10Остатки.индкод.Наименование,
		|	РегистрАкция10Остатки.КолвоОстаток
		|ИЗ
		|	РегистрНакопления.РегистрАкция10.Остатки(, индкод = &индкод) КАК РегистрАкция10Остатки";
	
	Запрос.УстановитьПараметр("индкод", СсылкаАйдиТовара);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	Если  РезультатЗапроса.Пустой() Тогда 
			СтруктураТоваров = Новый Структура;
			СтруктураТоваров.Вставить("message","Товар удален из акции");
			Ответ = Новый HTTPСервисОтвет(200); 
			Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
			Возврат Ответ;
	КонецЕсли; 
	
	//====================================================================================================================		
	Запрос01 = Новый Запрос;
	Запрос01.Текст =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ВыходТоваровИзАкции10.Номер КАК Номер,
		|	ВыходТоваровИзАкции10.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ВыходТоваровИзАкции10 КАК ВыходТоваровИзАкции10
		|ГДЕ
		|	ВыходТоваровИзАкции10.СозданЗапросам = ИСТИНА
		|	И ВыходТоваровИзАкции10.ПометкаУдаления = ЛОЖЬ
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номер УБЫВ";

	РезультатЗапроса01 = Запрос01.Выполнить();
	
	Если НЕ РезультатЗапроса01.Пустой() Тогда 
		
		Выборка01 = РезультатЗапроса01.Выбрать();
		Выборка01.Следующий();
		НомерДокументСписания = Выборка01.Номер; 
		СсылкаДокументСписания = Выборка01.Ссылка;
		
		Запрос02 = Новый Запрос;
		Запрос02.Текст =
			"ВЫБРАТЬ
			|	ВыходТоваровИзАкции10.Ссылка КАК Ссылка
			|ИЗ
			|	Документ.ВыходТоваровИзАкции10 КАК ВыходТоваровИзАкции10
			|ГДЕ
			|	ВыходТоваровИзАкции10.Ссылка.Номер = &Номер
			|	И ВыходТоваровИзАкции10.Ссылка.ПометкаУдаления = ЛОЖЬ";
		
		Запрос02.УстановитьПараметр("Номер", НомерДокументСписания);
		РезультатЗапроса02 = Запрос02.Выполнить();
		Выборка02 = РезультатЗапроса02.Выбрать();
		Выборка02.Следующий();
		
		Если  НЕ РезультатЗапроса02.Пустой() Тогда 
			ДокументСписания = Документы.ВыходТоваровИзАкции10.СоздатьДокумент(); 
  			ДокументСписания.Дата = ТекущаяДатаСеанса();
  			ДокументСписания.СозданЗапросам = Истина; 
  			ДокументСписания.Записать();
  			СсылкаДокументСписания = ДокументСписания.Ссылка;  
		Иначе 
			СсылкаДокументСписания = Выборка01.Ссылка;
		КонецЕсли; 

	Иначе 
		ДокументСписания = Документы.ВыходТоваровИзАкции10.СоздатьДокумент(); 
  		ДокументСписания.Дата = ТекущаяДатаСеанса();
  		ДокументСписания.СозданЗапросам = Истина; 
  		ДокументСписания.Записать();
  		СсылкаДокументСписания = ДокументСписания.Ссылка;  
	КонецЕсли; 

	//===================================================================================================================	

	Запрос2 = Новый Запрос;
	Запрос2.Текст =
		"ВЫБРАТЬ
		|	РегистрНакопления1Остатки.Товар КАК Номенклатура,
		|	РегистрНакопления1Остатки.индкод КАК Партия,
		|	РегистрНакопления1Остатки.Склад КАК Склад,
		|	РегистрНакопления1Остатки.машина КАК Машина,
		|	Номенклатура.РекомендованаяЦена КАК ЦенаРек,
		|	1 КАК Количество
		|ИЗ
		|	РегистрНакопления.РегистрНакопления1.Остатки(&Дата, индкод = &индкод) КАК РегистрНакопления1Остатки
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура
		|		ПО РегистрНакопления1Остатки.Товар = Номенклатура.Ссылка
		|ГДЕ
		|	РегистрНакопления1Остатки.КолвоОстаток > 0";
	
	Запрос2.УстановитьПараметр("индкод", СсылкаАйдиТовара);
	Запрос2.УстановитьПараметр("Дата", ТекущаяДатаСеанса());
	РезультатЗапроса = Запрос2.Выполнить();
		
		Если НЕ РезультатЗапроса.Пустой() Тогда
			Выборка =  РезультатЗапроса.Выбрать();
			Выборка.Следующий();
			
			ОбъектДокументСписания = СсылкаДокументСписания.ПолучитьОбъект(); 
			НоваяСтрока = ОбъектДокументСписания.Товары.Добавить(); 
			ЗаполнитьЗначенияСвойств(НоваяСтрока,Выборка);
			ОбъектДокументСписания.Записать(РежимЗаписиДокумента.Проведение);
			
			СтруктураТоваров = Новый Структура;
			СтруктураТоваров.Вставить("message","Товар удален из акции");
			Ответ = Новый HTTPСервисОтвет(201); 
			Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
			Возврат Ответ; 
		Иначе 
			СтруктураТоваров = Новый Структура;
			СтруктураТоваров.Вставить("error","1164");
			Ответ = Новый HTTPСервисОтвет(404); 
			Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
			ЗаписьJSON = Новый ЗаписьJSON;
			ЗаписьJSON.УстановитьСтроку();
			ЗаписатьJSON(ЗаписьJSON, СтруктураТоваров);
			СтрокаДляОтвета = ЗаписьJSON.Закрыть();
			Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета);
			Возврат Ответ; 
		КонецЕсли; 

КонецФункции






