Функция УчаствуетВАкции10(Партия = Неопределено,ПартияНаименование = Неопределено)
	
	Если Партия <> Неопределено Тогда 
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	РегистрАкция10Остатки.индкод
			|ИЗ
			|	РегистрНакопления.РегистрАкция10.Остатки(, индкод = &индкод) КАК РегистрАкция10Остатки";
		
		Запрос.УстановитьПараметр("индкод", Партия);
		
		РезультатЗапроса = Запрос.Выполнить();
		Если НЕ РезультатЗапроса.Пустой() Тогда 
			Возврат Истина;
		Иначе 
			Возврат Ложь;  
		КонецЕсли; 
	КонецЕсли;
	
	Если ПартияНаименование <> Неопределено Тогда 
			Запрос = Новый Запрос;
			Запрос.Текст =
				"ВЫБРАТЬ
				|	РегистрАкция10Остатки.индкод
				|ИЗ
				|	РегистрНакопления.РегистрАкция10.Остатки(, индкод.Наименование = &индкод) КАК РегистрАкция10Остатки";
			
			Запрос.УстановитьПараметр("индкод", ПартияНаименование);
			
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() Тогда 
				Возврат Истина;
			Иначе 
				Возврат Ложь;  
			КонецЕсли; 
	КонецЕсли; 
	
КонецФункции