
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
//======================================================================================================================

Движения.РегистрАкция10.Записывать = Истина;
Движения.Записать();
Движения.РегистрАкция10.Записывать = Истина;

Счетчик = 0; 
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ЗаходАкция10Товары.Номенклатура,
	|	ЗаходАкция10Товары.Партия,
	|	ЗаходАкция10Товары.Количество,
	|	ЗаходАкция10Товары.ЦенаАкция,
	|	ЗаходАкция10Товары.Склад,
	|	ЗаходАкция10Товары.Машина,
	|	ЗаходАкция10Товары.ЦенаРек
	|ПОМЕСТИТЬ ВТ_Заход
	|ИЗ
	|	Документ.ЗаходАкция10.Товары КАК ЗаходАкция10Товары
	|ГДЕ
	|	ЗаходАкция10Товары.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РегистрНакопления1Остатки.КолвоОстаток,
	|	ВТ_Заход.Номенклатура,
	|	ВТ_Заход.Партия,
	|	ВТ_Заход.Количество,
	|	ВТ_Заход.ЦенаАкция,
	|	ВТ_Заход.Склад,
	|	ВТ_Заход.Машина,
	|	ВТ_Заход.ЦенаРек
	|ИЗ
	|	ВТ_Заход КАК ВТ_Заход
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки(&Период, индкод В
	|			(ВЫБРАТЬ
	|				Т.Партия
	|			ИЗ
	|				ВТ_Заход КАК Т)) КАК РегистрНакопления1Остатки
	|		ПО ВТ_Заход.Партия = РегистрНакопления1Остатки.индкод";

Запрос.УстановитьПараметр("Ссылка", Ссылка);
Запрос.УстановитьПараметр("Период", ТекущаяДатаСеанса());

РезультатЗапроса = Запрос.Выполнить();
ВыборкаТовары = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			 Дефицит = ВыборкаТовары.Количество - ВыборкаТовары.КолвоОстаток;
	       
			Если Дефицит>0 Тогда
	            Отказ = Истина;
	            Сообщение = Новый СообщениеПользователю;
	            Сообщение.Текст = "Номенклатура: "+ВыборкаТовары.Номенклатура + " Партия: " + ВыборкаТовары.Партия + " недостаточно в количестве "+Дефицит+" шт.";
	            Сообщение.Сообщить();
	        КонецЕсли;
	       
	        //  Переход в начало цикла, если были ошибки
	        Если Отказ Тогда
	            Продолжить;
	        КонецЕсли;
	       
	        //  Выполнение движений в регистры
	
				Движение			 = Движения.РегистрАкция10.ДобавитьПриход();
				Движение.Период		 = ТекущаяДатаСеанса();
				Движение.Товар		 = ВыборкаТовары.Номенклатура;
				Движение.индкод		 = ВыборкаТовары.Партия;
				Движение.Склад		 = ВыборкаТовары.Склад;
				Движение.машина		 = ВыборкаТовары.машина;
				Движение.Колво		 = ВыборкаТовары.Количество;
				Движение.Цена		 = ВыборкаТовары.ЦенаАкция; 
				Движение.ЦенаРек	 = ВыборкаТовары.ЦенаРек;
				
				Счетчик 			 = Счетчик + 1; 
	    КонецЦикла;

	Сообщение = Новый СообщениеПользователю();
	Сообщение.Текст = "Успех, в акции участвует: "+Счетчик+" ед. товаров."; 
	Сообщение.Сообщить();

//======================================================================================================================
КонецПроцедуры

