
Функция ПолучитьСтатистикуКладовщиковgetstoragestat(Запрос)
	
	//Сергеев Ф.В. ++ Дата: 30.09.2024
	ЗапросСтаты = Новый Запрос;
	ЗапросСтаты.Текст = "ВЫБРАТЬ
	|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура.Ссылка) КАК Ссылка,
	|	Номенклатура.КтоСоздал КАК КтоСоздал
	|ПОМЕСТИТЬ ВТ_Карточки
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|ГДЕ
	|	Номенклатура.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	Номенклатура.КтоСоздал
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Рас_КомплектовкаНоменклатураСписок.Количество) КАК Количество,
	|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Ответственный.Пользователь КАК Ответственный
	|ПОМЕСТИТЬ Комплектовка
	|ИЗ
	|	Документ.Рас_Комплектовка.НоменклатураСписок КАК Рас_КомплектовкаНоменклатураСписок
	|ГДЕ
	|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Ответственный.Пользователь
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(ПоступлениеЗапчастейТаблица.Колво) КАК Колво,
	|	СУММА(ПоступлениеЗапчастейТаблица.Товар.РекомендованаяЦена) КАК ТоварРекомендованаяЦена,
	|	СРЕДНЕЕ(ПоступлениеЗапчастейТаблица.Товар.РекомендованаяЦена) КАК СрЦена,
	|	ПоступлениеЗапчастейТаблица.Ссылка.Ответственный КАК Ответственный
	|ПОМЕСТИТЬ ВТ_Номеклатура
	|ИЗ
	|	Документ.ПоступлениеЗапчастей.Таблица КАК ПоступлениеЗапчастейТаблица
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ПоступлениеЗапчастейТаблица.ДатаДобавления, ДЕНЬ) МЕЖДУ &ДатаНачала И &ДатаОкончания
	|СГРУППИРОВАТЬ ПО
	|	ПоступлениеЗапчастейТаблица.Ссылка.Ответственный
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТ_Карточки.Ссылка КАК Карточки,
	|	Комплектовка.Количество КАК Комплектовка,
	|	ВТ_Номеклатура.Колво КАК Поступления,
	|	ВТ_Номеклатура.ТоварРекомендованаяЦена КАК Цена,
	|	ВТ_Номеклатура.ТоварРекомендованаяЦена / ВТ_Номеклатура.Колво КАК СрЦена,
	|	ВТ_Номеклатура.Ответственный КАК Ответственный
	|ИЗ
	|	ВТ_Номеклатура КАК ВТ_Номеклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Карточки КАК ВТ_Карточки
	|		ПО ВТ_Номеклатура.Ответственный = ВТ_Карточки.КтоСоздал
	|		ЛЕВОЕ СОЕДИНЕНИЕ Комплектовка КАК Комплектовка
	|		ПО ВТ_Номеклатура.Ответственный = Комплектовка.Ответственный";
	
	
	
	//Сергеев Ф.В. -- Дата: 30.09.2024
КонецФункции
