#Область СлужебныеПроцедурыИФункции

Функция ПосчитатьПрибыль(Данные) // Принимает таблицу значений, Возвращает структуру занчний
	// +++ Комлев  01/10/24 +++
	ПродажиПриход = Число(Данные.Найти("Продажи Приход").Сумма);
	ВосстановленияПриход = Число(Данные.Найти("Восстановления Приход").Сумма);
	КредитыПриход = Число(Данные.Найти("Кредиты Приход").Сумма);
	ВозвратЗаемныхСредствРасход = Число(Данные.Найти("Возврат заемных средств Расход").Сумма);
	ЗПРасход = Число(Данные.Найти("ЗП Расход").Сумма);
	КапитальныеЗатратыРасход = Число(Данные.Найти("Капитальные затраты Расход").Сумма);
	ЛичныеВыводыРасход = Число(Данные.Найти("Личные выводы Расход").Сумма);
	ОплатаПоставщикамРасход = Число(Данные.Найти("Оплата поставщикам Расход").Сумма);
	ПрочиеРасход = Число(Данные.Найти("Прочие Расход").Сумма);
	ТекущиеРасходы = Число(Данные.Найти("Текущие расходы Расход").Сумма);
	Прибыль = (ПродажиПриход + ВосстановленияПриход + КредитыПриход) - (ВозвратЗаемныхСредствРасход + ЗПРасход
		+ КапитальныеЗатратыРасход + ЛичныеВыводыРасход + ОплатаПоставщикамРасход + ПрочиеРасход + ТекущиеРасходы);

	СтруктураПерем = Новый Структура;
	СтруктураПерем.Вставить("ПродажиПриход", ПродажиПриход);
	СтруктураПерем.Вставить("ВосстановленияПриход", ВосстановленияПриход);
	СтруктураПерем.Вставить("КредитыПриход", КредитыПриход);
	СтруктураПерем.Вставить("ВозвратЗаемныхСредствРасход", ВозвратЗаемныхСредствРасход);
	СтруктураПерем.Вставить("ЗПРасход", ЗПРасход);
	СтруктураПерем.Вставить("КапитальныеЗатратыРасход", КапитальныеЗатратыРасход);
	СтруктураПерем.Вставить("ЛичныеВыводыРасход", ЛичныеВыводыРасход);
	СтруктураПерем.Вставить("ОплатаПоставщикамРасход", ОплатаПоставщикамРасход);
	СтруктураПерем.Вставить("ПрочиеРасход", ПрочиеРасход);
	СтруктураПерем.Вставить("ТекущиеРасходы", ТекущиеРасходы);
	СтруктураПерем.Вставить("Прибыль", Прибыль);

	Возврат СтруктураПерем;
	// --- Комлев  01/10/24 ---
КонецФункции
#КонецОбласти
Функция ВыручкаПоКатегориямGET(Запрос)
	// +++ Комлев  01/10/24 +++
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	""Продажи Приход"" КАК Движения,
		|	ЕСТЬNULL(СУММА(ПриходДенегНаСчет.СуммаДокумента), 0) КАК Сумма
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И ПриходДенегНаСчет.Сделка ССЫЛКА Документ.ПродажаЗапчастей
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Восстановления Приход"",
		|	ЕСТЬNULL(СУММА(ПриходДенегНаСчет.СуммаДокумента), 0)
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И НЕ ПриходДенегНаСчет.Сделка ССЫЛКА Документ.ПродажаЗапчастей
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Кредиты Приход"",
		|	ЕСТЬNULL(СУММА(ПриходОтКредитов.Сумма), 0)
		|ИЗ
		|	Документ.ПриходОтКредитов КАК ПриходОтКредитов
		|ГДЕ
		|	ПриходОтКредитов.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|
		|Объединить
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	""ЗП Расход"" КАК Расход,
		|	ЕСТЬNULL(СУММА(Расходы.Сумма), 0) КАК Сумма
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Расходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.Зарплата)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Оплата поставщикам Расход"",
		|	ЕСТЬNULL(СУММА(Расходы.Сумма), 0)
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Расходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ОплатаПоставщикуЗапчастей)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Текущие расходы Расход"",
		|	ЕСТЬNULL(СУММА(Расходы.Сумма), 0)
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Расходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ТекущиеРасходы)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Капитальные затраты Расход"",
		|	ЕСТЬNULL(СУММА(Расходы.Сумма), 0)
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Расходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.КапитальныеЗатраты)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Возврат заемных средств Расход"",
		|	ЕСТЬNULL(СУММА(Расходы.Сумма), 0)
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И Расходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратЗаёмныхСредств)
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Прочие Расход"",
		|	ЕСТЬNULL(СУММА(Расходы.Сумма), 0)
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
		|	И (Расходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ДополнительныеТраты)
		|	ИЛИ Расходы.ВидОперации = ЗНАЧЕНИЕ(Перечисление.ВидыОперацийСписаниеДенежныхСредств.ВозвратПокупателю))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ
		|	""Личные выводы Расход"",
		|	ЕСТЬNULL(СУММА(ЛичныйВывод.Сумма), 0)
		|ИЗ
		|	Документ.ЛичныйВывод КАК ЛичныйВывод
		|ГДЕ
		|	ЛичныйВывод.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания";

		Запрос.УстановитьПараметр("ДатаНачала", НачалоДня(ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецДня(ТекущаяДата()));
		ДанныеДень = Запрос.Выполнить().Выгрузить();

		Запрос.УстановитьПараметр("ДатаНачала", НачалоНедели(ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецНедели(ТекущаяДата()));
		ДанныеНеделя = Запрос.Выполнить().Выгрузить();

		Запрос.УстановитьПараметр("ДатаНачала", НачалоМесяца(ТекущаяДата()));
		Запрос.УстановитьПараметр("ДатаОкончания", КонецМесяца(ТекущаяДата()));
		ДанныеМесяц = Запрос.Выполнить().Выгрузить();
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		СтруктураПерем = ПосчитатьПрибыль(ДанныеДень);
		СтруктураДень = Новый Структура;
		СтруктураДень.Вставить("sales_coming_day", СтруктураПерем.ПродажиПриход);
		СтруктураДень.Вставить("repair_coming_day", СтруктураПерем.ВосстановленияПриход);
		СтруктураДень.Вставить("credit_coming_day", СтруктураПерем.КредитыПриход);
		СтруктураДень.Вставить("credit_expense_day", СтруктураПерем.ВозвратЗаемныхСредствРасход);
		СтруктураДень.Вставить("salary_expense_day", СтруктураПерем.ЗПРасход);
		СтруктураДень.Вставить("capital_expense_day", СтруктураПерем.КапитальныеЗатратыРасход);
		СтруктураДень.Вставить("personal_expense_day", СтруктураПерем.ЛичныеВыводыРасход);
		СтруктураДень.Вставить("supplier_expense_day", СтруктураПерем.ОплатаПоставщикамРасход);
		СтруктураДень.Вставить("other_expense_day", СтруктураПерем.ПрочиеРасход);
		СтруктураДень.Вставить("current_expense_day", СтруктураПерем.ТекущиеРасходы);
		СтруктураДень.Вставить("profit_day", СтруктураПерем.Прибыль);


///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////

		СтруктураПерем = ПосчитатьПрибыль(ДанныеНеделя);
		СтруктураНеделя = Новый Структура;
		СтруктураНеделя.Вставить("sales_coming_week", СтруктураПерем.ПродажиПриход);
		СтруктураНеделя.Вставить("repair_coming_week", СтруктураПерем.ВосстановленияПриход);
		СтруктураНеделя.Вставить("credit_coming_week", СтруктураПерем.КредитыПриход);
		СтруктураНеделя.Вставить("credit_expense_week", СтруктураПерем.ВозвратЗаемныхСредствРасход);
		СтруктураНеделя.Вставить("salary_expense_week", СтруктураПерем.ЗПРасход);
		СтруктураНеделя.Вставить("capital_expense_week", СтруктураПерем.КапитальныеЗатратыРасход);
		СтруктураНеделя.Вставить("personal_expense_week", СтруктураПерем.ЛичныеВыводыРасход);
		СтруктураНеделя.Вставить("supplier_expense_week", СтруктураПерем.ОплатаПоставщикамРасход);
		СтруктураНеделя.Вставить("other_expense_week", СтруктураПерем.ПрочиеРасход);
		СтруктураНеделя.Вставить("current_expense_week", СтруктураПерем.ТекущиеРасходы);
		СтруктураНеделя.Вставить("profit_week", СтруктураПерем.Прибыль);
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////	

		СтруктураПерем = ПосчитатьПрибыль(ДанныеМесяц);
		СтруктураМесяц = Новый Структура;
		СтруктураМесяц.Вставить("sales_coming_month", СтруктураПерем.ПродажиПриход);
		СтруктураМесяц.Вставить("repair_coming_month", СтруктураПерем.ВосстановленияПриход);
		СтруктураМесяц.Вставить("credit_coming_month", СтруктураПерем.КредитыПриход);
		СтруктураМесяц.Вставить("credit_expense_month", СтруктураПерем.ВозвратЗаемныхСредствРасход);
		СтруктураМесяц.Вставить("salary_expense_month", СтруктураПерем.ЗПРасход);
		СтруктураМесяц.Вставить("capital_expense_month", СтруктураПерем.КапитальныеЗатратыРасход);
		СтруктураМесяц.Вставить("personal_expense_month", СтруктураПерем.ЛичныеВыводыРасход);
		СтруктураМесяц.Вставить("supplier_expense_month", СтруктураПерем.ОплатаПоставщикамРасход);
		СтруктураМесяц.Вставить("other_expense_month", СтруктураПерем.ПрочиеРасход);
		СтруктураМесяц.Вставить("current_expense_month", СтруктураПерем.ТекущиеРасходы);
		СтруктураМесяц.Вставить("profit_month", СтруктураПерем.Прибыль);
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////		

		Данные = Новый Структура;
		Данные.Вставить("data_day", СтруктураДень);
		Данные.Вставить("data_week", СтруктураНеделя);
		Данные.Вставить("data_month", СтруктураМесяц);
		Ответ = Новый HTTPСервисОтвет(200);
		Запись = Новый ЗаписьJSON;
		Запись.УстановитьСтроку();
		ЗаписатьJSON(Запись, Данные);
		СтрокаОтвета = Запись.Закрыть();
		Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Возврат Ответ;
	Исключение
		Ответ = Новый HTTPСервисОтвет(500);
		Инфо = ИнформацияОбОшибке();
		СтрокаОтвета = Инфо.Описание + " " + ?(Инфо.Причина <> Неопределено, Инфо.Причина.Описание, "!");
		Ответ.УстановитьТелоИзСтроки(СтрокаОтвета);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Возврат Ответ;
	КонецПопытки;
	// --- Комлев  01/10/24 ---
КонецФункции