#Область ОбработчикиСобытий
Функция ПолучитьСтатистикуКладовщиковgetstoragestat(Запрос)
	
	//Сергеев Ф.В. ++ Дата: 30.09.2024
	ЗапросСтаты = Новый Запрос;
	ЗапросСтаты.Текст = "ВЫБРАТЬ
						|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ Номенклатура.Ссылка) КАК Ссылка,
						|	Номенклатура.КтоСоздал КАК КтоСоздал
						|ПОМЕСТИТЬ ВТ_Карточки
						|ИЗ
						|	Справочник.Номенклатура КАК Номенклатура
						|ГДЕ
						|	Номенклатура.ДатаСоздания МЕЖДУ &ДатаНачала И &ДатаОкончания
						|СГРУППИРОВАТЬ ПО
						|	Номенклатура.КтоСоздал
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	СУММА(Рас_КомплектовкаНоменклатураСписок.Количество) КАК Количество,
						|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Ответственный.Пользователь КАК Ответственный
						|ПОМЕСТИТЬ Комплектовка
						|ИЗ
						|	Документ.Рас_Комплектовка.НоменклатураСписок КАК Рас_КомплектовкаНоменклатураСписок
						|ГДЕ
						|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
						|СГРУППИРОВАТЬ ПО
						|	Рас_КомплектовкаНоменклатураСписок.Ссылка.Ответственный.Пользователь
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	СУММА(ПоступлениеЗапчастейТаблица.Колво) КАК Колво,
						|	СУММА(ПоступлениеЗапчастейТаблица.Товар.РекомендованаяЦена) КАК ТоварРекомендованаяЦена,
						|	СРЕДНЕЕ(ПоступлениеЗапчастейТаблица.Товар.РекомендованаяЦена) КАК СрЦена,
						|	ПоступлениеЗапчастейТаблица.Ссылка.Ответственный КАК Ответственный
						|ПОМЕСТИТЬ ВТ_Номеклатура
						|ИЗ
						|	Документ.ПоступлениеЗапчастей.Таблица КАК ПоступлениеЗапчастейТаблица
						|ГДЕ
						|	НАЧАЛОПЕРИОДА(ПоступлениеЗапчастейТаблица.ДатаДобавления, ДЕНЬ) МЕЖДУ &ДатаНачала И &ДатаОкончания
						|СГРУППИРОВАТЬ ПО
						|	ПоступлениеЗапчастейТаблица.Ссылка.Ответственный
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ВТ_Карточки.Ссылка КАК Карточки,
						|	Комплектовка.Количество КАК Комплектовка,
						|	ВТ_Номеклатура.Колво КАК Поступления,
						|	ВТ_Номеклатура.ТоварРекомендованаяЦена КАК Цена,
						|	ВТ_Номеклатура.ТоварРекомендованаяЦена / ВТ_Номеклатура.Колво КАК СрЦена,
						|	ВТ_Номеклатура.Ответственный КАК Ответственный
						|ИЗ
						|	ВТ_Номеклатура КАК ВТ_Номеклатура
						|		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Карточки КАК ВТ_Карточки
						|		ПО ВТ_Номеклатура.Ответственный = ВТ_Карточки.КтоСоздал
						|		ЛЕВОЕ СОЕДИНЕНИЕ Комплектовка КАК Комплектовка
						|		ПО ВТ_Номеклатура.Ответственный = Комплектовка.Ответственный";
	
	
	
	//Сергеев Ф.В. -- Дата: 30.09.2024
КонецФункции

Функция ПолучитьСтатистикуРекламыGetMarketingStat(Запрос)
//Сергеев Ф.В. ++ Дата: 30.09.2024
	//НачалоОтбора = НачалоДня(Дата(Запрос.ПараметрыURL["datestart"]));
	НачалоОтбора = НачалоДня(Дата("20240201"));
//	КонецОтбора  = КонецДня(Дата(Запрос.ПараметрыURL["dateend"]));
	КонецОтбора  = КонецДня(Дата("20240229"));
	МассивОтвета = Новый Массив;

	ЗапросСтаты  = Новый Запрос;
	ЗапросСтаты.Текст = "ВЫБРАТЬ
						|	Представление(ЗаказКлиента.Ответственный) КАК Ответственный,
						|	Представление(Сотрудники.МестоРаботы) КАК МестоРаботы,
						|	ЗаказКлиента.СуммаДокумента КАК СуммаДокумента,
						|	Представление(ЗаказКлиента.Канал) КАК Канал
						|ИЗ
						|	Документ.ЗаказКлиента КАК ЗаказКлиента
						|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Сотрудники КАК Сотрудники
						|		ПО (ЗаказКлиента.Ответственный = Сотрудники.Пользователь)
						|ГДЕ
						|	Сотрудники.МестоРаботы <> ЗНАЧЕНИЕ(справочник.МестоРаботы.ПустаяСсылка)
						|	И ЗаказКлиента.Ответственный <> ЗНАЧЕНИЕ(справочник.пользователи.ПустаяСсылка)
						|	И ЗаказКлиента.Дата МЕЖДУ &ДатаНачала И &ДатаОкончания
						|ИТОГИ
						|	СУММА(СуммаДокумента)
						|ПО
						|	ОБЩИЕ,
						|	МестоРаботы,
						|	Ответственный,
						|	Канал";

	ЗапросСтаты.УстановитьПараметр("ДатаНачала", НачалоОтбора);
	ЗапросСтаты.УстановитьПараметр("ДатаОкончания", КонецОтбора);

	РезультатЗапроса = ЗапросСтаты.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "МестоРаботы");
	
	//МассивБонусовПоПродажам = Новый Массив;
	Пока РезультатЗапроса.Следующий() Цикл
		МассивОтветственных = Новый Массив;
		СтруктураСборки = Новый Структура;
		СтруктураСборки.Вставить("МестоРаботы", Строка(РезультатЗапроса.МестоРаботы));
		СтруктураСборки.Вставить("СуммаПоГороду", РезультатЗапроса.СуммаДокумента);

		РезультатЗапроса2 = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Ответственный");
		Пока РезультатЗапроса2.Следующий() Цикл
			МассивКаналов = Новый Массив;
			СтруктураОтветственного = Новый Структура;
			СтруктураОтветственного.Вставить("Ответственный", Строка(РезультатЗапроса2.Ответственный));
			СтруктураОтветственного.Вставить("СуммаПоОтветственному", РезультатЗапроса2.СуммаДокумента);
			РезультатЗапроса3 = РезультатЗапроса2.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам, "Канал");
			Пока РезультатЗапроса3.Следующий() Цикл
				СтруктураКаналов = Новый Структура;
				СтруктураКаналов.Вставить("Канал", Строка(РезультатЗапроса3.Канал));
				СтруктураКаналов.Вставить("СуммаПоКаналу", РезультатЗапроса3.СуммаДокумента);
				МассивКаналов.Добавить(СтруктураКаналов);
			КонецЦикла;
			СтруктураОтветственного.Вставить("Каналы", МассивКаналов);
			МассивОтветственных.Добавить(СтруктураОтветственного);
		КонецЦикла;
		СтруктураСборки.Вставить("Ответственные", МассивОтветственных);
		МассивОтвета.Добавить(СтруктураСборки);
	КонецЦикла;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, МассивОтвета);

	СтрокаДляОтвета = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Возврат Ответ;
	//Сергеев Ф.В. -- Дата: 30.09.2024
КонецФункции

Функция ПолучитьСтатистикуКадровgetstatisticpersonnel(Запрос)
	
	///+ТатарМА 30.09.2024
	ЗапросАналитикаКадров = Новый Запрос;
	
	ЗапросАналитикаКадров.Текст = "ВЫБРАТЬ
	|	АналитикаВакансий.Вакансия КАК Вакансия,
	|	АналитикаВакансий.ДатаСоздания КАК ДатаСоздания,
	|	АналитикаВакансий.Ответственный КАК Ответственный,
	|	АналитикаВакансий.ДатаЗакрытия КАК ДатаЗакрытия,
	|	АналитикаВакансий.КадровыйПриказ КАК КадровыйПриказ,
	|	АналитикаВакансий.Сотрудник КАК Сотрудник,
	|	АналитикаВакансий.ПериодПоиска КАК ПериодПоиска,
	|	АналитикаВакансий.Увольнение КАК Увольнения,
	|	АналитикаВакансий.ДатаУвольнения КАК ДатаУвольнения,
	|	АналитикаВакансий.ПериодРаботы КАК ПериодРаботы
	|ИЗ
	|	РегистрСведений.АналитикаВакансий КАК АналитикаВакансий";
		
	Выборка = ЗапросАналитикаКадров.Выполнить().Выбрать();

	МассивКадров = Новый Массив;
	Пока Выборка.Следующий() Цикл
		СтруктураИнфо = Новый Структура;
		СтруктураИнфо.Вставить("vacancy", 			Строка(выборка.Вакансия));
		СтруктураИнфо.Вставить("date_creation", 	Строка(выборка.ДатаСоздания));
		СтруктураИнфо.Вставить("responsible", 		Строка(выборка.Ответственный));
		СтруктураИнфо.Вставить("date_closing", 		Строка(выборка.ДатаЗакрытия));
		СтруктураИнфо.Вставить("personnel_order", 	Строка(Выборка.КадровыйПриказ));
		СтруктураИнфо.Вставить("employee", 			Строка(выборка.Сотрудник));
		СтруктураИнфо.Вставить("search_period", 	Строка(выборка.ПериодПоиска));
		СтруктураИнфо.Вставить("dismissal", 		Строка(выборка.Увольнения));
		СтруктураИнфо.Вставить("date_dismissal", 	Строка(выборка.ДатаУвольнения));
		СтруктураИнфо.Вставить("period_work", 		Строка(выборка.ПериодРаботы));

		МассивКадров.Добавить(СтруктураИнфо);
	КонецЦикла;

	СтруктураОтвета = Новый Структура;

	СтруктураОтвета.Вставить("info", МассивКадров);
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();

	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвета);

	СтрокаДляОтвета = ЗаписьJSON.Закрыть();

	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");

	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);

	Возврат Ответ;
	///-ТатарМА 30.09.2024
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти