
&НаКлиенте
Процедура Поиск(Команда)
	// Вставить содержимое обработчика.
	Фильтр(Поиск);
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	// Вставить содержимое обработчика.
	Очищение();
КонецПроцедуры


&НаСервере
Функция Фильтр(Поиск) Экспорт
	RegExp = Новый COMОбъект("VBScript.RegExp");
         
	RegExp.IgnoreCase = Ложь; //Игнорировать регистр
	RegExp.Global = Истина; //Поиск всех вхождений шаблона
	RegExp.MultiLine = Истина; //Многострочный режим
			
	RegExp.Pattern = "\W";
	RegExp.Pattern = "[^a-zA-Zа-яА-Я_0-9]";
	стр1=RegExp.Replace( Поиск,"");
	Текст1 = "ВЫБРАТЬ
	| ПоступлениеЗапчастей.Ссылка,
	| ПоступлениеЗапчастей.ВерсияДанных,
	| ПоступлениеЗапчастей.ПометкаУдаления,
	| ПоступлениеЗапчастей.Номер,
	| ПоступлениеЗапчастей.Дата,
	| ПоступлениеЗапчастей.Проведен,
	| ПоступлениеЗапчастей.Машина,
	| ПоступлениеЗапчастей.Название,
	| ПоступлениеЗапчастей.Таблица.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Товар,
	| 	Колво,
	| 	Цена,
	| 	Место,
	| 	Комментарий,
	| 	Ответственный
	| )
| ИЗ
	| Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей"; 
	Текст1 = Текст1	+ " ГДЕ ПоступлениеЗапчастей.Таблица.Товар.Артикул ПОДОБНО """+Поиск+"""
		| ИЛИ ПоступлениеЗапчастей.Таблица.Товар.Наименование ПОДОБНО ""%"+Поиск+"%"" 
		| ИЛИ ПоступлениеЗапчастей.Таблица.Товар.АртикулПоиск ПОДОБНО """+стр1+"""
		| ИЛИ ПоступлениеЗапчастей.Таблица.Товар.Код ПОДОБНО ""%"+Поиск+"""
		| ИЛИ ПоступлениеЗапчастей.Таблица.Товар.НомерПроизводителя ПОДОБНО """+Поиск+"""
		| ИЛИ ПоступлениеЗапчастей.Таблица.Товар.НомерПоиск ПОДОБНО """+стр1+"""";
	Товар.ТекстЗапроса = Текст1;    
КонецФункции


&НаСервере
Функция Очищение() Экспорт
	Товар.ТекстЗапроса = "ВЫБРАТЬ
	| ПоступлениеЗапчастей.Ссылка,
	| ПоступлениеЗапчастей.ВерсияДанных,
	| ПоступлениеЗапчастей.ПометкаУдаления,
	| ПоступлениеЗапчастей.Номер,
	| ПоступлениеЗапчастей.Дата,
	| ПоступлениеЗапчастей.Проведен,
	| ПоступлениеЗапчастей.Машина,
	| ПоступлениеЗапчастей.Название,
	| ПоступлениеЗапчастей.Таблица.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Товар,
	| 	Колво,
	| 	Цена,
	| 	Место,
	| 	Комментарий,
	| 	Ответственный
	| )
| ИЗ
	| Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей";

КонецФункции


