



// Все  функции и процедуры без подписи делал МазинЕС 25.12.24

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Период.ДатаНачала = НачалоМесяца(ТекущаяДатаСеанса()); 
	Период.ДатаОкончания = КонецМесяца(ТекущаяДатаСеанса()); 
КонецПроцедуры

&НаКлиенте
Процедура ОбщаяСтраницаПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	
	Если ТекущаяСтраница = Элементы.ПродажаНН 			Тогда
		ОпределитьДанныеОтдела("000000133","000000542","000000481","000000003"); //(ОтделКод(Расход).ЗарплатаКод,ОтделКод(Доход), РегионКод)
		
	ИначеЕсли ТекущаяСтраница = Элементы.ПродажаМСК 	Тогда
		ОпределитьДанныеОтдела("000000123","000000544","000000479","000000002"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ПродажаЕКБ 	Тогда
		ОпределитьДанныеОтдела("000000121","000000473","000000478","000000004"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.РВРНН 			Тогда
		ОпределитьДанныеОтдела("000000128","000000552","000000482"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаНН 		Тогда
		ОпределитьДанныеОтдела("000000492","000000538","000000483"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаМСК 	Тогда
		ОпределитьДанныеОтдела("000000243","000000532","000000480");
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаЕКБ 	Тогда
		ОпределитьДанныеОтдела("000000417","000000892","000000893"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ВостановлениеЗапчастейНН Тогда
		ОпределитьДанныеОтдела("000000865","000000866","000000874"); 
		
	КонецЕсли; 
	
		
КонецПроцедуры

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	ТекущаяСтраница = Элементы.ОбщаяСтраница.ТекущаяСтраница;
	
	Если ТекущаяСтраница = Элементы.ПродажаНН 			Тогда
		ОпределитьДанныеОтдела("000000133","000000542","000000481","000000003"); //(ОтделКод(Расход).ЗарплатаКод,ОтделКод(Доход), РегионКод)
		
	ИначеЕсли ТекущаяСтраница = Элементы.ПродажаМСК 	Тогда
		ОпределитьДанныеОтдела("000000123","000000544","000000479","000000002"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ПродажаЕКБ 	Тогда
		ОпределитьДанныеОтдела("000000121","000000473","000000478","000000004"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.РВРНН 			Тогда
		ОпределитьДанныеОтдела("000000128","000000552","000000482"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаНН 		Тогда
		ОпределитьДанныеОтдела("000000492","000000538","000000483"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаМСК 	Тогда
		ОпределитьДанныеОтдела("000000243","000000532","000000480");
		
	ИначеЕсли ТекущаяСтраница = Элементы.ЗакупкаЕКБ 	Тогда
		ОпределитьДанныеОтдела("000000417","000000892","000000893"); 
		
	ИначеЕсли ТекущаяСтраница = Элементы.ВостановлениеЗапчастейНН Тогда
		ОпределитьДанныеОтдела("000000865","000000866","000000874"); 
		
	КонецЕсли; 

КонецПроцедуры



&наКлиенте
Функция ОпределитьДанныеОтдела(ОтделКод,ЗарплатаКод,ОтделКодДоход,РегионКод = Неопределено) 
	
	// +++ ФОТ
	ФОТОтдел = ФОТ(ОтделКод,ЗарплатаКод); 
	// --- ФОТ
	
	// +++ Расходы за аренду
	Структура = ОпределитьЗанимающуюПлощадьотделом(ОтделКод);
	
	Если Структура.ПлощадьЗанимаемая <> 0  И Структура.СтавкаМетр <> 0 И ЗначениеЗаполнено(Структура.ОбъектАренды) Тогда 
		ЗанимаемаяПлощадьОтделом 	= Структура.ПлощадьЗанимаемая;
		ОбъектАрендыСтрока 			= Структура.ОбъектАренды; 
		АрендаСтавка				= Структура.СтавкаМетр; 
		АрендаРасходОтдел 			= Структура.ПлощадьЗанимаемая * Структура.СтавкаМетр; 
	Иначе 
		ЗанимаемаяПлощадьОтделом 	= 0;
		АрендаСтавка				= 0; 
		АрендаРасходОтдел 			= 0; 
		ОбъектАрендыСтрока 			= ""; 
	КонецЕсли; 
	// --- Расходы за аренду
	
	// +++ Расходы на ТМЦ 
	ТМЦОтдел = ТМЦ(ОтделКод); 
	// --- Расходы на ТМЦ 
	
	// +++ Сумма проданных товаров без учета перекуп, новый , востановленный и без НДС
	СуммаВыданыхТоваров = СуммаТоваровДокПродажаЗап(Период.ДатаНачала,Период.ДатаОкончания,РегионКод); 
	// --- Сумма проданных товаров без учета перекуп, новый , востановленный и без НДС
	
	СебестоимостьТоваров = СуммаВыданыхТоваров * 0.47;  
	// +++ Расходы отдела (Фот,ТМЦ и др.)
	РасходыОтдела = РасходыОтделаФункция(Период.ДатаНачала,Период.ДатаОкончания,ОтделКод) + ТМЦОтдел + ФОТОтдел; 
	// --- Расходы отдела 
	
	//+++ Расходы остальных отделов (Все расходы которые не принадлежат этим 8 - ми отделам)
	РасходыОстальныхОтделов = РасходыОстальныхОтделов(Период.ДатаНачала,Период.ДатаОкончания);
	//--- Расходы остальных отделов (Все расходы которые не принадлежат этим 8 - ми отделам)
	
	// +++
																			
	// +++
	
	// +++ Выручка 
	Выручка = СуммаВыданыхТоваров - СебестоимостьТоваров  - РасходыОтдела - АрендаРасходОтдел; 
	// --- Выручка 
	
		
КонецФункции


Функция ФОТ(ОтделКод,ЗарплатаКод)

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И Расходы.Отдел.Код = &Отдел
		|	И Расходы.ВидыРасхода_3.Код = &ВидыРасхода_3";
	
	Запрос.УстановитьПараметр("Отдел", ОтделКод);
	Запрос.УстановитьПараметр("ВидыРасхода_3", ЗарплатаКод);
	
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Дата1", период.ДатаНачала);
	
	
	Сумма = 0; 	
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); 
	Сумма = Выборка.Сумма; 
	
	Возврат Сумма; 
	
	
КонецФункции

Функция ОпределитьЗанимающуюПлощадьотделом(ОтделКод)
	
	Структура = Новый Структура; 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АрендаПлощадьОтделаСрезПоследних.ИспользуемаяПлощадь КАК ИспользуемаяПлощадь
		|ИЗ
		|	РегистрСведений.АрендаПлощадьОтдела.СрезПоследних(&Дата, Отдел.Код = &ОтделКод) КАК АрендаПлощадьОтделаСрезПоследних";
	
	Запрос.УстановитьПараметр("ОтделКод", ОтделКод);
	Запрос.УстановитьПараметр("Дата", период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	ИспользуемаяПлощадь = 0; 
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл 
		ИспользуемаяПлощадь	= Выборка.ИспользуемаяПлощадь; 
		
	КонецЦикла;  
	
	Структура.Вставить("ПлощадьЗанимаемая",ИспользуемаяПлощадь); 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	АрендаСтавкаСрезПоследних.ОбщаяПлощадь КАК ОбщаяПлощадь,
		|	АрендаСтавкаСрезПоследних.СтавкаМетр КАК СтавкаМетр,
		|	АрендаСтавкаСрезПоследних.Объект КАК ОбъектАренды
		|ИЗ
		|	РегистрСведений.АрендаСтавка.СрезПоследних(&Дата,) КАК АрендаСтавкаСрезПоследних";
	
	Запрос.УстановитьПараметр("Дата", период.ДатаОкончания);
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СтавкаМетр = 0; 
	ОбъектАренд = ""; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СтавкаМетр = ВыборкаДетальныеЗаписи.СтавкаМетр; 
		ОбъектАренд = ВыборкаДетальныеЗаписи.ОбъектАренды; 
	КонецЦикла;
	
	Структура.Вставить("СтавкаМетр",СтавкаМетр);
	Структура.Вставить("ОбъектАренды",Строка(ОбъектАренд));
	
	Возврат Структура;  
		
КонецФункции

Функция ТМЦ(ОтделКод)


	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(БюджетТМЦОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.БюджетТМЦ.Остатки(, Отдел.Код = &Отдел) КАК БюджетТМЦОстатки
		|ГДЕ
		|	БюджетТМЦОстатки.ДатаРасхода МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)";
	
	Запрос.УстановитьПараметр("Дата2", Период.ДатаОкончания);
	Запрос.УстановитьПараметр("Отдел", ОтделКод);
	Запрос.УстановитьПараметр("Дата1", период.ДатаНачала);
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	СуммаОстаток = 0; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		СуммаОстаток = 	ВыборкаДетальныеЗаписи.СуммаОстаток; 
	КонецЦикла;
	
	Возврат СуммаОстаток; 
КонецФункции

&НаСервереБезКонтекста
Функция СуммаТоваровДокПродажаЗап(Дата1,Дата2,Регион) 
	// +++ Сумма выданных товаров  Без НДС  (Товар: Выдан,НЕотменен. Документ: Проведен) 
	// +++ Без учета перекупа и востановленных запчастей по документу ПродажаЗапчастей
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Сотрудники.Пользователь КАК Пользователь
		|ПОМЕСТИТЬ ВТ_Сотрудники
		|ИЗ
		|	Справочник.Сотрудники КАК Сотрудники
		|ГДЕ
		|	Сотрудники.МестоРаботы.Код = &МестоРаботы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПродажаЗапчастейТаблица.Партия КАК Партия,
		|	ПродажаЗапчастейТаблица.Сумма - ПродажаЗапчастейТаблица.СуммаНДС КАК СуммаБезНалога,
		|	ПродажаЗапчастейТаблица.Ссылка.КтоПродал КАК КтоПродал
		|ПОМЕСТИТЬ ВТ_ТоварыПродажа
		|ИЗ
		|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|ГДЕ
		|	ПродажаЗапчастейТаблица.Ссылка.Проведен = ИСТИНА
		|	И ПродажаЗапчастейТаблица.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПродажаЗапчастейТаблица.Ссылка.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И ПродажаЗапчастейТаблица.СтатусТовара = ИСТИНА
		|	И ПродажаЗапчастейТаблица.Отменено = ЛОЖЬ
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Рас_Комплектовка.Инкод КАК Инкод
		|ПОМЕСТИТЬ ВТ_ВостановленыеДетали
		|ИЗ
		|	Документ.Рас_Комплектовка КАК Рас_Комплектовка
		|ГДЕ
		|	Рас_Комплектовка.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И Рас_Комплектовка.ПометкаУдаления = ЛОЖЬ
		|	И Рас_Комплектовка.Проведен = ИСТИНА
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ПоступлениеЗапчастейТаблица.Партия КАК Партия
		|ПОМЕСТИТЬ ВТ_ПерекупНовыеДетали
		|ИЗ
		|	Документ.ПоступлениеЗапчастей.Таблица КАК ПоступлениеЗапчастейТаблица
		|ГДЕ
		|	ПоступлениеЗапчастейТаблица.Ссылка.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И ПоступлениеЗапчастейТаблица.Ссылка.ПометкаУдаления = ЛОЖЬ
		|	И ПоступлениеЗапчастейТаблица.Ссылка.Проведен = ИСТИНА
		|	И (ПоступлениеЗапчастейТаблица.Ссылка.Перекуп = ИСТИНА
		|	ИЛИ ПоступлениеЗапчастейТаблица.Ссылка.Новые = ИСТИНА)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_ТоварыПродажа.СуммаБезНалога) КАК СуммаБезНалога
		|ИЗ
		|	ВТ_ТоварыПродажа КАК ВТ_ТоварыПродажа
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Сотрудники КАК ВТ_Сотрудники
		|		ПО (ВТ_ТоварыПродажа.КтоПродал = ВТ_Сотрудники.Пользователь)
		|ГДЕ
		|	НЕ ВТ_ТоварыПродажа.Партия В
		|		(ВЫБРАТЬ
		|			ВТ_ПерекупНовыеДетали.Партия
		|		ИЗ
		|			ВТ_ПерекупНовыеДетали КАК ВТ_ПерекупНовыеДетали)
		|	И НЕ ВТ_ТоварыПродажа.Партия В
		|		(ВЫБРАТЬ
		|			ВТ_ВостановленыеДетали.Инкод
		|		ИЗ
		|			ВТ_ВостановленыеДетали КАК ВТ_ВостановленыеДетали)";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	Запрос.УстановитьПараметр("МестоРаботы", Регион);
	
	СуммаБезНалога = 0; 
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	СуммаБезНалога = Выборка.СуммаБезНалога; 
	
	Возврат СуммаБезНалога; 
	// --- Сумма выданных товаров  Без НДС  (Товар: Выдан,НЕотменен. Документ: Проведен) 
	// +++ Без учета перекупа и востановленных запчастей по документу ПродажаЗапчастей
КонецФункции 

&НаСервереБезКонтекста
Функция РасходыОтделаФункция(Дата1,Дата2,ОтделКод)
// +++ Расходы отдела
	Запрос1 = Новый Запрос;
	Запрос1.Текст =
		"ВЫБРАТЬ
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И Расходы.Отдел.Код = &Отдел";
	
	Запрос1.УстановитьПараметр("Отдел", ОтделКод);
	
	Запрос1.УстановитьПараметр("Дата1", Дата1);
	Запрос1.УстановитьПараметр("Дата2", Дата2);
	
	
	СуммаРасходов = 0; 	
	
	РезультатЗапроса = Запрос1.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий(); 
	СуммаРасходов = Выборка.Сумма; 

	Возврат СуммаРасходов;
// --- Расходы отдела	 
КонецФункции

&НаСервереБезКонтекста
Функция РасходыОстальныхОтделов(Дата1,Дата2)
//+++ Расходы остальных отделов (Все расходы которые не принадлежат этим 8 - ми отделам)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Расходы.Сумма) КАК Сумма,
		|	Расходы.Отдел КАК Отдел,
		|	Расходы.Отдел.Код КАК ОтделКод
		|ПОМЕСТИТЬ ВТ_Нагрузка
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.Дата МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, ДЕНЬ)
		|	И Расходы.Отдел <> ЗНАЧЕНИЕ(Справочник.ВидыРасходов_3.ПустаяСсылка)
		|	И Расходы.Отдел.Код <> ""000000865""
		|	И Расходы.Отдел.Код <> ""000000492""
		|	И Расходы.Отдел.Код <> ""000000133""
		|	И Расходы.Отдел.Код <> ""000000128""
		|	И Расходы.Отдел.Код <> ""000000417""
		|	И Расходы.Отдел.Код <> ""000000121""
		|	И Расходы.Отдел.Код <> ""000000243""
		|	И Расходы.Отдел.Код <> ""000000123""
		|СГРУППИРОВАТЬ ПО
		|	Расходы.Отдел,
		|	Расходы.Отдел.Код
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(ВТ_Нагрузка.Сумма) КАК Сумма
		|ИЗ
		|	ВТ_Нагрузка КАК ВТ_Нагрузка";
	
	Запрос.УстановитьПараметр("Дата1", Дата1);
	Запрос.УстановитьПараметр("Дата2", Дата2);
	
	РасходыОстальныхОтделов = 0; 
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	РасходыОстальныхОтделов = Выборка.Сумма; 	
	Возврат РасходыОстальныхОтделов; 
	
//--- Расходы остальных отделов (Все расходы которые не принадлежат этим 8 - ми отделам)
КонецФункции










