
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Партии.Параметры.УстановитьЗначениеПараметра("Товар",Справочники.Номенклатура.НайтиПоКоду("0000001"));
	МинимальнаяЦена = 10000;
КонецПроцедуры

&НаСервере
Процедура УстановитьПараметр(код)
	Партии.Параметры.УстановитьЗначениеПараметра("Товар",Справочники.Номенклатура.НайтиПоКоду(код));
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	// Вставить содержимое обработчика.	
	УстановитьПараметр(Элементы.Список.ТекущиеДанные.Код);
КонецПроцедуры


&НаКлиенте
Процедура Поиск(Команда)
	// Вставить содержимое обработчика.
	Если Часть  Тогда
		RegExp = Новый COMОбъект("VBScript.RegExp");
         
		RegExp.IgnoreCase = Ложь; //Игнорировать регистр
		RegExp.Global = Истина; //Поиск всех вхождений шаблона
		RegExp.MultiLine = Истина; //Многострочный режим
				
		RegExp.Pattern = "[^a-zA-Zа-яА-Я_0-9 ]";
		стр1=RegExp.Replace( Поиск,"");  

		ПоискПоЧасти(стр1);
	Иначе
		Поиск1();    
	КонецЕсли
КонецПроцедуры

&НаКлиенте 
Процедура Поиск1()
	RegExp = Новый COMОбъект("VBScript.RegExp");
         
	RegExp.IgnoreCase = Ложь; //Игнорировать регистр
	RegExp.Global = Истина; //Поиск всех вхождений шаблона
	RegExp.MultiLine = Истина; //Многострочный режим
			
	RegExp.Pattern = "[^a-zA-Zа-яА-Я_0-9 ]";
	стр1=RegExp.Replace( Поиск,"");  
	Номера = Новый Массив();
	НомВр = Новый Массив();
	Рез1 = РазбитьСтрокуНаМассивПодстрок(стр1," ");
	Для Каждого ном1 из Рез1 Цикл
		НомВр = НачатьПоиск2(ном1);
		для каждого ном2 из НомВр Цикл
			Номера.Добавить(ном2);
		КонецЦикла;
		Номера.Добавить(ном1);
	КонецЦикла;
	RegExp = Новый COMОбъект("VBScript.RegExp");
	Фильтр(стр1, Номера);
КонецПроцедуры

&НаСервере
Функция ПоискПоЧасти(Поиск1)
	 ПоискПо = " ГДЕ СправочникНоменклатура.Код ПОДОБНО ""%"+Поиск+""" 
	 | ИЛИ СправочникНоменклатура.Наименование ПОДОБНО ""%"+Поиск+"%"" 
	 | ИЛИ СправочникНоменклатура.Артикул ПОДОБНО ""%"+Поиск+"%"" 
	 | ИЛИ СправочникНоменклатура.НомерПроизводителя ПОДОБНО ""%"+Поиск+"%""
	| ИЛИ СправочникНоменклатура.Код ПОДОБНО ""%"+Поиск1+"%""  
	| ИЛИ СправочникНоменклатура.Наименование ПОДОБНО ""%"+Поиск1+"%"" 
	| ИЛИ СправочникНоменклатура.АртикулПоиск ПОДОБНО ""%"+Поиск1+"%"" 
	| ИЛИ СправочникНоменклатура.НомерПоиск ПОДОБНО ""%"+Поиск1+"%"" 
	| ИЛИ СправочникНоменклатура.Комплектность.Артикул ПОДОБНО ""%"+Поиск+"%""
	|  ИЛИ НомЗамены.НомерЗамены ПОДОБНО ""%"+Поиск+"%"" ИЛИ СправочникНоменклатура.Комплектность.НомерПоиск ПОДОБНО ""%"+Поиск1+"%""
    | ";
	Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| )
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.Номенклатура.НомераЗамен КАК НомЗамены ПО СправочникНоменклатура.Ссылка = НомЗамены.Ссылка
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар "+ ПоискПо;
		Запрос = Новый Запрос;
	Запрос.Текст = Текст1;
	Сообщить( Текст1);
	Результат = Запрос.Выполнить();
	Таблица2 = Результат.Выгрузить();
	Количество = Таблица2.Количество();
	Если Таблица2.Количество() < 1 Тогда
		ОчиститьПоиск();
		Сообщить("Номер не найден");
		возврат 0;
	КонецЕсли;
	Текст1 = "ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.ВерсияДанных,
	|	Номенклатура.ПометкаУдаления,
	|	Номенклатура.Предопределенный,
	|	Номенклатура.Код,
	|	Номенклатура.Наименование,
	|	Номенклатура.Артикул,
	|	Номенклатура.НомерПроизводителя,
	|	Номенклатура.МестоНаСкладе,
	|	Номенклатура.Бренд,
	|	Номенклатура.АртикулПоиск,
	|	Номенклатура.НомерПоиск,
	|	Номенклатура.Фото,
	|	Номенклатура.НаименованиеПолное,
	|	Номенклатура.РекомендованаяЦена,
	|	Номенклатура.ЦенаОригинала,
	|	Номенклатура.МестоНаСкладе2,
	|	Номенклатура.Комплектность.(
	|		Ссылка,
	|		НомерСтроки,
	|		Артикул,
	|		Наименование,
	|		Количество,
	|		Комментарий,
	|		НомерПоиск
	|	),
	|	РегистрНакопления1Остатки.КолвоОстаток,
	|   РезервОстатки.КолвоОстаток как КолвоОстаток1,
	|   Номенклатура.НаДиректе,
	|   Номенклатура.НаАвтолайне,
	|   Номенклатура.ЕстьТэги,
	|   Номенклатура.КрупныйАгрегат,
	|   Номенклатура.ЭтоНоваяЗапчасть,
	|   Номенклатура.РекомендованаяЦена
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки 
	|		ПО Номенклатура.Ссылка =  РегистрНакопления1Остатки.Товар
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки 
	|	ПО Номенклатура.Ссылка = РезервОстатки.Товар ГДЕ ";
	номер = 0;
	Для Каждого строка из Таблица2 Цикл
		номер = номер + 1;
		Если номер<Количество Тогда 
			Текст1= Текст1 + "Номенклатура.Код = """+строка.код+""" ИЛИ ";	
		Иначе
			Текст1= Текст1 + "Номенклатура.Код = """+строка.код+""" ";
		КонецЕсли;
	КонецЦикла;	 
    Список.ТекстЗапроса = Текст1;
	Сообщить( Текст1);

КонецФункции


&НаСервере
Функция Фильтр(Поиск1,Номера) Экспорт
	Перем а;
	Мас = РазбитьСтрокуНаМассивПодстрок(Поиск," ");
	Кол = Мас.Количество();
	Коды = Новый Массив();
	Запрос = Новый Запрос();
	ПоискПо = " ГДЕ ( СправочникНоменклатура.Код ПОДОБНО ""%"+Поиск+""" ИЛИ СправочникНоменклатура.Наименование ПОДОБНО ""%"+Поиск+"%"" ИЛИ СправочникНоменклатура.Артикул = """+Поиск+""" ИЛИ СправочникНоменклатура.НомерПроизводителя = """+Поиск+"""
	| ИЛИ СправочникНоменклатура.Код ПОДОБНО ""%"+Поиск1+""" ИЛИ СправочникНоменклатура.Наименование ПОДОБНО ""%"+Поиск1+"%"" ИЛИ СправочникНоменклатура.АртикулПоиск = """+Поиск1+""" ИЛИ СправочникНоменклатура.НомерПоиск = """+Поиск1+""" ИЛИ СправочникНоменклатура.Комплектность.Артикул= """+Поиск+"""  ИЛИ НомЗамены.НомерЗамены= """+Поиск+""" ИЛИ СправочникНоменклатура.Комплектность.НомерПоиск= """+Поиск1+"""
    | ";
	Если Кол > 1 Тогда
		а=0;
		ПоискПо = ПоискПо + " ИЛИ ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникНоменклатура.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникНоменклатура.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;
	
	Если Кол > 1 Тогда
		а=0;
		Пока а < Кол Цикл
			ПоискПо = ПоискПо + " ИЛИ СправочникНоменклатура.Артикул = """+Мас[а]+"""
			|  ИЛИ СправочникНоменклатура.Код ПОДОБНО ""%"+Мас[а]+"""
			| ИЛИ СправочникНоменклатура.НомерПроизводителя = """+Мас[а]+"""";
			а = а + 1;
		КонецЦикла;
	КонецЕсли;
	
	Номера = УдалитьПовторяющиесяЭлементыМассива(Номера);
			
	Номер1 = Номера.Количество();
	Номер2 = 0;
	Пока Номер2 < Номер1 Цикл
		ПоискПо = ПоискПо + " ИЛИ СправочникНоменклатура.Артикул = """+Номера[Номер2]+"""
		| ИЛИ НомЗамены.НомерЗамены= """+Номера[Номер2]+"""
		| ИЛИ СправочникНоменклатура.НомерПроизводителя = """+Номера[Номер2]+"""
		| ИЛИ СправочникНоменклатура.Комплектность.Артикул= """+Номера[Номер2]+"""
		| ";
		Номер2 = Номер2 +1;
	КонецЦикла;
	Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| )
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| ЛЕВОЕ СОЕДИНЕНИЕ  Справочник.Номенклатура.НомераЗамен КАК НомЗамены ПО СправочникНоменклатура.Ссылка = НомЗамены.Ссылка
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар "+ ПоискПо;
	Текст1 = Текст1 + " ) ";
	Запрос = Новый Запрос;
	Запрос.Текст = Текст1;
	Если Поступление.Пустая() = Ложь Тогда
		Текст1 = Текст1 + " И РегистрНакопления1Остатки.машина = &Поступление";
		Запрос.Текст = Текст1;
		Запрос.УстановитьПараметр("Поступление",Поступление);
	КонецЕсли;
	Если podkategoria.Пустая() = Ложь Тогда 
		Текст1 = Текст1 + " И СправочникНоменклатура.podkategoria = &podkat"		;
		Запрос.Текст = Текст1;
		Запрос.УстановитьПараметр("podkat",podkategoria);
	Иначе
		Если kategoria.Пустая() = Ложь Тогда 
			Текст1 = Текст1 + " И СправочникНоменклатура.Категория = &kat"		;
			Запрос.Текст = Текст1;
			Запрос.УстановитьПараметр("kat",kategoria);
		КонецЕсли;  	
	КонецЕсли;
	Если нал = Истина Тогда
		Текст1 = Текст1 + " И РегистрНакопления1Остатки.КолвоОстаток > 0 ";
		Запрос.Текст = Текст1;	
	КонецЕсли;
	
	Коды = Новый Массив;

	Результат = Запрос.Выполнить();
	Таблица2 = Результат.Выгрузить();
	Количество = Таблица2.Количество();
	Если Таблица2.Количество() < 1 Тогда
		ОчиститьПоиск();
		Сообщить("Номер не найден");
		возврат 0;
	КонецЕсли;
	рез2 = Новый Массив;
	Для каждого стр из Таблица2 Цикл
		Если рез2.Найти(стр.код) = Неопределено Тогда
			рез2.Добавить(стр.код);
		КонецЕсли;
	КонецЦикла;

	Текст1 = "ВЫБРАТЬ
	|	Номенклатура.Ссылка,
	|	Номенклатура.ВерсияДанных,
	|	Номенклатура.ПометкаУдаления,
	|	Номенклатура.Предопределенный,
	|	Номенклатура.Код,
	|	Номенклатура.Наименование,
	|	Номенклатура.Артикул,
	|	Номенклатура.НомерПроизводителя,
	|	Номенклатура.МестоНаСкладе,
	|	Номенклатура.Бренд,
	|	Номенклатура.АртикулПоиск,
	|	Номенклатура.НомерПоиск,
	|	Номенклатура.Фото,
	|	Номенклатура.НаименованиеПолное,
	|	Номенклатура.РекомендованаяЦена,
	|	Номенклатура.ЦенаОригинала,
	|	Номенклатура.МестоНаСкладе2,
	|	Номенклатура.Комплектность.(
	|		Ссылка,
	|		НомерСтроки,
	|		Артикул,
	|		Наименование,
	|		Количество,
	|		Комментарий,
	|		НомерПоиск
	|	),
	|	РегистрНакопления1Остатки.КолвоОстаток,
	|   РезервОстатки.КолвоОстаток как КолвоОстаток1,
	|   Номенклатура.НаДиректе,
	|   Номенклатура.НаАвтолайне,
	|   Номенклатура.ЕстьТэги,
	|   Номенклатура.КрупныйАгрегат ,
	|   Номенклатура.ЭтоНоваяЗапчасть,
	|   Номенклатура.РекомендованаяЦена
	|ИЗ
	|	Справочник.Номенклатура КАК Номенклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки 
	|		ПО Номенклатура.Ссылка =  РегистрНакопления1Остатки.Товар
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки 
	|	ПО Номенклатура.Ссылка = РезервОстатки.Товар ГДЕ ";
	номер = 0;
	Для Каждого строка из рез2 Цикл
		номер = номер + 1;
		Если номер<рез2.Количество() Тогда 
			Текст1= Текст1 + "Номенклатура.Код = """+строка+""" ИЛИ ";	
		Иначе
			Текст1= Текст1 + "Номенклатура.Код = """+строка+""" ";
		КонецЕсли;
	КонецЦикла;	 
	Список.ТекстЗапроса = Текст1;
КонецФункции


&НаСервере
Функция НачатьПоиск2(Поиск1) Экспорт 
// Вставить содержимое обработчика.
	ЭтоСкания = ЛОЖЬ;
	ЭтоЗамена = ЛОЖЬ;
	Запрос = Новый Запрос();
	Номера = Новый Массив();
	НомераВр = Новый Массив();
	Номера.Добавить(Поиск1);
	Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	НомераСкания.Ссылка,
	 |	НомераСкания.Код КАК Код,
	 |	НомераСкания.Наименование,
	 |	НомераСкания.НомерСкания КАК НомерСкания,
	 |	НомераСкания.НомерЗамена КАК НомерЗамена,
	 |	НомераСкания.Представление
	 |ИЗ
	 |	Справочник.НомераСкания КАК НомераСкания
	 |ГДЕ
	 |	НомераСкания.НомерСкания ПОДОБНО &ПарамПоиск 
	 |	ИЛИ НомераСкания.НомерЗамена ПОДОБНО &ПарамПоиск1
	 |	ИЛИ НомераСкания.НомерСкания ПОДОБНО &ПарамПоиск2
	 |	ИЛИ НомераСкания.НомерЗамена ПОДОБНО &ПарамПоиск3
	 |УПОРЯДОЧИТЬ ПО Код";
	 Запрос.УстановитьПараметр("ПарамПоиск",Поиск);
	 Запрос.УстановитьПараметр("ПарамПоиск1","%/"+Поиск+"/%");
	 Запрос.УстановитьПараметр("ПарамПоиск2",Поиск1);
	 Запрос.УстановитьПараметр("ПарамПоиск3","%/"+Поиск1+"/%");
	 РезультатЗапроса = Запрос.Выполнить();
	 Если РезультатЗапроса.Пустой() Тогда
		 
	 Иначе
		ЭтоСкания = Истина; 
		 Выборка = РезультатЗапроса.Выбрать();
		 Пока Выборка.Следующий() Цикл
			 Номера.Добавить(Выборка.НомерСкания);
			 НомераВр = РазбитьСтрокуНаМассивПодстрок(Выборка.НомерЗамена,"/");
			 Номер1 = НомераВр.Количество();
		 	 Номер2 = 0;
			 Пока Номер2<Номер1 Цикл
				 Если СтрДлина(НомераВр[Номер2]) > 3 Тогда
					  Номера.Добавить(НомераВр[Номер2]);
				 КонецЕсли;
				 Номер2 = Номер2 + 1;
			 КонецЦикла;
			 
		 КонецЦикла;
	 КонецЕсли;
	 
	 Запрос.Текст = 
	 "ВЫБРАТЬ
	 |	НомераЗамен.Ссылка,
	 |	НомераЗамен.ВерсияДанных,
	 |	НомераЗамен.ПометкаУдаления,
	 |	НомераЗамен.Предопределенный,
	 |	НомераЗамен.Код,
	 |	НомераЗамен.Наименование,
	 |	НомераЗамен.СканияКод,
	 |	НомераЗамен.НомерСкания,
	 |	НомераЗамен.НомерПоиск,
	 |	НомераЗамен.НомерПолный,
	 |	НомераЗамен.Бренд,
	 |	НомераЗамен.Представление
	 |ИЗ
	 |	Справочник.НомераЗамен КАК НомераЗамен
	 |ГДЕ
	 |	НомераЗамен.НомерСкания ПОДОБНО &ПарамПоиск
	 |	ИЛИ НомераЗамен.НомерПолный ПОДОБНО &ПарамПоиск
	 |	ИЛИ НомераЗамен.НомерСкания ПОДОБНО &ПарамПоиск1
	 |	ИЛИ НомераЗамен.НомерПоиск ПОДОБНО &ПарамПоиск1";
	 Запрос.УстановитьПараметр("ПарамПоиск",Поиск);
	 Запрос.УстановитьПараметр("ПарамПоиск1",Поиск1);
	 РезультатЗапроса = Запрос.Выполнить();
	 Если РезультатЗапроса.Пустой() Тогда
		 
	 Иначе
		 ЭтоЗамена = Истина; 
		 Выборка = РезультатЗапроса.Выбрать();
		 Пока Выборка.Следующий() Цикл
			 Номера.Добавить(Выборка.НомерСкания);
		 КонецЦикла;
	 КонецЕсли;
	 
	 Если ЭтоЗамена ИЛИ ЭтоСкания Тогда
		
		 ПоискПо = "";
		 Номер1 = Номера.Количество();
		 Номер2 = 0;
		 Пока Номер2 < Номер1 Цикл
			ПоискПо = ПоискПо + " ИЛИ НомераЗамен.НомерСкания = """+Номера[Номер2]+"""";
			Номер2 = Номер2 +1;
		 КонецЦикла;
		
		 Запрос.Текст = 
		 "ВЫБРАТЬ DISTINCT
		 |	НомераЗамен.НомерСкания как НомерСкания,
		 |	НомераЗамен.НомерПолный,
		 |	НомераЗамен.НомерПоиск как НомерПоиск
		 |ИЗ
		 |	Справочник.НомераЗамен КАК НомераЗамен
		 |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.НомераСкания КАК НомераСкания
		 |		ПО НомераЗамен.НомерСкания = НомераСкания.Код
		 |ГДЕ
		 |	НомераЗамен.НомерСкания ПОДОБНО &ПарамПоиск
		 |			ИЛИ НомераЗамен.НомерПоиск ПОДОБНО &ПарамПоиск1 "+ПоискПо;
		 Запрос.УстановитьПараметр("ПарамПоиск",Поиск);
		 Запрос.УстановитьПараметр("ПарамПоиск1",Поиск1);
		 РезультатЗапроса = Запрос.Выполнить();
		 Если РезультатЗапроса.Пустой() Тогда
		 
		 Иначе 
			 Выборка = РезультатЗапроса.Выбрать();
			 Пока Выборка.Следующий() Цикл
				 Номера.Добавить(Выборка.НомерСкания);
				 Номера.Добавить(Выборка.НомерПоиск);
			 КонецЦикла;
		 КонецЕсли;
		 
		 Если ЭтоСкания Тогда
			 Запрос.Текст=
			 "ВЫБРАТЬ
			 |	НомераСкания.Ссылка,
			 |	НомераСкания.Код КАК Код,
			 |	НомераСкания.Наименование,
			 |	НомераСкания.НомерСкания КАК НомерСкания,
			 |	НомераСкания.НомерЗамена КАК НомерЗамена,
			 |	НомераСкания.Представление
			 |ИЗ
			 |	Справочник.НомераСкания КАК НомераСкания
			 |ГДЕ
			 |	НомераСкания.НомерСкания ПОДОБНО &ПарамПоиск 
			 |	ИЛИ НомераСкания.НомерЗамена ПОДОБНО &ПарамПоиск1
			 |	ИЛИ НомераСкания.НомерСкания ПОДОБНО &ПарамПоиск1 
			 |	ИЛИ НомераСкания.НомерЗамена ПОДОБНО &ПарамПоиск2
			 |УПОРЯДОЧИТЬ ПО Код";
			 Запрос.УстановитьПараметр("ПарамПоиск",Поиск);
			 Запрос.УстановитьПараметр("ПарамПоиск1","%/"+Поиск+"/%");
			 Запрос.УстановитьПараметр("ПарамПоиск2",Поиск1);
			 Запрос.УстановитьПараметр("ПарамПоиск3","%/"+Поиск1+"/%");
		 Иначе
			 ПоискПо = "";
			 Номер1 = Номера.Количество();
			 Номер2 = 0;
			 Пока Номер2 < Номер1 Цикл
				ПоискПо = ПоискПо + " ИЛИ НомераСкания.НомерСкания = """+Номера[Номер2]+""" ИЛИ НомераСкания.НомерЗамена ПОДОБНО ""%/"+Номера[Номер2]+"/%""";
				Номер2 = Номер2 +1;
			 КонецЦикла;

			 Если ЭтоЗамена Тогда
				 Запрос.Текст = 
				 "ВЫБРАТЬ
				 |	НомераСкания.Ссылка,
				 |	НомераСкания.Код КАК Код,
				 |	НомераСкания.Наименование,
				 |	НомераСкания.НомерСкания КАК НомерСкания,
				 |	НомераСкания.НомерЗамена КАК НомерЗамена,
				 |	НомераСкания.Представление
				 |ИЗ
				 |	Справочник.НомераСкания КАК НомераСкания
				 |ГДЕ
				 |	НомераСкания.НомерСкания ПОДОБНО &ПарамПоиск 
				 |	ИЛИ НомераСкания.НомерЗамена ПОДОБНО &ПарамПоиск1
				 |	ИЛИ НомераСкания.НомерСкания ПОДОБНО &ПарамПоиск2 
				 |	ИЛИ НомераСкания.НомерЗамена ПОДОБНО &ПарамПоиск3" + ПоискПо;
				 Запрос.УстановитьПараметр("ПарамПоиск",Поиск);
				 Запрос.УстановитьПараметр("ПарамПоиск1","%/"+Поиск+"/%");
				 Запрос.УстановитьПараметр("ПарамПоиск2",Поиск1);
				 Запрос.УстановитьПараметр("ПарамПоиск3","%/"+Поиск1+"/%");
			 КонецЕсли;
		 КонецЕсли;
		 РезультатЗапроса = Запрос.Выполнить();
		 Если РезультатЗапроса.Пустой() Тогда
		 
		 Иначе 
			 Выборка = РезультатЗапроса.Выбрать();
			 Пока Выборка.Следующий() Цикл
				 Номера.Добавить(Выборка.НомерСкания);
			 КонецЦикла;
		 КонецЕсли;
	 КонецЕсли;
	 
     ВОЗВРАТ Номера; 	 
КонецФункции


&НаСервере
Функция РазбитьСтрокуНаМассивПодстрок(ИсходнаяСтрока,РазделительСтрок)
   СтрокаДляРазбора = ИсходнаяСтрока;
   СтрокаДляРазбора = СтрЗаменить(СтрокаДляРазбора, РазделительСтрок, Символы.ПС);
   МассивСтрок = новый Массив;
   КолвоСтрок = СтрЧислоСтрок(СтрокаДляРазбора);
   Для НомСтр = 1 По КолвоСтрок Цикл
      МассивСтрок.Добавить(СтрПолучитьСтроку(СтрокаДляРазбора, НомСтр));
  КонецЦикла;
   Возврат МассивСтрок;
КонецФункции

&НаСервере
Функция УдалитьПовторяющиесяЭлементыМассива(Массив) 
 ТекущийИндекс = 0; 
	ВсегоЭлементов = Массив.Количество(); 
	Пока ТекущийИндекс < ВсегоЭлементов Цикл 
		Индекс2 = ТекущийИндекс + 1; 
		Пока Индекс2 < ВсегоЭлементов Цикл 
			Если Массив[Индекс2] = Массив[ТекущийИндекс] Тогда 
				Массив.Удалить(Индекс2); 
				ВсегоЭлементов = ВсегоЭлементов - 1; 
			Иначе 
				Индекс2 = Индекс2 + 1; 
			КонецЕсли; 
		КонецЦикла; 
		ТекущийИндекс = ТекущийИндекс + 1; 
	КонецЦикла; 
Возврат Массив; 
КонецФункции    

&НаКлиенте
Процедура очистить(Команда)
	// Вставить содержимое обработчика.
	ОчиститьПоиск();
КонецПроцедуры

&НаСервере
Процедура ОчиститьПоиск()
	Бренд = Справочники.Бренд.ПустаяСсылка();
	kategoria = Справочники.Категории.ПустаяСсылка();
	podkategoria = Справочники.Podkategorii.ПустаяСсылка();
		Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.МестоНаСкладе2,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.Фото,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	|   РезервОстатки.КолвоОстаток как КолвоОстаток1,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| ),
	|   СправочникНоменклатура.НаДиректе,
	|   СправочникНоменклатура.НаАвтолайне,
	|   СправочникНоменклатура.ЕстьТэги,
	|   СправочникНоменклатура.КрупныйАгрегат,
	|   СправочникНоменклатура.ЭтоНоваяЗапчасть,
	|   СправочникНоменклатура.РекомендованаяЦена
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки 
	|	ПО СправочникНоменклатура.Ссылка = РезервОстатки.Товар ";
	
	Список.ТекстЗапроса= Текст1;
	Поступление = Справочники.Машины.ПустаяСсылка();
	kategoria = Справочники.Категории.ПустаяСсылка();
	podkategoria = Справочники.Podkategorii.ПустаяСсылка();	
КонецПроцедуры

&НаКлиенте
Процедура СоздатьИзНомера(Команда)
	// Вставить содержимое обработчика.
	Поиск1();
	Если ПроверкаНаличия(Поиск) > 0 Тогда
		Режим = РежимДиалогаВопрос.ДаНет;
		Текст = "ru = ""Запись в номенклатуре с таким артикулом уже существует. Добавить еще одну запись с таким номером?"";"
		     + " en = ""Запись с номенклатуре таким артикулом уже существует. Добавить еще одну запись с таким номером?""";
		Ответ = Вопрос(НСтр(Текст), Режим, 0);
		Если Ответ = КодВозвратаДиалога.Нет Тогда
		    Возврат;
		КонецЕсли;
	КонецЕсли;
	

	Результат = СоздатьИзКода();
	Если Результат <> Null Тогда
		ТоварСсылка = НайтиПоКод(Результат.Код);
		Если Не ТоварСсылка.Пустая() Тогда
    		ТоварСсылка.ПолучитьФорму().Открыть();
    		//Возврат;
		КонецЕсли;

		
		Поиск1();
	Иначе
		Сообщить("Такой номер не найден");
	КонецЕсли;

КонецПроцедуры

&НаСервере
Функция НайтиПоКод(Код)
	Возврат Справочники.Номенклатура.НайтиПоКоду(Код)
КонецФункции	

&НаСервере
Функция СоздатьИзКода()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	НомераСкания.Наименование,
	               |	НомераСкания.НомерСкания
	               |ИЗ
	               |	Справочник.НомераСкания КАК НомераСкания
	               |ГДЕ
	               |	НомераСкания.НомерСкания = &НомерСкания";
	Запрос.УстановитьПараметр("НомерСкания",Поиск);
	Результат = Запрос.Выполнить();
	Табл = Результат.Выгрузить();
	Наименование = "";
	Номер = "";
	Для Каждого Строка Из Табл Цикл
		Наименование = Строка.Наименование;
		Номер = Строка.НомерСкания;
	КонецЦикла;
	Если Наименование = "" Тогда
		Возврат Null;
	КонецЕсли;
	ЦенОр = 0;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЦенаОригинала.Цена
	               |ИЗ
	               |	Справочник.ЦенаОригинала КАК ЦенаОригинала
	               |ГДЕ
	               |	ЦенаОригинала.Артикул = &Артикул";
	Запрос.УстановитьПараметр("Артикул",Поиск);
	Результат = Запрос.Выполнить();
	Табл = Результат.Выгрузить();
	Для Каждого Строка Из Табл Цикл
		ЦенОр = Строка.Цена;
	КонецЦикла;
	об = Справочники.Номенклатура.СоздатьЭлемент();
	об.Артикул = Номер;
	об.АртикулПоиск = Номер;
	об.Бренд = Справочники.Бренд.НайтиПоНаименованию("Scania");
	об.МестоНаСкладе = "0";
	об.Наименование = Наименование;
	об.НомерПроизводителя = Номер;
	об.НомерПоиск = Номер;
	об.ЦенаОригинала = ЦенОр;
	об.Записать();
	Возврат об;
КонецФункции

&НаКлиенте
Процедура ДобавитьВПриход(Команда)
	// Вставить содержимое обработчика.
	ФормаСписка = ПолучитьФорму("Документ.ПоступлениеЗапчастей.ФормаВыбора");
	ФормаСписка.ВладелецФормы = ЭтаФорма;
	Если Не ФормаСписка.Открыта() Тогда
    	ФормаСписка.ОткрытьМодально();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавитьВДокумент(ВыбранноеЗначение, СсылкаНом)
	Объект = ВыбранноеЗначение.ПолучитьОбъект();
	Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Строка = Объект.Таблица.Добавить();
    Строка.Товар = СсылкаНом;
	Строка.Ответственный = НайтиПользователя();
	Объект.Записать(РежимЗаписиДокумента.Запись);
    Возврат Объект;
КонецФункции


&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	// Вставить содержимое обработчика.
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ПоступлениеЗапчастей") Тогда
		Об = ВыбранноеЗначение.ПолучитьОбъект();
		Если Об.Новые=Истина И Элементы.Список.ТекущаяСтрока.ЭтоНоваяЗапчасть <> Истина Тогда
			Сообщить("Нельзя добавить БУ деталь в накладную для новых");
			Возврат;
		КонецЕсли;
		Если Об.Новые=Ложь И Элементы.Список.ТекущаяСтрока.ЭтоНоваяЗапчасть = Истина Тогда
			Сообщить("Нельзя добавить новую деталь в накладную для БУ");
			Возврат;
		КонецЕсли;
		Результат = ДобавитьВДокумент(ВыбранноеЗначение,Элементы.Список.ТекущаяСтрока);
		Если Результат <> Null Тогда
			ТоварСсылка = НайтиДок(Результат.Номер);
			Если Не ТоварСсылка.Пустая() Тогда
	    		ТоварСсылка.ПолучитьФорму().ОткрытьМодально();
	    		УстановитьПараметр(Элементы.Список.ТекущиеДанные.Код);
			КонецЕсли;
	 	Иначе
			Сообщить("Такой номер не найден");
		КонецЕсли; 
	КонецЕсли;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
		Результат = Null;
		Если Элементы.Список.ТекущаяСтрока.ЭтоНоваяЗапчасть = Истина Тогда
			Результат = ДобавитьВПродажуСервНов(ВыбранноеЗначение,Элементы.Список.ТекущаяСтрока, Элементы.Партии.ТекущиеДанные.КолвоОстаток,Элементы.Партии.ТекущиеДанные.Машина,Элементы.Партии.ТекущиеДанные.Цена,Элементы.Партии.ТекущиеДанные.ПродНак);
		Иначе
			Результат = ДобавитьВПродажуСерв(ВыбранноеЗначение,Элементы.Список.ТекущаяСтрока, Элементы.Партии.ТекущиеДанные.КолвоОстаток,Элементы.Партии.ТекущиеДанные.Машина,Элементы.Партии.ТекущиеДанные.Цена);
		КонецЕсли;
				
	    Если Результат <> Null Тогда
			ТоварСсылка = НайтиДокПродажа(Результат.Номер);
			Если Не ТоварСсылка.Пустая() Тогда
	    		ТоварСсылка.ПолучитьФорму().ОткрытьМодально();
	    		УстановитьПараметр(Элементы.Список.ТекущиеДанные.Код);
			КонецЕсли;
	 	Иначе
			Сообщить("Такой номер не найден");
		КонецЕсли;
	КонецЕсли;
	
	
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.РезервЗапчастей") Тогда
		Результат = ДобавитьВРезервСерв(ВыбранноеЗначение,Элементы.Список.ТекущаяСтрока, Элементы.Партии.ТекущиеДанные.КолвоОстаток,Элементы.Партии.ТекущиеДанные.Машина,Элементы.Партии.ТекущиеДанные.Цена);
		
	    Если Результат <> Null Тогда
			ТоварСсылка = НайтиДокРезерв(Результат.Номер);
			Если Не ТоварСсылка.Пустая() Тогда
	    		ТоварСсылка.ПолучитьФорму().ОткрытьМодально();
	    		УстановитьПараметр(Элементы.Список.ТекущиеДанные.Код);
			КонецЕсли;
	 	Иначе
			Сообщить("Такой номер не найден");
		КонецЕсли;
	КонецЕсли;
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("ДокументСсылка.ПеремещениеТоваров") Тогда
		Результат = ДобавитьВСчетСерв(ВыбранноеЗначение,Элементы.Список.ТекущаяСтрока);
		
	    Если Результат <> Null Тогда
			ТоварСсылка = НайтиДокПСчет(Результат.Номер);
			Если Не ТоварСсылка.Пустая() Тогда
	    		ТоварСсылка.ПолучитьФорму().ОткрытьМодально();
	    		УстановитьПараметр(Элементы.Список.ТекущиеДанные.Код);
			КонецЕсли;
	 	Иначе
			Сообщить("Такой номер не найден");
		КонецЕсли;
	КонецЕсли;

	
КонецПроцедуры

&НаСервере
Функция НайтиДок(Код)
	Возврат Документы.ПоступлениеЗапчастей.НайтиПоНомеру(Код);
КонецФункции	

&НаСервере
Функция ПроверкаНаличия(Поиск33)
	RegExp = Новый COMОбъект("VBScript.RegExp");
         
	RegExp.IgnoreCase = Ложь; //Игнорировать регистр
	RegExp.Global = Истина; //Поиск всех вхождений шаблона
	RegExp.MultiLine = Истина; //Многострочный режим
			
	RegExp.Pattern = "\W";
	RegExp.Pattern = "[^a-zA-Zа-яА-Я_0-9]";
	стр1=RegExp.Replace( Поиск33,"");  
	Номера = Новый Массив();
	Номера = НачатьПоиск2(стр1);
	RegExp = Новый COMОбъект("VBScript.RegExp");
	Возврат ПоискВнутренний(стр1, Номера);
	
КонецФункции

&НаСервере
Функция  ПоискВнутренний(Поиск1,Номера)
	Перем а;
	Мас = РазбитьСтрокуНаМассивПодстрок(Поиск," ");
	Кол = Мас.Количество();
	Коды = Новый Массив();
	Запрос = Новый Запрос();
	ПоискПо = " ГДЕ СправочникНоменклатура.Код ПОДОБНО ""%"+Поиск+""" ИЛИ СправочникНоменклатура.Наименование ПОДОБНО ""%"+Поиск+"%"" ИЛИ СправочникНоменклатура.Артикул = """+Поиск+""" ИЛИ СправочникНоменклатура.НомерПроизводителя = """+Поиск+"""
	| ИЛИ СправочникНоменклатура.Код ПОДОБНО ""%"+Поиск1+""" ИЛИ СправочникНоменклатура.Наименование ПОДОБНО ""%"+Поиск1+"%"" ИЛИ СправочникНоменклатура.АртикулПоиск = """+Поиск1+""" ИЛИ СправочникНоменклатура.НомерПоиск = """+Поиск1+""" ИЛИ СправочникНоменклатура.Комплектность.Артикул= """+Поиск+""" ИЛИ СправочникНоменклатура.Комплектность.НомерПоиск= """+Поиск1+"""
    | ";
	Если Кол > 1 Тогда
		а=0;
		ПоискПо = ПоискПо + " ИЛИ ( ";
		Пока а < Кол Цикл
			Если а = 0 Тогда
				ПоискПо = ПоискПо + " СправочникНоменклатура.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			Иначе
				ПоискПо = ПоискПо + " И СправочникНоменклатура.Наименование ПОДОБНО ""%"+Мас[а]+"%""";
			КонецЕсли;
			а = а + 1;
		КонецЦикла;
		ПоискПо = ПоискПо + " ) ";
	КонецЕсли;
	
	Номера = УдалитьПовторяющиесяЭлементыМассива(Номера);
			
	Номер1 = Номера.Количество();
	Номер2 = 0;
	Пока Номер2 < Номер1 Цикл
		ПоискПо = ПоискПо + " ИЛИ СправочникНоменклатура.Артикул = """+Номера[Номер2]+""" ИЛИ СправочникНоменклатура.НомерПроизводителя = """+Номера[Номер2]+""" ИЛИ СправочникНоменклатура.Комплектность.Артикул= """+Номера[Номер2]+"""
		| ";
		Номер2 = Номер2 +1;
	КонецЦикла;
	Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| )
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар "+ ПоискПо;
	Запрос = Новый Запрос;
	Запрос.Текст= Текст1;
	Результат = Запрос.Выполнить();
	Таблица = Результат.Выгрузить();
	Возврат Таблица.Количество();
КонецФункции

&НаКлиенте
Процедура ДобавитьВПродажу(Команда)
	// Вставить содержимое обработчика.
	ФормаСписка = ПолучитьФорму("Документ.ПродажаЗапчастей.ФормаВыбора");
	ФормаСписка.ВладелецФормы = ЭтаФорма;
	Если Не ФормаСписка.Открыта() Тогда
    	ФормаСписка.ОткрытьМодально();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавитьВПродажуСерв(ВыбранноеЗначение, СсылкаНом,Колво,Машина,Цена)
	
    Объект = ВыбранноеЗначение.ПолучитьОбъект();
	Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Строка = Объект.Таблица.Добавить();
    Строка.Товар = СсылкаНом;
	Строка.Количество = 1;
	Строка.машина = Машина;
	Строка.Комментарий = Машина.Наименование;
	Строка.Цена = СсылкаНом.РекомендованаяЦена;
	Строка.цена1 = Цена;
	Объект.Записать(РежимЗаписиДокумента.Запись);
    Возврат Объект;
КонецФункции

&НаСервере
Функция ДобавитьВПродажуСервНов(ВыбранноеЗначение, СсылкаНом,Колво,Машина,Цена,ПродНак)
	
    Объект = ВыбранноеЗначение.ПолучитьОбъект();
	Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Строка = Объект.Таблица.Добавить();
    Строка.Товар = СсылкаНом;
	Строка.Количество = 1;
	Строка.машина = Машина;
	Строка.Цена = СсылкаНом.РекомендованаяЦена;
	Строка.цена1 = Цена;
	Строка.ПродНак = ПродНак;
	Объект.Записать(РежимЗаписиДокумента.Запись);
    Возврат Объект;
КонецФункции


&НаСервере
Функция НайтиДокПродажа(Код)
	Возврат Документы.ПродажаЗапчастей.НайтиПоНомеру(Код);
КонецФункции

&НаКлиенте
Процедура ДобавитьВРезерв(Команда)
	// Вставить содержимое обработчика.
	ФормаСписка = ПолучитьФорму("Документ.РезервЗапчастей.ФормаВыбора");
	ФормаСписка.ВладелецФормы = ЭтаФорма;
	Если Не ФормаСписка.Открыта() Тогда
    	ФормаСписка.ОткрытьМодально();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ДобавитьВРезервСерв(ВыбранноеЗначение, СсылкаНом,Колво,Машина,Цена)
	
    Объект = ВыбранноеЗначение.ПолучитьОбъект();
	Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Строка = Объект.Таблица.Добавить();
    Строка.Товар = СсылкаНом;
	Строка.Количество = Колво;
	Строка.машина = Машина;
	Строка.Цена = Цена;
	Строка.цена1 = Цена;
	Объект.Записать(РежимЗаписиДокумента.Запись);
    Возврат Объект;
КонецФункции

&НаСервере
Функция НайтиДокРезерв(Код)
	Возврат Документы.РезервЗапчастей.НайтиПоНомеру(Код);
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	
	ТабДокумент = ПечатьСервер();
	ТабДокумент.Показать();


КонецПроцедуры

&НаСервере
Функция ПечатьСервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("шапка");
	ТабДокумент.Вывести(ОбластьМакета);
	строка =   Макет.ПолучитьОбласть("строка");
	ссс = Элементы.Список.ВыделенныеСтроки;
	Для Каждого стр Из ссс Цикл
		строка.Параметры.код = стр.Код;
		строка.Параметры.артикул = стр.Артикул;
		строка.Параметры.название = стр.Наименование;
		строка.Параметры.колво = табл(стр.Код);
		строка.Параметры.место = стр.МестоНаСкладе2;
		ТабДокумент.Вывести(строка);
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()

&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.Отчет1.ПолучитьМакет(название);
КонецФункции

&НаСервере
Функция табл(код)
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	РегистрНакопления1Остатки.КолвоОстаток
	                |ИЗ
	                |	РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	                |ГДЕ
	                | РегистрНакопления1Остатки.Товар.Код = &Код";
	Запрос.УстановитьПараметр("Код",Код);
	результат = Запрос.Выполнить();
	табл = результат.Выгрузить();
	для каждого стр из табл цикл
		возврат стр.КолвоОстаток;
	КонецЦикла;
	Возврат 0;
КонецФункции


&НаСервере
Функция НайтиПользователя()
	// ++ obrv 16.01.18
	//Возврат Справочники.Пользователи.НайтиПоНаименованию(ИмяПользователя());
	Возврат ПользователиКлиентСервер.ТекущийПользователь();
	// -- obrv 16.01.18
КонецФункции

&НаКлиенте
Процедура Фотографий(Команда)
	// Вставить содержимое обработчика.
	Сообщить("Фотография есть у "+КолвоФото()+" деталей");

КонецПроцедуры
	
&НаСервере
Функция КолвоАвтолайн()
	запр = Новый Запрос;
	запр.Текст = "ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(Номенклатура.НаАвтолайне) КАК НаАвтолайне
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Номенклатура.НаАвтолайне = ИСТИНА"  ;
	Возврат запр.Выполнить().Выгрузить().Итог("НаАвтолайне");
КонецФункции

&НаСервере
Функция КолвоФото()
	запр = Новый Запрос;
	запр.Текст = "ВЫБРАТЬ
	             |	КОЛИЧЕСТВО(Номенклатура.Фото) КАК Фото
	             |ИЗ
	             |	Справочник.Номенклатура КАК Номенклатура
	             |ГДЕ
	             |	Фото = ИСТИНА"  ;
	Возврат запр.Выполнить().Выгрузить().Итог("Фото");
КонецФункции


&НаКлиенте
Процедура автолайн(Команда)
	Сообщить("Категория проставлена у "+КолвоАвтолайн()+" деталей");
КонецПроцедуры

&НаКлиенте
Процедура КолонкаТэги(Команда)
	если ЭтаФорма.Элементы.ЕстьТэги.Видимость = истина тогда
		ЭтаФорма.Элементы.ЕстьТэги.Видимость = ложь;
	Иначе
		ЭтаФорма.Элементы.ЕстьТэги.Видимость = истина;
	КОнецЕсли
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьСайт(Команда)
	
	ОбщДействия.ПоискКодаНаСтаромСайте( ЭтаФорма.Элементы.Список.ТекущиеДанные.Код);

КонецПроцедуры

&НаКлиенте
Процедура КрупныйАгрегат(Команда)
	// Вставить содержимое обработчика.
	если ЭтаФорма.Элементы.КрупныйАгрегат.Видимость = истина тогда
		ЭтаФорма.Элементы.КрупныйАгрегат.Видимость = ложь;
	Иначе
		ЭтаФорма.Элементы.КрупныйАгрегат.Видимость = истина;
	КОнецЕсли
КонецПроцедуры

&НаКлиенте
Процедура kategoriaПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	changeKat();
КонецПроцедуры

&НаСервере
Функция changeKat()
	Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.МестоНаСкладе2,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.Фото,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	|   РезервОстатки.КолвоОстаток как КолвоОстаток1,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| ),
	|   СправочникНоменклатура.НаДиректе,
	|   СправочникНоменклатура.НаАвтолайне,
	|   СправочникНоменклатура.ЕстьТэги,
	|   СправочникНоменклатура.КрупныйАгрегат,
	|   СправочникНоменклатура.ЭтоНоваяЗапчасть,
	|   СправочникНоменклатура.РекомендованаяЦена
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки 
	|	ПО СправочникНоменклатура.Ссылка = РезервОстатки.Товар ";
	Если нал = Истина Тогда
		толькоНал = " РегистрНакопления1Остатки.КолвоОстаток > 0 И ";
	КонецЕсли;

	Если kategoria.Пустая() = Ложь Тогда 
		Текст1 = Текст1 + " ГДЕ "+ толькоНал +" СправочникНоменклатура.Категория = &kat"		;
		Список.ТекстЗапроса= Текст1;
		Список.Параметры.УстановитьЗначениеПараметра("kat",kategoria);
		Если Поступление.Пустая() = Ложь Тогда
			Текст1 = Текст1 + " И РегистрНакопления1Остатки.машина = &Поступление";
			Список.ТекстЗапроса= Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("Поступление",Поступление);
		КонецЕсли;
	Иначе
		Список.ТекстЗапроса= Текст1;
		Если Поступление.Пустая() = Ложь Тогда
			Текст1 = Текст1 + " ГДЕ "+ толькоНал +" РегистрНакопления1Остатки.машина = &Поступление";
			Список.ТекстЗапроса= Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("Поступление",Поступление);
		КонецЕсли;
	КонецЕсли;
КонецФункции

&НаКлиенте
Процедура podkategoriaПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	changePodKat();
КонецПроцедуры

&НаСервере
Функция changePodKat()
	Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.МестоНаСкладе2,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.Фото,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	|   РезервОстатки.КолвоОстаток как КолвоОстаток1,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| ),
	|   СправочникНоменклатура.НаДиректе,
	|   СправочникНоменклатура.НаАвтолайне,
	|   СправочникНоменклатура.ЕстьТэги,
	|   СправочникНоменклатура.КрупныйАгрегат,
	|   СправочникНоменклатура.ЭтоНоваяЗапчасть,
	|   СправочникНоменклатура.РекомендованаяЦена
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки 
	|	ПО СправочникНоменклатура.Ссылка = РезервОстатки.Товар ";
	толькоНал = "";
		Если нал = Истина Тогда
			толькоНал = " РегистрНакопления1Остатки.КолвоОстаток > 0 И ";
		КонецЕсли;
	Если podkategoria.Пустая() = Ложь Тогда 
		Текст1 = Текст1 + " ГДЕ "+ толькоНал +" СправочникНоменклатура.podkategoria = &podkat"		;
		Список.ТекстЗапроса= Текст1;
		Список.Параметры.УстановитьЗначениеПараметра("podkat",podkategoria);
		Если Поступление.Пустая() = Ложь Тогда
			Текст1 = Текст1 + " И РегистрНакопления1Остатки.машина = &Поступление";
			Список.ТекстЗапроса= Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("Поступление",Поступление);
		КонецЕсли;
	Иначе
		Если kategoria.Пустая() = Ложь Тогда 
			Текст1 = Текст1 + " ГДЕ "+ толькоНал +" СправочникНоменклатура.Категория = &kat"		;
			Список.ТекстЗапроса= Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("kat",kategoria);
			Если Поступление.Пустая() = Ложь Тогда
				Текст1 = Текст1 + " И РегистрНакопления1Остатки.машина = &Поступление";
				Список.ТекстЗапроса= Текст1;
				Список.Параметры.УстановитьЗначениеПараметра("Поступление",Поступление);
			КонецЕсли;
		Иначе
			Список.ТекстЗапроса= Текст1;
			Если Поступление.Пустая() = Ложь Тогда
				Текст1 = Текст1 + " ГДЕ "+ толькоНал +" РегистрНакопления1Остатки.машина = &Поступление";
				Список.ТекстЗапроса= Текст1;
				Список.Параметры.УстановитьЗначениеПараметра("Поступление",Поступление);
			КонецЕсли;
		КонецЕсли;
	
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура bezPodkategorii(Команда)
	// Вставить содержимое обработчика.
	servBezPodkategorii();
КонецПроцедуры

&НаСервере
Функция servBezPodkategorii()
	
	Текст1 = 
	"ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка,
	|	СправочникНоменклатура.ВерсияДанных,
	|	СправочникНоменклатура.ПометкаУдаления,
	|	СправочникНоменклатура.Предопределенный,
	|	СправочникНоменклатура.Код,
	|	СправочникНоменклатура.Наименование,
	|	СправочникНоменклатура.Артикул,
	|	СправочникНоменклатура.НомерПроизводителя,
	|	СправочникНоменклатура.МестоНаСкладе,
	|	СправочникНоменклатура.Бренд,
	|	СправочникНоменклатура.АртикулПоиск,
	|	СправочникНоменклатура.НомерПоиск,
	|	СправочникНоменклатура.Фото,
	|	СправочникНоменклатура.НаименованиеПолное,
	|	РегистрНакопления1Остатки.КолвоОстаток,
	|	РезервОстатки.КолвоОстаток КАК КолвоОстаток1,
	|	СправочникНоменклатура.Комплектность.(
	|		Ссылка,
	|		НомерСтроки,
	|		Артикул,
	|		Наименование,
	|		Количество,
	|		Комментарий,
	|		НомерПоиск
	|	),
	|	СправочникНоменклатура.НаДиректе,
	|	СправочникНоменклатура.НаАвтолайне,
	|	СправочникНоменклатура.ЕстьТэги,
	|	СправочникНоменклатура.КрупныйАгрегат,
	|   СправочникНоменклатура.ЭтоНоваяЗапчасть,
	|   СправочникНоменклатура.РекомендованаяЦена
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки
	|		ПО СправочникНоменклатура.Ссылка = РезервОстатки.Товар
	|ГДЕ
	|	СправочникНоменклатура.podkategoria = ЗНАЧЕНИЕ(Справочник.Podkategorii.ПустаяСсылка) и СправочникНоменклатура.Категория = &kat";
	
Список.ТекстЗапроса= Текст1;	
Список.Параметры.УстановитьЗначениеПараметра("kat",kategoria);
КонецФункции

&НаКлиенте
Процедура Бренд1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	changeБренд();
КонецПроцедуры

&НаСервере
Функция changeБренд()
	Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.МестоНаСкладе2,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.Фото,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	|   РезервОстатки.КолвоОстаток как КолвоОстаток1,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| ),
	|   СправочникНоменклатура.НаДиректе,
	|   СправочникНоменклатура.НаАвтолайне,
	|   СправочникНоменклатура.ЕстьТэги,
	|   СправочникНоменклатура.КрупныйАгрегат,
	|   СправочникНоменклатура.ЭтоНоваяЗапчасть,
	|   СправочникНоменклатура.РекомендованаяЦена
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки 
	|	ПО СправочникНоменклатура.Ссылка = РезервОстатки.Товар ";
	толькоНал = "";
		Если нал = Истина Тогда
			толькоНал = " РегистрНакопления1Остатки.КолвоОстаток > 0 И ";
		КонецЕсли;
	Если Бренд.Пустая() = Ложь Тогда
        Текст1 = Текст1 + " ГДЕ "+ толькоНал +" СправочникНоменклатура.Бренд = &бренд "		;
		Список.ТекстЗапроса= Текст1;
		Список.Параметры.УстановитьЗначениеПараметра("бренд",Бренд);
		Если podkategoria.Пустая() = Ложь Тогда 
			Текст1 = Текст1 + " И СправочникНоменклатура.podkategoria = &podkat"		;
			Список.ТекстЗапроса= Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("podkat",podkategoria);
		Иначе
			Если kategoria.Пустая() = Ложь Тогда 
				Текст1 = Текст1 + " И СправочникНоменклатура.Категория = &kat"		;
				Список.ТекстЗапроса= Текст1;
				Список.Параметры.УстановитьЗначениеПараметра("kat",kategoria);
			КонецЕсли;  	
		КонецЕсли;
	Иначе
		Если podkategoria.Пустая() = Ложь Тогда 
			Текст1 = Текст1 + " ГДЕ "+ толькоНал +" СправочникНоменклатура.podkategoria = &podkat"		;
			Список.ТекстЗапроса= Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("podkat",podkategoria);
		Иначе
			Если kategoria.Пустая() = Ложь Тогда 
				Текст1 = Текст1 + " ГДЕ СправочникНоменклатура.Категория = &kat"		;
				Список.ТекстЗапроса= Текст1;
				Список.Параметры.УстановитьЗначениеПараметра("kat",kategoria);
			Иначе
				Список.ТекстЗапроса= Текст1;	
			КонецЕсли;  	
		КонецЕсли;
	
	КонецЕсли;

КонецФункции

&НаКлиенте
Процедура налПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	налИзм();
КонецПроцедуры


&НаСервере
Процедура налИзм() 
	Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.МестоНаСкладе2,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.Фото,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	|   РезервОстатки.КолвоОстаток как КолвоОстаток1,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| ),
	|   СправочникНоменклатура.НаДиректе,
	|   СправочникНоменклатура.НаАвтолайне,
	|   СправочникНоменклатура.ЕстьТэги,
	|   СправочникНоменклатура.КрупныйАгрегат,
	|   СправочникНоменклатура.ЭтоНоваяЗапчасть,
	|   СправочникНоменклатура.РекомендованаяЦена
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки 
	|	ПО СправочникНоменклатура.Ссылка = РезервОстатки.Товар ";
	Список.ТекстЗапроса= Текст1;
	п=ложь;
	Если Бренд.Пустая() = Ложь ИЛИ podkategoria.Пустая() = Ложь ИЛИ  kategoria.Пустая() = Ложь ИЛИ нал = Истина Тогда
		Текст1 = Текст1 + " ГДЕ ";
		п=Истина;
	КонецЕсли;	
	Если Поступление.Пустая() = Ложь Тогда
		Если п = Истина Тогда
			Текст1 = Текст1 + " РегистрНакопления1Остатки.машина = &Поступление";
			п=Ложь;
		Иначе
			Текст1 = Текст1 + " И РегистрНакопления1Остатки.машина = &Поступление";
		КонецЕсли;
		Список.ТекстЗапроса = Текст1;
		Список.Параметры.УстановитьЗначениеПараметра("Поступление",Поступление);
	КонецЕсли;
	Если podkategoria.Пустая() = Ложь Тогда 
		Если п = Истина Тогда
			Текст1 = Текст1 + " СправочникНоменклатура.podkategoria = &podkat"		;

			п=Ложь;
		Иначе
			Текст1 = Текст1 + " И СправочникНоменклатура.podkategoria = &podkat"		;

		КонецЕсли;
		
		Список.ТекстЗапроса = Текст1;
		Список.Параметры.УстановитьЗначениеПараметра("podkat",podkategoria);
	Иначе
		Если kategoria.Пустая() = Ложь Тогда 
			Если п = Истина Тогда
				Текст1 = Текст1 + " СправочникНоменклатура.Категория = &kat"		; 
				п=Ложь;
			Иначе
				Текст1 = Текст1 + " И СправочникНоменклатура.Категория = &kat"		;
			КонецЕсли;  
			Список.ТекстЗапроса = Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("kat",kategoria);
		КонецЕсли;  	
	КонецЕсли;
	Если нал = Истина Тогда
		Если п = Истина Тогда
			Текст1 = Текст1 + " РегистрНакопления1Остатки.КолвоОстаток > 0 "; 
			п=Ложь;
		Иначе
			Текст1 = Текст1 + " И РегистрНакопления1Остатки.КолвоОстаток > 0 ";
		КонецЕсли; 
		
		Список.ТекстЗапроса = Текст1;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура UpdatePhoto(Команда)
	// Вставить содержимое обработчика.
	// Вставить содержимое обработчика.
	ссылка = "http://adm.nntr.ru/api/updateone?id1c="+ЭтаФорма.Элементы.Список.ТекущиеДанные.Код;
	ЗапуститьПриложение(ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Порядок=ЭтаФорма.Список.Порядок;
 Порядок.Элементы.Очистить();
 ЭлементПорядка = Порядок.Элементы.Добавить(Тип("ЭлементПорядкаКомпоновкиДанных"));
 ЭлементПорядка.РежимОтображения =  РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Обычный;
 ЭлементПорядка.ТипУпорядочивания = НаправлениеСортировкиКомпоновкиДанных.Возр;
 ЭлементПорядка.Поле = Новый ПолеКомпоновкиДанных("Код"); // Поле, по которому будет упорядочивание
 ЭлементПорядка.Использование = Истина;
 Элементы.Список.ТекущаяСтрока=УстСтроку();
 Элементы.Группа3.Видимость=Ложь;
КонецПроцедуры

&НаСервере
Функция УстСтроку()
	 запр = Новый Запрос;
	 запр.Текст = Список.ТекстЗапроса+" Упорядочить по СправочникНоменклатура.Код";
	 р1 = запр.Выполнить().Выгрузить();
	 
	 Возврат р1[р1.Количество()-1].Ссылка;
КонецФункции

&НаКлиенте
Процедура ОткрытьПродажу(Команда)
	// Вставить содержимое обработчика.
	рез = НайтиПродажуДок(Элементы.Партии.ТекущиеДанные.Машина);
	Если рез <> 0 Тогда
		рез.ПолучитьФорму().ОткрытьМодально();
	КонецЕсли
КонецПроцедуры

&НаСервере
Функция НайтиПродажуДок(Машина)
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ПоступлениеЗапчастей.Ссылка
	               |ИЗ
	               |	Документ.ПоступлениеЗапчастей КАК ПоступлениеЗапчастей
	               |ГДЕ
	               |	ПоступлениеЗапчастей.Машина = &Машина";
	запрос.УстановитьПараметр("Машина",Машина);
	рез = запрос.Выполнить().Выгрузить();
	Для Каждого стр Из рез Цикл
		возврат стр.Ссылка;
	КонецЦикла;
	возврат 0;
КонецФункции

&НаКлиенте
Процедура ВывестиДанные(Команда)
	ТабДокумент = ВывестиДанныеСервер();
	
	ТабДокумент.Показать();
КонецПроцедуры

&НаСервере
Функция ВывестиДанныеСервер()

	данные = ДанныеДляДиректа();

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("ДляДиректа");
	ОбластьМакета = Макет.ПолучитьОбласть("шапка");
	ТабДокумент.Вывести(ОбластьМакета);
	строка =   Макет.ПолучитьОбласть("строка");
	Для Каждого стр Из данные Цикл
		строка.Параметры.код = стр.Код;
		строка.Параметры.артикул = стр.Артикул;
		строка.Параметры.название = "";
		Если СтрДлина(стр.Наименование) >= 33 Тогда
			строка.Параметры.название = "## ";	
		КонецЕсли;
		строка.Параметры.название = строка.Параметры.название + стр.Наименование;
		строка.Параметры.цена = стр.РекомендованаяЦена;
		строка.Параметры.бренд = стр.Бренд;
		НомЗам = "/"+стр.Артикул+"/"+стр.НомерПроизводителя+"/";
		Для Каждого стрК Из стр.Комплектность Цикл
			НомЗам = НомЗам + стрК.Артикул+"/";	
		КонецЦикла;
		Для Каждого стрР Из стр.НомераЗамен Цикл
			НомЗам = НомЗам + стрР.НомерЗамены+"/";	
		КонецЦикла;
		строка.Параметры.слова = НомЗам;
		ТабДокумент.Вывести(строка);
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()


&НаСервере
Функция ДанныеДляДиректа()
	Текст1 = 
	"ВЫБРАТЬ
	|	СправочникНоменклатура.Ссылка,
	|	СправочникНоменклатура.ВерсияДанных,
	|	СправочникНоменклатура.ПометкаУдаления,
	|	СправочникНоменклатура.Предопределенный,
	|	СправочникНоменклатура.Код,
	|	СправочникНоменклатура.Наименование,
	|	СправочникНоменклатура.Артикул,
	|	СправочникНоменклатура.НомерПроизводителя,
	|	СправочникНоменклатура.МестоНаСкладе,
	|	СправочникНоменклатура.Бренд,
	|	СправочникНоменклатура.АртикулПоиск,
	|	СправочникНоменклатура.НомерПоиск,
	|	СправочникНоменклатура.НаименованиеПолное,
	|	РегистрНакопления1Остатки.КолвоОстаток,
	|	СправочникНоменклатура.Комплектность.(
	|		Ссылка,
	|		НомерСтроки,
	|		Артикул,
	|		Наименование,
	|		Количество,
	|		Комментарий,
	|		НомерПоиск,
	|		Ссылка КАК Ссылка1,
	|		НомерСтроки КАК НомерСтроки1,
	|		Артикул КАК Артикул1,
	|		Наименование КАК Наименование1,
	|		Количество КАК Количество1,
	|		Комментарий КАК Комментарий1,
	|		НомерПоиск КАК НомерПоиск1
	|	),
	|	СправочникНоменклатура.РекомендованаяЦена КАК РекомендованаяЦена,
	|	СправочникНоменклатура.НомераЗамен.(
	|		Ссылка,
	|		НомерСтроки,
	|		НомерЗамены
	|	)
	|ИЗ
	|	Справочник.Номенклатура КАК СправочникНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура.НомераЗамен КАК НомЗамены
	|		ПО СправочникНоменклатура.Ссылка = НомЗамены.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|		ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар
	|ГДЕ
	|	СправочникНоменклатура.РекомендованаяЦена >= &минцена";
	Запрос = Новый Запрос;
	Запрос.Текст = Текст1;
	Запрос.УстановитьПараметр("минцена",МинимальнаяЦена);	
	зт = "";
	Если Бренд.Пустая() = Ложь Тогда
		зт = зт + " И СправочникНоменклатура.Бренд = &бренд";
		Запрос.УстановитьПараметр("бренд",Бренд);
	КонецЕсли;
	Если podkategoria.Пустая() = Ложь Тогда 
		зт = зт + " И СправочникНоменклатура.podkategoria = &podkat"		;
		Запрос.УстановитьПараметр("podkat",podkategoria);
	Иначе
		Если kategoria.Пустая() = Ложь Тогда 
			зт = зт + " И СправочникНоменклатура.Категория = &kat"		;
			Запрос.УстановитьПараметр("kat",kategoria);
		КонецЕсли;  	
	КонецЕсли;
	Если нал = Истина Тогда
		зт = зт + " И РегистрНакопления1Остатки.КолвоОстаток > 0 ";
		Запрос.Текст = Текст1;	
	КонецЕсли;
	Если СтрДлина(зт) > 1 Тогда
		Текст1 = Текст1 + зт;
	КонецЕсли;
	Текст1 = Текст1 + " УПОРЯДОЧИТЬ ПО РекомендованаяЦена УБЫВ";
	Запрос.Текст = Текст1;
	Возврат Запрос.Выполнить().Выгрузить();
КонецФункции

&НаКлиенте
Процедура ДляДиректа(Команда)
	Элементы.Группа3.Видимость = НЕ(Элементы.Группа3.Видимость);		
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеПриИзменении(Элемент)
	измПроизв();
КонецПроцедуры

&НаСервере
Процедура измПроизв()
   Текст1 = 
	"	ВЫБРАТЬ
	| СправочникНоменклатура.Ссылка,
	| СправочникНоменклатура.ВерсияДанных,
	| СправочникНоменклатура.ПометкаУдаления,
	| СправочникНоменклатура.Предопределенный,
	| СправочникНоменклатура.Код,
	| СправочникНоменклатура.Наименование,
	| СправочникНоменклатура.Артикул,
	| СправочникНоменклатура.НомерПроизводителя,
	| СправочникНоменклатура.МестоНаСкладе,
	| СправочникНоменклатура.МестоНаСкладе2,
	| СправочникНоменклатура.Бренд,
	| СправочникНоменклатура.АртикулПоиск,
	| СправочникНоменклатура.НомерПоиск,
	| СправочникНоменклатура.Фото,
	| СправочникНоменклатура.НаименованиеПолное,
	| РегистрНакопления1Остатки.КолвоОстаток,
	|   РезервОстатки.КолвоОстаток как КолвоОстаток1,
	| СправочникНоменклатура.Комплектность.(
	| 	Ссылка,
	| 	НомерСтроки,
	| 	Артикул,
	| 	Наименование,
	| 	Количество,
	| 	Комментарий,
	| 	НомерПоиск
	| ),
	|   СправочникНоменклатура.НаДиректе,
	|   СправочникНоменклатура.НаАвтолайне,
	|   СправочникНоменклатура.ЕстьТэги,
	|   СправочникНоменклатура.КрупныйАгрегат,
	|   СправочникНоменклатура.ЭтоНоваяЗапчасть,
	|   СправочникНоменклатура.РекомендованаяЦена
| ИЗ
	| Справочник.Номенклатура КАК СправочникНоменклатура
	| 	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	| 	ПО СправочникНоменклатура.Ссылка = РегистрНакопления1Остатки.Товар 
	|	ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Резерв.Остатки КАК РезервОстатки 
	|	ПО СправочникНоменклатура.Ссылка = РезервОстатки.Товар ";
	толькоНал = "";
		Если нал = Истина Тогда
			толькоНал = " РегистрНакопления1Остатки.КолвоОстаток > 0 И ";
		КонецЕсли;
	Если Поступление.Пустая() = Ложь Тогда
        Текст1 = Текст1 + " ГДЕ "+ толькоНал +" РегистрНакопления1Остатки.машина = &машина "		;
		Список.ТекстЗапроса= Текст1;
		Список.Параметры.УстановитьЗначениеПараметра("машина",Поступление);
		Если podkategoria.Пустая() = Ложь Тогда 
			Текст1 = Текст1 + " И СправочникНоменклатура.podkategoria = &podkat"		;
			Список.ТекстЗапроса= Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("podkat",podkategoria);
		Иначе
			Если kategoria.Пустая() = Ложь Тогда 
				Текст1 = Текст1 + " И СправочникНоменклатура.Категория = &kat"		;
				Список.ТекстЗапроса= Текст1;
				Список.Параметры.УстановитьЗначениеПараметра("kat",kategoria);
			КонецЕсли;  	
		КонецЕсли;
	Иначе
		Если podkategoria.Пустая() = Ложь Тогда 
			Текст1 = Текст1 + " ГДЕ "+ толькоНал +" СправочникНоменклатура.podkategoria = &podkat"		;
			Список.ТекстЗапроса= Текст1;
			Список.Параметры.УстановитьЗначениеПараметра("podkat",podkategoria);
		Иначе
			Если kategoria.Пустая() = Ложь Тогда 
				Текст1 = Текст1 + " ГДЕ СправочникНоменклатура.Категория = &kat"		;
				Список.ТекстЗапроса= Текст1;
				Список.Параметры.УстановитьЗначениеПараметра("kat",kategoria);
			Иначе
				Список.ТекстЗапроса= Текст1;	
			КонецЕсли;  	
		КонецЕсли;
	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьСпецпредложение(Команда)
	// Вставить содержимое обработчика.
	Если ПроверитьСП(ЭтаФорма.Элементы.Список.ТекущиеДанные.Код) = Истина Тогда
		Сообщить("Такое спецпредложение уже существует");
	Иначе
		сп = СоздатьСП(ЭтаФорма.Элементы.Список.ТекущиеДанные.Код);
        сп.ПолучитьФорму().ОткрытьМодально();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьСП(код)
	запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	Спецпредложения.Код
	               |ИЗ
	               |	Справочник.Спецпредложения КАК Спецпредложения
	               |ГДЕ
	               |	Спецпредложения.Товар.Код = &Код";
	запрос.УстановитьПараметр("Код",код);
	колво = запрос.Выполнить().Выгрузить().Количество();
	Если колво > 0 Тогда
		Возврат Истина;
	КонецЕсли;
	Возврат Ложь;
КонецФункции

&НаСервере
Функция СоздатьСП(код);
	Товар = Справочники.Номенклатура.НайтиПоКоду(код);
	сп = Справочники.Спецпредложения.СоздатьЭлемент();
	сп.Товар = Товар.Ссылка;
	сп.ДатаНачала = ТекущаяДата();
	сп.ДатаОкончания = ТекущаяДата();
	сп.Записать();
	
	Возврат сп.Ссылка;
КонецФункции

&НаКлиенте
Процедура ДобавитьВСчет(Команда)
	// Вставить содержимое обработчика.
	Струк = Новый Структура;
	Струк.Вставить("Команда","ПравильныйПоиск");	
	Код = Элементы.Список.ТекущаяСтрока.Код;
	Струк.Вставить("Код",Код);
	ФФФ = ЭтаФорма.ВладелецФормы;
	ОповеститьОВыборе(Струк);

КонецПроцедуры

&НаСервере
Функция ДобавитьВСчетСерв(ВыбранноеЗначение, СсылкаНом)
    Объект = ВыбранноеЗначение.ПолучитьОбъект();
	Объект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	Строка = Объект.Товары.Добавить();
    Строка.Товар = СсылкаНом;
	Строка.Количество = 0;
	Строка.Цена = СсылкаНом.РекомендованаяЦена;
	Объект.Записать(РежимЗаписиДокумента.Запись);
    Возврат Объект;
КонецФункции

&НаСервере
Функция НайтиДокПСчет(Код)
	Возврат Документы.ПеремещениеТоваров.НайтиПоНомеру(Код);
КонецФункции

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	Струк = Новый Структура;
	Струк.Вставить("Команда","ПравильныйПоиск");
	// ++ obrv 22.01.18
	//Код = Элементы.Список.ТекущаяСтрока.Код;
	Код = Элементы.Список.ТекущиеДанные.Код;
	// -- obrv 22.01.18
	Струк.Вставить("Код",Код);
	ФФФ = ЭтаФорма.ВладелецФормы;
	ОповеститьОВыборе(Струк);
КонецПроцедуры



