&НаКлиенте
Процедура СоздатьДокументЗакупка(Команда)
/// Комлев АА 25/11/24 +++
	ОткрытьФорму("Документ.ЗакупкаТовара.ФормаСписка");
	ФормаЗакупка = ОткрытьФорму("Документ.ЗакупкаТовара.Форма.ФормаДокумента");
	ФормаЗакупка.Объект.Ответственный = ПользователиКлиентСервер.ТекущийПользователь();
	ФормаЗакупка.ОбновитьОтображениеДанных();
/// Комлев АА 25/11/24 ---
КонецПроцедуры


&НаКлиенте
Процедура ФильтрПриИзменении(Элемент)
	Если Фильтр = 1 Тогда
		ТекстЗапросаПоступил();
	Иначе
		ТекстЗапросаОжидаем();
	КонецЕсли;
КонецПроцедуры

Процедура ТекстЗапросаПоступил()
	/// Комлев АА 25/11/24 +++
	Текст = "ВЫБРАТЬ
			|	ЗакупкаТовараЗакупленныйТовар.Товар,
			|	ЗакупкаТовараЗакупленныйТовар.Код,
			|	ЗакупкаТовараЗакупленныйТовар.Артикул,
			|	ЗакупкаТовараЗакупленныйТовар.Производитель,
			|	ЗакупкаТовараЗакупленныйТовар.Ссылка КАК ЗаказДеталей,
			|	ЗакупкаТовараЗакупленныйТовар.Ссылка.Поставщик,
			|	ЗакупкаТовараЗакупленныйТовар.НазначениеДетали,
			|	ЗакупкаТовараЗакупленныйТовар.Количество,
			|	ЗакупкаТовараЗакупленныйТовар.ЦенаЗакупки,
			|	ЗакупкаТовараЗакупленныйТовар.ЦенаПродажи,
			|	ЗакупкаТовараЗакупленныйТовар.Прибыль,
			|	ЗакупкаТовараЗакупленныйТовар.СуммаЗакупки,
			|	ЗакупкаТовараЗакупленныйТовар.СтатусПоступления
			|ИЗ
			|	Документ.ЗакупкаТовара.ЗакупленныйТовар КАК ЗакупкаТовараЗакупленныйТовар
			|ГДЕ
			|	ЗакупкаТовараЗакупленныйТовар.СтатусПоступления = ЗНАЧЕНИЕ(Перечисление.СтатусЗакупкиТовара.Поступил)";

	СписокЗакупленногоТовара.ПроизвольныйЗапрос = Истина;
	СписокЗакупленногоТовара.ТекстЗапроса = Текст;

	Элементы.СписокЗакупленногоТовара.Обновить();
	/// Комлев АА 25/11/24 ---
КонецПроцедуры

Процедура ТекстЗапросаОжидаем()
	/// Комлев АА 25/11/24 +++
	Текст = "ВЫБРАТЬ
			|	ЗакупкаТовараЗакупленныйТовар.Товар,
			|	ЗакупкаТовараЗакупленныйТовар.Код,
			|	ЗакупкаТовараЗакупленныйТовар.Артикул,
			|	ЗакупкаТовараЗакупленныйТовар.Производитель,
			|	ЗакупкаТовараЗакупленныйТовар.Ссылка КАК ЗаказДеталей,
			|	ЗакупкаТовараЗакупленныйТовар.Ссылка.Поставщик,
			|	ЗакупкаТовараЗакупленныйТовар.НазначениеДетали,
			|	ЗакупкаТовараЗакупленныйТовар.Количество,
			|	ЗакупкаТовараЗакупленныйТовар.ЦенаЗакупки,
			|	ЗакупкаТовараЗакупленныйТовар.ЦенаПродажи,
			|	ЗакупкаТовараЗакупленныйТовар.Прибыль,
			|	ЗакупкаТовараЗакупленныйТовар.СуммаЗакупки,
			|	ЗакупкаТовараЗакупленныйТовар.СтатусПоступления
			|ИЗ
			|	Документ.ЗакупкаТовара.ЗакупленныйТовар КАК ЗакупкаТовараЗакупленныйТовар
			|ГДЕ
			|	ЗакупкаТовараЗакупленныйТовар.СтатусПоступления = ЗНАЧЕНИЕ(Перечисление.СтатусЗакупкиТовара.ОжидаемПоступление)
			|	ИЛИ ЗакупкаТовараЗакупленныйТовар.СтатусПоступления = ЗНАЧЕНИЕ(Перечисление.СтатусЗакупкиТовара.ОтказВПоставке)";

	СписокЗакупленногоТовара.ПроизвольныйЗапрос = Истина;
	СписокЗакупленногоТовара.ТекстЗапроса = Текст;

	Элементы.СписокЗакупленногоТовара.Обновить();
	/// Комлев АА 25/11/24 ---
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Фильтр = 1;
КонецПроцедуры
&НаКлиенте
Процедура СписокЗакупленногоТовараВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
/// Комлев АА 25/11/24 ---
	Если Поле = Элементы.СписокЗакупленногоТовараЗаказДеталей Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.ЗаказДеталей);
			ОткрытьФорму("Документ.ЗакупкаТовара.Форма.ФормаДокумента", ПараметрыФормы);
		КонецЕсли;
	ИначеЕсли Поле = Элементы.СписокЗакупленногоТовараТовар Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Товар);
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
		КонецЕсли;
		Элементы.СписокЗакупленногоТовара.Обновить();
	КонецЕсли;
	/// Комлев АА 25/11/24 ---
КонецПроцедуры