&НаСервере
Процедура ВыгрузитьОтчёт() Экспорт
	таб=новый ТабличныйДокумент();
	
	СКД=Отчеты.ПродажиПоПриходам.ПолучитьМакет("Макет");
	Настройки=СКД.НастройкиПоУмолчанию;
	Дата1=Настройки.ПараметрыДанных.Элементы.Найти("НачалоПериода");
	Дата1.Значение=НачалоГода(ТекущаяДата());
	Дата2=Настройки.ПараметрыДанных.Элементы.Найти("КонецПериода");
	Дата2.Значение=КонецДня(ТекущаяДата());
	
	Расшифровка = Новый ДанныеРасшифровкиКомпоновкиДанных;
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;    
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, Настройки, Расшифровка);    
	ВнешниеПараметры = Новый Структура;    
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, ВнешниеПараметры, Расшифровка);    
	
	//Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(таб);    
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Истина);    	 
	таб.ПоказатьУровеньГруппировокСтрок(0);
	таб.Записать("D:\DropBox_DT\WorkTruck Dropbox\Work Truck\Отдел АВИТО\ПродажиПоПриходам.xls",ТипФайлаТабличногоДокумента.XLS);
КонецПроцедуры
