&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сотрудник = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя; 
		Объект.Инициатор = Справочники.Сотрудники.НайтиПоНаименованию(Сотрудник); 
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(Объект.Отдел) Тогда 
		ЗаполнениеСпискаВлияние();
		Элементы.ПланденьгиВлияния.Видимость = истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыРасхода_3НачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
				
				
				
				Объект.Категория 	= Неопределено;
				Объект.Статья 		= Неопределено;
				
				
				СтандартнаяОбработка = ЛОЖЬ;
				
			   Отбор = Новый Структура();
			   Отбор.Вставить("Родитель", Объект.Отдел);
			   Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
			   Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
			   Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			    
			   ПараметрыФормы = Новый Структура();
			   ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
			   ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
			   ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
			   ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
			   ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
			   ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
				ПараметрыФормы.Вставить("Отбор", Отбор);
			
				ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Виды_Расходов_3");
				Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
				ЭтаФорма, , , , ОбработкаВыбора);
				Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры


&НаКлиенте
Процедура ВлияниеПриИзменении(Элемент)
	Если ЗначениеЗаполнено(объект.Влияние) тогда 
		Элементы.ПланденьгиВлияния.Видимость = истина;
		Структура = ПолучитьданныеПоВлиянию(); 
		Объект.СуммаБюджетВлияние		= Структура.План;
		Объект.СуммаПотратилиВлияние= Структура	.Потратили;
		Объект.СуммаМожемПотратить	= Структура.МожемПотратить; 
	КонецЕсли; 
КонецПроцедуры

&НаСервере
Функция ПолучитьданныеПоВлиянию()
	Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ВидыРасходов_3ТаблицаВлияние.Ссылка КАК Ссылка,
			|	ВидыРасходов_3ТаблицаВлияние.Влияние КАК Влияние,
			|	ВидыРасходов_3ТаблицаВлияние.План КАК План
			|ИЗ
			|	Справочник.ВидыРасходов_3.ТаблицаВлияние КАК ВидыРасходов_3ТаблицаВлияние
			|ГДЕ
			|	ВидыРасходов_3ТаблицаВлияние.Ссылка = &Ссылка
			|	И ВидыРасходов_3ТаблицаВлияние.Влияние = &Влияние";
		
		Запрос.УстановитьПараметр("Ссылка", Объект.Отдел);
		Запрос.УстановитьПараметр("Влияние", Объект.Влияние);
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Структура = Новый Структура();
		
			Если 	ВыборкаДетальныеЗаписи.Количество() > 0 тогда 	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.План) Тогда 
						Структура.Вставить("План",ВыборкаДетальныеЗаписи.План );
					Иначе 
						Структура.Вставить("План",0);
					КонецЕсли; 
				КонецЦикла;
			 
			Иначе 
				Структура.Вставить("План",0);
			конецЕсли; 

	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СУММА(Расходы.Сумма) КАК Сумма
		|ИЗ
		|	Документ.Расходы КАК Расходы
		|ГДЕ
		|	Расходы.ДатаРасхода МЕЖДУ &Дата1 И КОНЕЦПЕРИОДА(&Дата2, День)
		|	И Расходы.Влияние = &Влияние";
	
	Запрос.УстановитьПараметр("Дата2", Объект.Дата);
	Запрос.УстановитьПараметр("Дата1", НачалоМесяца(Объект.Дата));
	Запрос.УстановитьПараметр("Влияние", Объект.Влияние);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если 	ВыборкаДетальныеЗаписи.Количество() > 0 тогда 	
				Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
					Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Сумма) Тогда 
						Структура.Вставить("Потратили",ВыборкаДетальныеЗаписи.Сумма );
					Иначе 
						Структура.Вставить("Потратили",0);
					КонецЕсли; 
				КонецЦикла;
			 
	Иначе 
				Структура.Вставить("Потратили",0);
	КонецЕсли; 
	
	Структура.Вставить("МожемПотратить",Структура.План - Структура.Потратили);
	
	Возврат Структура; 
КонецФункции


&НаСервере
Функция ПолучитьРодителяВидыРасходов_3()
	
	Родитель = Справочники.ВидыРасходов_3.НайтиПоКоду("000000001");
	Возврат Родитель ;

КонецФункции
&НаКлиенте
Процедура ФилиалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		Объект.СуммаБюджетВлияние		= Неопределено;
		Объект.СуммаПотратилиВлияние= Неопределено;
		Объект.СуммаМожемПотратить	= Неопределено; 
	Объект.ВидыРасхода_3 = Неопределено;  
	Объект.Категория 	= Неопределено;
	Объект.Отдел 		= Неопределено;
	Объект.Статья 		= Неопределено;
	Объект.Влияние		= Неопределено;
	
	СтандартнаяОбработка = ЛОЖЬ;
    Родитель = ПолучитьРодителяВидыРасходов_3();
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", Родитель);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Филиал");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

&НаКлиенте
Процедура ОтделНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
		
		Объект.СуммаБюджетВлияние		= Неопределено;
		Объект.СуммаПотратилиВлияние= Неопределено;
		Объект.СуммаМожемПотратить	= Неопределено; 
	
	Объект.Категория 	= Неопределено;
	Объект.Статья 		= Неопределено;
	Объект.Влияние		= Неопределено;
	Объект.ВидыРасхода_3 = Неопределено; 
	
	СтандартнаяОбработка = ЛОЖЬ;
    
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", объект.Филиал);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Отдел");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)


	Объект.Категория 	= Неопределено;
	Объект.Статья 		= Неопределено;

	
	СтандартнаяОбработка = ЛОЖЬ;
    
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", объект.Отдел);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Категория");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

&НаКлиенте
Процедура СтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЕСли ЗначениеЗаполнено(Объект.Категория) ТОгда 
		СтандартнаяОбработка = ЛОЖЬ;
		
	    Отбор = Новый Структура();
	    Отбор.Вставить("Родитель", Объект.Категория);
	    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
	    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
	    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	    
	    
	    ПараметрыФормы = Новый Структура();
	    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
	    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
	    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
	    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
	    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
	    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
		ПараметрыФормы.Вставить("Отбор", Отбор);
	
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Статья");
		Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
		ЭтаФорма, , , , ОбработкаВыбора);
		Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли; 	
	
	ЕСли НЕ ЗначениеЗаполнено(Объект.Категория) ТОгда 

	  	СтандартнаяОбработка = ЛОЖЬ;
		
	    Отбор = Новый Структура();
	    Отбор.Вставить("РодительРодитель", Объект.ВидыРасхода_3);
	    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
	    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
	    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	    
	    ПараметрыФормы = Новый Структура();
	    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
	    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
	    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
	    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
	    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
	    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
		ПараметрыФормы.Вставить("Отбор", Отбор);
	
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Статья");
		Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
		ЭтаФорма, , , , ОбработкаВыбора);
		Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнениеСпискаВлияние()
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыРасходов_3ТаблицаВлияние.Влияние КАК Влияние,
	|	ВидыРасходов_3ТаблицаВлияние.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Таб_ВидыРсх3
	|ИЗ
	|	Справочник.ВидыРасходов_3.ТаблицаВлияние КАК ВидыРасходов_3ТаблицаВлияние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлиянияРасходы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Таб_ВидыРсх3 КАК ВТ_Таб_ВидыРсх3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВлиянияРасходы КАК ВлиянияРасходы
	|		ПО (ВТ_Таб_ВидыРсх3.Влияние = ВлиянияРасходы.Ссылка)
	|ГДЕ
	|	ВТ_Таб_ВидыРсх3.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Отдел);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.Влияние.СписокВыбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Влияние.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт

   //Дополнительные условия если необходимо
   Если ДопПараметры = "Филиал" тогда

    	Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Филиал = Значение ///Если Множественный Выбор - то вернется массив 
    
    ИНачеЕсли ДопПараметры = "Отдел" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Отдел = Значение; ///Если Множественный Выбор - то вернется массив
   		ЗаполнениеСпискаВлияние(); 
     ИНачеЕсли ДопПараметры = "Категория" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Категория = Значение ///Если Множественный Выбор - то вернется массив
   
   ИНачеЕсли ДопПараметры = "Статья" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Статья = Значение;  ///Если Множественный Выбор - то вернется массив
   		
   		Если НЕ ЗначениеЗаполнено(Объект.Категория) ТОгда 
   			Объект.Категория = ОпределитьКатегориюСтатьи(Значение);
   		КонецЕсли;  
   		
   ИНачеЕсли ДопПараметры = "Статья2" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Статья = Значение ///Если Множественный Выбор - то вернется массив
   
    ИНачеЕсли ДопПараметры = "Виды_Расходов_3" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.ВидыРасхода_3 = Значение ///Если Множественный Выбор - то вернется массив
   
    КонецЕсли;
   
КонецПроцедуры

ФУНКЦИЯ ОпределитьКатегориюСтатьи(Значение)
	
	Возврат Значение.Родитель; 
	
КонецФункции