&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)	
	
	Если НЕ ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Сотрудник = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя; 
		Объект.Инициатор = Справочники.Сотрудники.НайтиПоНаименованию(Сотрудник); 
	КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Функция ПолучитьРодителяВидыРасходов_3()
	
	Родитель = Справочники.ВидыРасходов_3.НайтиПоКоду("000000001");
	Возврат Родитель ;

КонецФункции
&НаКлиенте
Процедура ФилиалНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Объект.Отдел 		= Неопределено;  
	Объект.Категория 	= Неопределено;
	Объект.Отдел 		= Неопределено;
	Объект.Категория 	= Неопределено;
	Объект.Статья 		= Неопределено;
	Объект.Влияние		= Неопределено;
	
	СтандартнаяОбработка = ЛОЖЬ;
    Родитель = ПолучитьРодителяВидыРасходов_3();
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", Родитель);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Филиал");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

&НаКлиенте
Процедура ОтделНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Объект.Категория 	= Неопределено;
	Объект.Отдел 		= Неопределено;
	Объект.Категория 	= Неопределено;
	Объект.Статья 		= Неопределено;
	Объект.Влияние		= Неопределено;
	
	СтандартнаяОбработка = ЛОЖЬ;
    
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", объект.Филиал);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Отдел");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

&НаКлиенте
Процедура КатегорияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)


	Объект.Категория 	= Неопределено;
	Объект.Статья 		= Неопределено;

	
	СтандартнаяОбработка = ЛОЖЬ;
    
    Отбор = Новый Структура();
    Отбор.Вставить("Родитель", объект.Отдел);
    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    
    ПараметрыФормы = Новый Структура();
    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
	ПараметрыФормы.Вставить("Отбор", Отбор);

	ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Категория");
	Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
	ЭтаФорма, , , , ОбработкаВыбора);
	Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
КонецПроцедуры

&НаКлиенте
Процедура СтатьяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ЕСли ЗначениеЗаполнено(Объект.Категория) ТОгда 
		СтандартнаяОбработка = ЛОЖЬ;
		
	    Отбор = Новый Структура();
	    Отбор.Вставить("Родитель", Объект.Категория);
	    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
	    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
	    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	    
	    
	    ПараметрыФормы = Новый Структура();
	    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
	    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
	    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
	    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
	    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
	    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
		ПараметрыФормы.Вставить("Отбор", Отбор);
	
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Статья");
		Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
		ЭтаФорма, , , , ОбработкаВыбора);
		Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	КонецЕсли; 	
	
	ЕСли НЕ ЗначениеЗаполнено(Объект.Категория) ТОгда 

	  	СтандартнаяОбработка = ЛОЖЬ;
		
	    Отбор = Новый Структура();
	    Отбор.Вставить("РодительРодитель", Объект.Отдел);
	    Отбор.Вставить("ПометкаУдаления", ЛОЖЬ);
	    Отбор.Вставить("ЭтоГруппа", ЛОЖЬ);
	    Отбор.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	    
	    ПараметрыФормы = Новый Структура();
	    ПараметрыФормы.Вставить("РежимВыбора", ИСТИНА);
	    ПараметрыФормы.Вставить("МножественныйВыбор", ЛОЖЬ);
	    ПараметрыФормы.Вставить("ЗакрыватьПриВыборе", ИСТИНА);
	    ПараметрыФормы.Вставить("РазрешитьВыборКорня", ЛОЖЬ);
	    ПараметрыФормы.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.Элементы);
	    ПараметрыФормы.Вставить("ЗакрыватьПриЗакрытииВладельца", ИСТИНА);
	    ПараметрыФормы.Вставить("ТолькоПросмотр", ЛОЖЬ);
		ПараметрыФормы.Вставить("Отбор", Отбор);
	
		ОбработкаВыбора = Новый ОписаниеОповещения("ПриЗакрытииФормыВыбора", ЭтаФорма,"Статья");
		Форм = ОткрытьФорму("Справочник.ВидыРасходов_3.Форма.ФормаВыбора",ПараметрыФормы,
		ЭтаФорма, , , , ОбработкаВыбора);
		Форм.Элементы.Список.Отображение = ОтображениеТаблицы.Список;
	
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнениеСпискаВлияние()
	запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВидыРасходов_3ТаблицаВлияние.Влияние КАК Влияние,
	|	ВидыРасходов_3ТаблицаВлияние.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_Таб_ВидыРсх3
	|ИЗ
	|	Справочник.ВидыРасходов_3.ТаблицаВлияние КАК ВидыРасходов_3ТаблицаВлияние
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВлиянияРасходы.Ссылка КАК Ссылка
	|ИЗ
	|	ВТ_Таб_ВидыРсх3 КАК ВТ_Таб_ВидыРсх3
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВлиянияРасходы КАК ВлиянияРасходы
	|		ПО (ВТ_Таб_ВидыРсх3.Влияние = ВлиянияРасходы.Ссылка)
	|ГДЕ
	|	ВТ_Таб_ВидыРсх3.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Объект.Отдел);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Элементы.Влияние.СписокВыбора.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Элементы.Влияние.СписокВыбора.Добавить(Выборка.Ссылка);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытииФормыВыбора(Значение, ДопПараметры) Экспорт

   //Дополнительные условия если необходимо
   Если ДопПараметры = "Филиал" тогда

    	Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Филиал = Значение ///Если Множественный Выбор - то вернется массив 
    
    ИНачеЕсли ДопПараметры = "Отдел" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Отдел = Значение; ///Если Множественный Выбор - то вернется массив
   		ЗаполнениеСпискаВлияние(); 
     ИНачеЕсли ДопПараметры = "Категория" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Категория = Значение ///Если Множественный Выбор - то вернется массив
   
   ИНачеЕсли ДопПараметры = "Статья" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Статья = Значение;  ///Если Множественный Выбор - то вернется массив
   		
   		Если НЕ ЗначениеЗаполнено(Объект.Категория) ТОгда 
   			Объект.Категория = ОпределитьКатегориюСтатьи(Значение);
   		КонецЕсли;  
   		
   ИНачеЕсли ДопПараметры = "Статья2" тогда
		
		Если Значение = Неопределено Тогда  ///Если ничего не выбрать - вернется пустое значение (Неопределено)
        	Возврат;
    	КонецЕсли;
    	Объект.Статья = Значение ///Если Множественный Выбор - то вернется массив
   
    КонецЕсли;
   
КонецПроцедуры

ФУНКЦИЯ ОпределитьКатегориюСтатьи(Значение)
	
	Возврат Значение.Родитель; 
	
КонецФункции