#Область ПрограммныйИнтерфейс

Процедура ПередЗавершениемРаботыСистемы(Отказ, ТекстПредупреждения) Экспорт
	
	Если НЕ дт_ПоказателиСотрудниковВызовСервера.ПоказателиУстановлены() Тогда
		УИ = ПользователиКлиентСервер.ТекущийПользователь().УникальныйИдентификатор();
		ПараметрыОткрытия = Новый Структура();
		ОткрытьФорму("Обработка.УстановкаПоказателейСотрудников.Форма", ПараметрыОткрытия, , УИ);
	КонецЕсли;
	
КонецПроцедуры


Процедура ПриНачалеРаботыСистемы() Экспорт
	
	// Пока без учета графика работы
	ТДата = ТекущаяДата();
	
	Если НЕ дт_ПоказателиСотрудниковВызовСервера.ПоказателиУстановлены(, ТДата) Тогда
		ПодключитьОбработчикОжидания("УстановитьПоказателиСотрудников", 60, Ложь);
	КонецЕсли;
	
	Если ДеньНедели(ТДата) = 1 Тогда
		ПредДень = НачалоДня(ТДата) - 86400 * 3;
	Иначе	
		ПредДень = НачалоДня(ТДата) - 86400;
	КонецЕсли;
	
	ПроверитьОткрытьФормуУстановкиПоказателей(ПредДень);
	
КонецПроцедуры


Процедура ПроверитьОткрытьФормуУстановкиПоказателей(Дата) Экспорт
	
	Если НЕ дт_ПоказателиСотрудниковВызовСервера.ПоказателиУстановлены(, Дата) Тогда
		УИ = ПользователиКлиентСервер.ТекущийПользователь().УникальныйИдентификатор();
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("Дата", Дата);
		ПараметрыОткрытия.Вставить("ЗапрещатьЗакрытиеБезДанных", Истина);
		ОткрытьФорму("Обработка.УстановкаПоказателейСотрудников.Форма", ПараметрыОткрытия, , УИ,,,, РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс);
	КонецЕсли;
	
КонецПроцедуры
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти