
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ВидРасхода", Справочники.ВидыРасходов.НайтиПоКоду("000000041"));
	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ДатаНачалаБезналБезНДС", Дата(2024, 11, 01));
	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ТекДата", ТекущаяДата());
	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоМесяца(ТекущаяДата()));
	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецМесяца(ТекущаяДата()));
	ПоказателиМенеджера.Параметры.УстановитьЗначениеПараметра("Менеджер", Справочники.Пользователи.НайтиПоНаименованию(ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя));
КонецПроцедуры
