#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс





#КонецОбласти

#Область ОбработчикиСобытий


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
	
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	
	Если Не ЗначениеЗаполнено(Период) Тогда
		Период = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
	
	ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	Для каждого СтрокаТаблицы Из Сотрудники Цикл
	
		Если СтрокаТаблицы.ТипДня = ПредопределенноеЗначение("Перечисление.ТипыДнейТабеля.РабочийДень")
			И Не ЗначениеЗаполнено(СтрокаТаблицы.Количество) Тогда
			
			Поле = ОбщегоНазначенияКлиентСервер.ПутьКТабличнойЧасти("Сотрудники", СтрокаТаблицы.НомерСтроки, "Количество");
			ТекстСообщения = СтрШаблон("Строка %1. Не заполнено поле Количество", СтрокаТаблицы.НомерСтроки);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, ЭтотОбъект, Поле, "Объект", Отказ);
				
			
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаТаблицы.Дата) И НачалоМесяца(СтрокаТаблицы.Дата) <> Период Тогда
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Строка %1. Дата не соответствует периоду %2",
					СтрокаТаблицы.НомерСтроки,
					Формат(Период, "ДФ='MMMM yy'")),
				,
				,
				,
				Отказ
			);
				
		КонецЕсли;
	
	КонецЦикла;
	
	
КонецПроцедуры


Процедура ПриКопировании(ОбъектКопирования)
	Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ДополнительныеСвойства.Вставить("ЭтоНовый",                    ЭтоНовый()); 
	ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь); 
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	
	ПараметрыПроведения = Документы.ТабельОтработанногоВремени.ПодготовитьПараметрыПроведения(Ссылка, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	
	// Формирование движений
	дт_Зарплата.ОтразитьОтработанноеВремя(ПараметрыПроведения, Движения, Отказ);
	
КонецПроцедуры




#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли





