
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Баланс Приход
	Движения.Баланс.Записывать = Истина;
	Движение = Движения.Баланс.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Измерение1 = Счет;
	Движение.Баланс = Сумма;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!
	


Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ВложенияВолжска.СуммаДолга КАК Долг
	|ИЗ
	|	Справочник.ВложенияВолжска КАК ВложенияВолжска
	|ГДЕ
	|	ВложенияВолжска.Ссылка = &Ссылка";

Запрос.УстановитьПараметр("Ссылка", КредитВБанке);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СуммаДолга = ВыборкаДетальныеЗаписи.Долг;
	Записать(); 
КонецЦикла;


КонецПроцедуры
