#Область ПрограммныйИнтерфейс

Функция ПолучитьСтавкуНалогаНаПрибыль(Организация, Дата = '00010101') Экспорт
	
	Результат = 0;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СтавкиНалогаНаПрибыльСрезПоследних.Ставка,
		|	0 КАК Приоритет
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаПрибыль.СрезПоследних(&Дата, Организация = &Организация) КАК
		|		СтавкиНалогаНаПрибыльСрезПоследних
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	СтавкиНалогаНаПрибыльСрезПоследних.Ставка,
		|	1
		|ИЗ
		|	РегистрСведений.СтавкиНалогаНаПрибыль.СрезПоследних(&Дата,
		|		Организация = ЗНАЧЕНИЕ(Справочник.Организация.ПустаяСсылка)) КАК СтавкиНалогаНаПрибыльСрезПоследних
		|УПОРЯДОЧИТЬ ПО
		|	Приоритет";
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Организация", Организация);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Результат = ВыборкаДетальныеЗаписи.Ставка; 
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти