&НаСервере
Функция ПолучитьПартиюПоКоду(Код, СкладСнабжение, ДокументПоступления, Отказ = ложь) Экспорт

	///+ГомзМА 12.04.2023
	эл = Неопределено;
	
	// Сначала ищем старую партию (без владельца)
	рез = Справочники.ИнвентарныеНомера.НайтиПоНаименованию(код,,, Справочники.СкладСнабжение.ПустаяСсылка());
	Если рез.Пустая() Тогда
		рез = Справочники.ИнвентарныеНомера.НайтиПоНаименованию(код,,, СкладСнабжение);
	КонецЕсли;
	
	Если ДокументПоступления <> Неопределено Тогда
		Если рез.Пустая() Тогда
			эл = Справочники.ИнвентарныеНомера.СоздатьЭлемент();
			эл.Владелец = СкладСнабжение;
			эл.Наименование = код;
			эл.ДатаПоступления = ДокументПоступления.Дата;
			эл.ДокументПоступления = ДокументПоступления.Ссылка;
		Иначе
			СвойстваПартии = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(рез, "ДатаПоступления,Владелец,ДокументПоступления");
			Если СвойстваПартии.ДатаПоступления <> ДокументПоступления.Дата 
				ИЛИ НЕ ЗначениеЗаполнено(СвойстваПартии.Владелец)
				ИЛИ НЕ СвойстваПартии.ДокументПоступления = ДокументПоступления.Ссылка Тогда
				
				эл = рез.ПолучитьОбъект();
				эл.ДатаПоступления = ДокументПоступления.Дата;
				эл.Владелец = СкладСнабжение;
				эл.ДокументПоступления = ДокументПоступления.Ссылка;
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если эл <> неопределено Тогда
	
		Попытка
		
			эл.Записать();	
		
		Исключение
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				СтрШаблон("Не удалось записать партию %1. %2",
					эл,
					ОписаниеОшибки()),
				,
				,
				,
				Отказ
			);
				
		
		КонецПопытки;
		
		рез = эл.Ссылка;
		
	КонецЕсли;
	
	возврат рез;
	

КонецФункции // ПолучитьПартиюПоКоду()

&НаСервере
Функция СоздатьНовыйЭлемент(ДанныеЗаполнения, Отказ) Экспорт
	
	Результат = Неопределено;
	
	КодТМЦ = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.ТМЦ, "Код");
	КодТМЦ = дт_ПрефиксацияКлиентСервер.НомерНаПечать(КодТМЦ);
	
	// Получим свободный номер
	СвободныйНомер = ПолучитьСвободныйНомер(ДанныеЗаполнения.ТМЦ);
	
	Если ТипЗнч(ДанныеЗаполнения.ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТМЦВорктрак") Тогда
		КодНовый = "В-000" + Формат(КодТМЦ, "ЧЦ=10;ЧГ=0") + "_" + СвободныйНомер;
	ИначеЕсли ТипЗнч(ДанныеЗаполнения.ДокументПоступления) = Тип("ДокументСсылка.ПоступлениеТМЦСкладСнабжение") Тогда
		КодНовый = "Т-000" + Формат(КодТМЦ, "ЧЦ=10;ЧГ=0") + "_" + СвободныйНомер;
	КонецЕсли;
	
	Спр = Справочники.ИнвентарныеНомера.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(Спр, ДанныеЗаполнения);
	Спр.Владелец 					= ДанныеЗаполнения.ТМЦ;
	Спр.Наименование 				= КодНовый;
	Спр.Стоимость 					= ДанныеЗаполнения.Цена;
	Спр.СтатусИнвентарногоНомераТМЦ = Перечисления.СтатусыИнвентарныхНомеровТМЦ.ВНаличии;
	
	Попытка
		Спр.Записать();
		Результат = Спр.Ссылка;
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
		СтрШаблон("Не удалось записать партию %1. %2",
		Спр,
		ОписаниеОшибки()),
		,
		,
		,
		Отказ
		);
	КонецПопытки;
	
	///+ГомзМА 26.04.2023
	//Записываем наименование по накладкой в регистр сведений
	ЗаписьВРегистреСведений 				 = РегистрыСведений.НаименованиеТМЦПоНакладной.СоздатьМенеджерЗаписи();
	ЗаписьВРегистреСведений.ТМЦ  			 = ДанныеЗаполнения.ТМЦ;
	ЗаписьВРегистреСведений.ИнвентарныйНомер = Спр.Ссылка;
	ЗаписьВРегистреСведений.Прочитать();
	Если (Не ЗаписьВРегистреСведений.Выбран()) И (Не ПустаяСтрока(ДанныеЗаполнения.ТМЦПоНакладной)) Тогда
		ЗаписьВРегистреСведений.ТМЦ  	 		 = ДанныеЗаполнения.ТМЦ;
		ЗаписьВРегистреСведений.ИнвентарныйНомер = Спр.Ссылка;
		ЗаписьВРегистреСведений.НаименованиеТМЦ  = ДанныеЗаполнения.ТМЦПоНакладной;
		
		ЗаписьВРегистреСведений.Записать();
	Иначе
		ЗаписьВРегистреСведений.НаименованиеТМЦ = ДанныеЗаполнения.ТМЦПоНакладной;
		ЗаписьВРегистреСведений.Записать(Истина);
	КонецЕсли;
	///-ГомзМА 26.04.2023
	
	Возврат Результат;
	
КонецФункции

Функция ПолучитьСвободныйНомер(ТМЦ) Экспорт
	
	запрос = новый запрос;
	запрос.Текст = "ВЫБРАТЬ
	|	ИнвентарныеНомера.Ссылка
	|ИЗ
	|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
	|ГДЕ
	|	ИнвентарныеНомера.Владелец = &Владелец
	|	И ИнвентарныеНомера.Наименование ПОДОБНО &СтрокаПоиска";
	
	Запрос.УстановитьПараметр("Владелец", ТМЦ);
	Запрос.УстановитьПараметр("СтрокаПоиска", "%_" + "_%");
	
	Результат = запрос.Выполнить().Выгрузить().Количество() + 1;
	
	возврат Результат;
	
КонецФункции