
	Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		Параметры = КомпоновщикНастроек.Настройки.ПараметрыДанных;
		Если Не Пользователи.РолиДоступны("ПолныеПрава") тогда
			Параметры.УстановитьЗначениеПараметра("Подразделение",ПолучитьПодразделение().подразделение);
			Если НЕ Пользователи.РолиДоступны("Руководитель") тогда			
				параметры.УстановитьЗначениеПараметра("Сотрудник",ПолучитьПодразделение().Сотрудник);
			КонецЕсли;
		КонецЕсли;
		
	КонецПроцедуры

Функция ПолучитьПодразделение()
	Запрос = Новый запрос;
	
	Запрос.Текст =  "ВЫБРАТЬ
	                |	ДолжностиСотрудниковСрезПоследних.Подразделение КАК Подразделение,
	                |	ДолжностиСотрудниковСрезПоследних.Сотрудник КАК Сотрудник
	                |ИЗ
	                |	РегистрСведений.ДолжностиСотрудников.СрезПоследних КАК ДолжностиСотрудниковСрезПоследних
	                |ГДЕ
	                |	ДолжностиСотрудниковСрезПоследних.Сотрудник.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("Пользователь",Пользователи.ТекущийПользователь());
	Выборка = Запрос.Выполнить().Выбрать();
	
	Выборка.Следующий();
	
	Возврат Выборка;
	
КонецФункции

