//Волков ИО 09.02.24 ++
Процедура РасчетСрокаОкупаемостиАвто() Экспорт
		
	Авто = "";
	СуммаАвто = 0;
	ДатаПоступленияАвто = '00010101';
	ДатаКогдаРентабельностьНоль = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ 
	|	Машины.Ссылка КАК Ссылка,
	|	Машины.Сумма КАК Сумма,
	|	Машины.Дата КАК ДатаПоступленияАвто,
	|	Машины.ДатаОкупаемостиАвто КАК ДатаОкупаемостиАвто,
	|	Машины.СрокОкупаемостиВМесяцах КАК СрокОкупаемостиВМесяцах
	|ИЗ
	|	Справочник.Машины КАК Машины";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		//Отбираем машину Проверяем заполненость рекв СрокОкупаемостиВМес. Если заполнен - расчеты не производятся.  
		СрокОкупаемостиВМес = РезультатЗапроса.СрокОкупаемостиВМесяцах;
		Если Не ЗначениеЗаполнено(СрокОкупаемостиВМес) Тогда 
			Авто = РезультатЗапроса.Ссылка;
			СуммаАвто = РезультатЗапроса.Сумма;	
			ДатаПоступленияАвто =  РезультатЗапроса.ДатаПоступленияАвто;
			//Смотрим все документы продаж по машине, Отбираем документ, когда СуммаПродаж с авто > Стоимости машины. Записываем дату в рекв. ДатаОкупаемостиАвто 
			ДатаКогдаРентабельностьНоль = РасчитатьДатуОкупаемостиАвто(Авто, СуммаАвто, ДатаПоступленияАвто);	
			ОбъектСправочника = РезультатЗапроса.Ссылка.ПолучитьОбъект();
			ОбъектСправочника.ДатаОкупаемостиАвто = ДатаКогдаРентабельностьНоль;
			ОбъектСправочника.Записать();
			//Расчитываем срок окупаемости авто в месяцах. ДатаОкупаемости авто - ДатаПоступленияАвто
			РасчитатьСрокОкупаемостиВМесяцахАвто(Авто)
			
		Иначе
			
			Продолжить
			
		КонецЕсли		
		
	КонецЦикла;
	
КонецПроцедуры        

Процедура РасчитатьСрокОкупаемостиВМесяцахАвто(Авто)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Машины.Ссылка КАК Ссылка,
	|	Машины.Дата КАК Дата,
	|	Машины.ДатаОкупаемостиАвто КАК ДатаОкупаемостиАвто,
	|	РАЗНОСТЬДАТ(Машины.Дата, Машины.ДатаОкупаемостиАвто, МЕСЯЦ) КАК ОкупаемастьВМесяцах
	|ИЗ
	|	Справочник.Машины КАК Машины
	|ГДЕ
	|	Машины.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Авто);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		ОкупаемастьВМесяцах = РезультатЗапроса.ОкупаемастьВМесяцах;
		
		ОбъектСправочника = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ОбъектСправочника.СрокОкупаемостиВМесяцах = ОкупаемастьВМесяцах;
		ОбъектСправочника.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

Функция  РасчитатьДатуОкупаемостиАвто(Авто, СуммаАвто, ДатаПоступленияАвто)
	
	СуммаПродаж = 0;
	ДатаКогдаРентабельностьНоль = '00010101';
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ПродажаЗапчастейТаблица.Товар КАК Товар,
	|	ПродажаЗапчастейТаблица.машина КАК машина,
	|	ПродажаЗапчастейТаблица.Ссылка КАК Ссылка,
	|	ПродажаЗапчастейТаблица.Сумма КАК Сумма,
	|	ПродажаЗапчастейТаблица.Ссылка.Дата КАК ДатаДокумента
	|ИЗ
	|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
	|ГДЕ
	|	ПродажаЗапчастейТаблица.машина = &машина";
	
	Запрос.УстановитьПараметр("машина", Авто);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл
		
		СуммаПродаж = СуммаПродаж + РезультатЗапроса.Сумма;
		
		Если СуммаПродаж >= СуммаАвто Тогда 
			
			ДатаКогдаРентабельностьНоль	= РезультатЗапроса.ДатаДокумента;
			Возврат ДатаКогдаРентабельностьНоль; 
		КонецЕсли;
	КонецЦикла; 
	
КонецФункции     
//Волков ИО 09.02.24 