
&НаКлиенте
Процедура ДобавитьКартинку(Команда)
	ИмяФайла = "";
	ПутьФайла = "";
	//Вызываем Диалоговое окно и помещаем файл Картинки из локальной файловой системы во временное хранилище
	Если ПоместитьФайл(ПутьФайла, , ИмяФайла, Истина) = Истина Тогда
	 
	//в строковый реквизит ФОТО нашей формы сохраняем ссылку на Картинку во временном хранилище
	Фото = ПутьФайла;
	//для создания нового элемента в Справочнике Файлы и записи Картинки в его реквизит Файл
	//переходим на сервер с помощью вызова серверной процедуры
	УстановитьКартинку();
	КонецЕсли; 
	//условие ЕСЛИ нужно для того, чтобы если пользователь отказался от выбора файла
	//мы не вызывали серверную процедуру УстановитьКартинку()
КонецПроцедуры

&НаСервере
Процедура УстановитьКартинку()
	
	Объект.Ссылка.ПолучитьОбъект().Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Фото));
	Фото = ПоместитьВоВременноеХранилище(Объект.Файл.Получить());
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.Ссылка.Пустая() <> Истина Тогда 
		Фото = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл");  
		//устанавливаем автомасштаб для картинки  		
	КонецЕсли;
	Элементы.Фото.РазмерКартинки = РазмерКартинки.Пропорционально;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьПоставщика(Команда)
	ОткрытьФорму("Справочник.Контрагенты.ФормаОбъекта");
КонецПроцедуры
