
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс



#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ПолучитьФункциональнуюОпцию("дт_ИспользоватьГрузоперевозки") Тогда
		ПроверяемыеРеквизиты.Добавить("МаркаТС");
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	ГосНомер = ВРЕГ(ГосНомер);	
	//Мазин ---------------
	ИмяТекПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	ЗаказчикСотрудник = Справочники.Сотрудники.НайтиПоНаименованию(ИмяТекПользователя); 
	//Мазин----------------
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	///+ГомзМА 29.09.2023
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ФиксацияЗаказаМашин") Тогда
		ДокументФиксацииЗаказаМашины = ДанныеЗаполнения.Ссылка;
	КонецЕсли
	///-ГомзМА 29.09.2023
	
КонецПроцедуры



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли