#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


#Область Печать
// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати – ТаблицаЗначений – состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
КонецПроцедуры

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Накладная") Тогда
	//	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Накладная", "Расходная накладная", 
	//		ПечатьДокумента(МассивОбъектов, ОбъектыПечати),,"Документ.РеализацияТоваровУслуг.ПФ_MXL_Накладная");
	//КонецЕсли;
	
	//ОбщегоНазначенияБП.ЗаполнитьДополнительныеПараметрыПечати(МассивОбъектов,
	//	КоллекцияПечатныхФорм,
	//	ОбъектыПечати,
	//	ПараметрыВывода);
	
КонецПроцедуры


	
#КонецОбласти 

#КонецОбласти

#Область ОбработчикиСобытий

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс
Функция ПолучитьЦенуПоРасспродажеИлиРекЦену(Номенклатура, ДатаДокумента) Экспорт 
	// Комлев АА +++
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЕСТЬNULL(РасспродажаТовараСрезПоследних.Цена, 0) КАК ЦенаПоРасспродаже,
	|	СпрНоменклатура.РекомендованаяЦена КАК РекомендованаяЦена,
	|	СпрНоменклатура.Наименование КАК Наименование
	|ИЗ
	|	Справочник.Номенклатура КАК СпрНоменклатура
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РасспродажаТовара.СрезПоследних(, ) КАК РасспродажаТовараСрезПоследних
	|		ПО (РасспродажаТовараСрезПоследних.Номенклатура = СпрНоменклатура.Ссылка)
	|			И (РасспродажаТовараСрезПоследних.ДатаНачала <= &ДатаДокумента)
	|			И (РасспродажаТовараСрезПоследних.ДатаОкончания >= &ДатаДокумента)
	|ГДЕ
	|	СпрНоменклатура.Ссылка = &Номенклатура
	|
	|УПОРЯДОЧИТЬ ПО
	|	РасспродажаТовараСрезПоследних.Период УБЫВ";
	
	Запрос.УстановитьПараметр("ДатаДокумента", ДатаДокумента);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат 0;
	КонецЕсли;
	Выборка = РезультатЗапроса.Выбрать();		
	Выборка.Следующий();
	Если Выборка.ЦенаПоРасспродаже <> 0 Тогда 
		Сообщить("На товар " + Выборка.Наименование + " действует акция - цена: " + Выборка.ЦенаПоРасспродаже);
		Возврат Выборка.ЦенаПоРасспродаже;
	Иначе
		Возврат Выборка.РекомендованаяЦена;
	КонецЕсли;
    // Комлев АА ---
КонецФункции


#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли