#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ПриУстановкеНовогоНомера(СтандартнаяОбработка, Префикс)
	
	///+ТатарМА 15.10.2024
	Префикс = "З-";
	///-ТатарМА 15.10.2024
	
КонецПроцедуры
	
#Область ПрограммныйИнтерфейс
	
	
	
#КонецОбласти
	
#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
		WTPanel = Справочники.СтатусыWT.НайтиПоНаименованию("Обращение");
		СтатусОбработки = Перечисления.СтатусыОбработкиЗаявок.ВОбработке;

		ТипЗаявки = Перечисления.ТипЗаявки.Продажа;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПродажаЗапчастей") Тогда
			
			//ЗаполнениеДокументов.ЗаполнитьПоОснованию(ЭтотОбъект, ДанныеЗаполнения);
			
			Запрос = Новый Запрос;
			Запрос.Текст =
			"ВЫБРАТЬ
			|	Док.Клиент,
			|	Док.Комментарий,
			|	Док.Проект,
			|	Док.Склад,
			|	Клиенты.Наименование КАК КлиентНаименование,
			|	Клиенты.Телефон КАК НомерТелефона
			|ИЗ
			|	Документ.ПродажаЗапчастей КАК Док
			|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Клиенты КАК Клиенты
			|		ПО Док.Клиент = Клиенты.Ссылка
			|ГДЕ
			|	Док.Ссылка = &Ссылка
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	Товары.НомерСтроки КАК НомерСтроки,
			|	Товары.Товар КАК Номенклатура,
			|	Товары.Количество,
			|	Товары.Цена,
			|	Товары.Сумма
			|ИЗ
			|	Документ.ПродажаЗапчастей.Таблица КАК Товары
			|ГДЕ
			|	Товары.Ссылка = &Ссылка
			|
			|УПОРЯДОЧИТЬ ПО
			|	НомерСтроки";
			
			
			Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
			
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			Шапка = ОбщегоНазначения.СтрокаТаблицыЗначенийВСтруктуру(РезультатЗапроса[0].Выгрузить()[0]);
			
			ЗаполнениеДокументов.Заполнить(ЭтотОбъект, Шапка);
			Товары.Загрузить(РезультатЗапроса[1].Выгрузить());
			
		КонецЕсли;
		
		Если ТипЗнч(ДанныеЗаполнения) = Тип("строка") Тогда
			
			НомерТелефона = ДанныеЗаполнения;
			
		КонецЕсли;
		
		//ЗаполнениеДокументов.Заполнить(ЭтотОбъект, ДанныеЗаполнения);
		
		Если Не ЗначениеЗаполнено(Состояние) Тогда
			Состояние = Перечисления.дт_СостоянияЗаказовКлиента.Ожидание;
		КонецЕсли;
		
		ДатаИзмененияСостояния = Дата;
		ДатаСвязи              = ТекущаяДата()+25;
		
		Если Не Пользователи.РолиДоступны("ТекстовыйМенеджер") тогда
			Ответственный      = Пользователи.ТекущийПользователь();
		КонецЕсли;
		 
		//Если Не ЗначениеЗаполнено(Склад) Тогда
		//	Склад = Справочники;
		//КонецЕсли;
		WTPanel = Справочники.СтатусыWT.НайтиПоКоду("000000014");
//ОткрытьВремяЗК(Ссылка, Справочники.Пользователи.ПустаяСсылка(), Справочники.СтатусыWT.НайтиПоКоду("000000009"))		
КонецПроцедуры

Процедура ОткрытьВремяЗК(ЗК, Ответственный, Статус)

	НаборЗаписей = РегистрыСведений.ВремяВыполненияЗаявок.СоздатьМенеджерЗаписи();

	НаборЗаписей.ЗаявкаПродажа = ЗК ;
	НаборЗаписей.Период        = ТекущаяДата();
	НаборЗаписей.НачалоЗамера  = ТекущаяДата();
	НаборЗаписей.КонецЗамера   = ТекущаяДата();
	НаборЗаписей.Ответственный = Ответственный;
	НаборЗаписей.Статус = Статус;
	НаборЗаписей.Записать();

КонецПроцедуры
	
Процедура ПриКопировании(ОбъектКопирования)
		Дата = НачалоДня(ОбщегоНазначения.ТекущаяДатаПользователя());
		Ответственный = Пользователи.ТекущийПользователь();
		
КонецПроцедуры
	
Процедура ОбработкаУдаленияПроведения(Отказ)
		ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
		Движения.Записать();
		
КонецПроцедуры
		
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
		
	ДополнительныеСвойства.Вставить("ЭтоНовый",                    ЭтоНовый()); 
	ДополнительныеСвойства.Вставить("ДатаДокументаСдвинутаВперед", Ложь); 
	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);

	/// Комлев 24/05/24 +++
	Макаров = Справочники.Пользователи.НайтиПоНаименованию("Макаров Егор Вячеславович");
	Если Ответственный = Макаров Тогда
		Отказ = Истина;
	КонецЕсли;
	/// Комлев 24/05/24 +++
	
	//==================================================================================================================
	//Акция 10 10. Движение по ркгистру накопления Акция10
	Если УчаствуетВАкции10 = истина Тогда 
		
		Движения.РегистрАкция10.Записывать = Истина;
		Движения.Записать();
		Движения.РегистрАкция10.Записывать = Истина;
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказКлиента.Номенклатура КАК Товар,
			|	ЗаказКлиента.Партия КАК индкод,
			|	СУММА(ЕСТЬNULL(ЗаказКлиента.Количество, 0)) КАК Количество,
			|	ЗаказКлиента.Цена
			|ПОМЕСТИТЬ ВТ_ТЧЗаказКлиента
			|ИЗ
			|	Документ.ЗаказКлиента.Товары КАК ЗаказКлиента
			|ГДЕ
			|	ЗаказКлиента.Ссылка = &Ссылка
			|	И ЗаказКлиента.Партия <> ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
			|СГРУППИРОВАТЬ ПО
			|	ЗаказКлиента.Номенклатура,
			|	ЗаказКлиента.Партия,
			|	ЗаказКлиента.Цена
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_ТЧЗаказКлиента.Товар КАК Товар,
			|	ВТ_ТЧЗаказКлиента.индкод КАК индкод,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_ТЧЗаказКлиента.Товар) КАК ПредставлениеТовар,
			|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ВТ_ТЧЗаказКлиента.индкод) КАК ПредставлениеИндкод,
			|	ЕСТЬNULL(РегистрАкция10Остатки.КолвоОстаток, 0) КАК Остаток,
			|	ЕСТЬNULL(ВТ_ТЧЗаказКлиента.Количество, 0) КАК Количество,
			|	РегистрАкция10Остатки.Склад КАК Склад,
			|	РегистрАкция10Остатки.машина КАК Машина,
			|	ВТ_ТЧЗаказКлиента.Цена КАК Цена
			|ИЗ
			|	ВТ_ТЧЗаказКлиента КАК ВТ_ТЧЗаказКлиента
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.РегистрАкция10.Остатки(&МоментВремени, (Товар, индкод) В
			|			(ВЫБРАТЬ
			|				Т.Товар,
			|				Т.индкод
			|			ИЗ
			|				ВТ_ТЧЗаказКлиента КАК Т)) КАК РегистрАкция10Остатки
			|		ПО ВТ_ТЧЗаказКлиента.индкод = РегистрАкция10Остатки.индкод";
		
		
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
	    Запрос.УстановитьПараметр("МоментВремени", ТекущаяДатаСеанса());
	    РезультатЗапроса = Запрос.Выполнить();
		
		Если РезультатЗапроса.Пустой() Тогда 
			Возврат; 
		КонецЕсли; 
		
		ВыборкаТовары = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл
			 Дефицит = ВыборкаТовары.Количество - ВыборкаТовары.Остаток;
	       
			Если Дефицит>0 Тогда
	            Отказ = Истина;
	            Сообщение = Новый СообщениеПользователю;
	            Сообщение.Текст = "Номенклатура: "+ВыборкаТовары.ПредставлениеТовар + " Партия: " + ВыборкаТовары.ПредставлениеИндкод + " недостаточно в количестве "+Дефицит+" шт.";
	            Сообщение.Сообщить();
	        КонецЕсли;
	       
	        //  Переход в начало цикла, если были ошибки
	        Если Отказ Тогда
	            Продолжить;
	        КонецЕсли;
	       
	        //  Выполнение движений в регистры
	
				Движение			 = Движения.РегистрАкция10.ДобавитьРасход();
				Движение.Период		 = Дата;
				Движение.Товар		 = ВыборкаТовары.Товар;
				Движение.индкод		 = ВыборкаТовары.индкод;
				Движение.Склад		 = ВыборкаТовары.Склад;
				Движение.машина		 = ВыборкаТовары.машина;
				Движение.Колво		 = ВыборкаТовары.Количество;
				//
				Движение.Цена		 = ВыборкаТовары.Цена;
	    		//
	КонецЦикла;
		
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Провел документ С контролем остатков "; 
		Сообщение.Сообщить();
	
	КонецЕсли; 	
	//==================================================================================================================	
КонецПроцедуры
		
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)

		Если ОбменДанными.Загрузка Тогда
			Возврат;
		КонецЕсли;
		СуммаТоваров   = дт_ОбщегоНазначения.ИтоговаяСумма(ЭтотОбъект, "Товары", "Отменено");
		Если СуммаТоваров > 0 Тогда
			СуммаДокумента = СуммаТоваров;
		КонецЕсли;

		Если Состояние = Перечисления.дт_СостоянияЗаказовКлиента.СобираетсяНаСкладе И НЕ ЗначениеЗаполнено(СтатусОбработкиЗаявкиКладовщиком) Тогда
			СтатусОбработкиЗаявкиКладовщиком = Перечисления.СтатусыОбработкиЗаявокКладовщиком.НоваяЗаявка;
		КонецЕсли;
		
		СуммаПредлагаемойЦены = Товары.Итог("ПредлагаемаяЦена");
		
		Если Состояние = Перечисления.дт_СостоянияЗаказовКлиента.ЖдёмДенег Или Состояние
			= Перечисления.дт_СостоянияЗаказовКлиента.Продажа Тогда
			Целевая = Истина;
		КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		СтатусОбработкиЗаявкиКладовщиком = Перечисления.СтатусыОбработкиЗаявокКладовщиком.НоваяЗаявка;
	КонецЕсли;

	ПересчетТЧТоварыНаСервере() ; 
	// Этапирование заявки +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
	Этап = ЭтапированиеЗаявки(); 
	Если ЗначениеЗаполнено(Этап) Тогда 
		ЭтапыПродажи = Этап; 
	КонецЕСли; 
	// -----------------------------------------------------------------------------------------------------------------	
КонецПроцедуры
// ОбновитьПродажуТЧ +++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

Процедура ОбновитьПродажуТЧ()
	Попытка
	Заблокирована = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Продажа, "Заблокирована");
	Если Не Заблокирована Тогда
		ОбъектПродажа = Продажа.ПолучитьОбъект();
		НаборЗаписей=РегистрыНакопления.РегистрНакопления1.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить (Продажа);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();   
	
		ОбъектПродажа.Таблица.Очистить();
		Для Каждого СтрокаТЧЗаявки Из Товары Цикл
			НоваяСтрока = ОбъектПродажа.Таблица.Добавить();
			НоваяСтрока.Партия = СтрокаТЧЗаявки.Партия;
			НоваяСтрока.Товар = СтрокаТЧЗаявки.Номенклатура;
			Если ЗначениеЗаполнено(СтрокаТЧЗаявки.Партия) Тогда
				Структура = ПолучитьСкладПоПартии(СтрокаТЧЗаявки.Партия);
				НоваяСтрока.Склад = Структура.Склад;
				НоваяСтрока.машина = Структура.Машина;
			Иначе
				НоваяСтрока.Склад = Справочники.Склады.НайтиПоКоду("000000002");
			КонецЕсли;
			НоваяСтрока.МестоХранения = ПолучитьАдрес(СтрокаТЧЗаявки.Номенклатура, НоваяСтрока.Склад,СтрокаТЧЗаявки.Партия);
			НоваяСтрока.Количество = СтрокаТЧЗаявки.Количество;
			НоваяСтрока.Цена = СтрокаТЧЗаявки.Цена;
			НоваяСтрока.СуммаНДС = СтрокаТЧЗаявки.СуммаНДС;
			НоваяСтрока.Сумма = СтрокаТЧЗаявки.Сумма;
			НоваяСтрока.СтатусТовара = СтрокаТЧЗаявки.Выдан;
			НоваяСтрока.Отменено = СтрокаТЧЗаявки.Отменено; 
			НоваяСтрока.ДатаВыдачи = СтрокаТЧЗаявки.ДатаВыдачи; 
			НоваяСтрока.ОтветственныйЗаВыдачу = СтрокаТЧЗаявки.ОтветственныйЗаВыдачу; 
			НоваяСтрока.Заменить = СтрокаТЧЗаявки.Заменить; 
		КонецЦикла;
		ОбъектПродажа.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	Исключение
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Ошибка!!! не получилось синхронизовать продажу. Пишите в тех поддержку! Код Ошибки: 02121994"; 
	КонецПопытки; 
	
КонецПроцедуры

Функция ПолучитьСкладПоПартии(индкод)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	РегистрНакопления1Остатки.Товар КАК Товар,
	|	РегистрНакопления1Остатки.индкод КАК индкод,
	|	РегистрНакопления1Остатки.Склад КАК Склад,
	|	РегистрНакопления1Остатки.машина КАК машина
	|ИЗ
	|	РегистрНакопления.РегистрНакопления1.Остатки КАК РегистрНакопления1Остатки
	|ГДЕ
	|	РегистрНакопления1Остатки.индкод = &индкод";

	Запрос.УстановитьПараметр("индкод", индкод);

	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	РезультатЗапроса.Следующий();
    Структура = НОвый Структура; 
	Структура.Вставить("Склад",РезультатЗапроса.Склад);
	Структура.Вставить("Машина",РезультатЗапроса.машина);
	Возврат Структура;

КонецФункции

Функция ПолучитьАдрес(Номенклатура, Склад, ИндКод)
	Запрос  = Новый запрос;
	Запрос.текст = "ВЫБРАТЬ
				   |	дт_МестаХраненияНоменклатурыСрезПоследних.МестоХранения КАК МестоХранения,
				   |	ЕСТЬNULL(Стеллажик.ГруппаМестХранения, ЗНАЧЕНИЕ(Справочник.ГруппыМестХранения.ПустаяСсылка)) КАК ГруппаМестХранения,
				   |	ВЫБОР
				   |		КОГДА ИндНомер.Стеллаж <> ЗНАЧЕНИЕ(Справочник.стеллаж.пустаяссылка)
				   |			ТОГДА ИндНомер.Стеллаж
				   |		ИНАЧЕ Стеллажик.Ссылка
				   |	КОНЕЦ КАК Стеллаж
				   |ИЗ
				   |	РегистрСведений.дт_МестаХраненияНоменклатуры.СрезПоследних(
				   |			&ДатаСреза,
				   |			Склад = &Склад
				   |				И Номенклатура = &Номенклатура) КАК дт_МестаХраненияНоменклатурыСрезПоследних
				   |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Стеллаж КАК Стеллажик
				   |		ПО дт_МестаХраненияНоменклатурыСрезПоследних.МестоХранения = Стеллажик.Ссылка
				   |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ИндНомер КАК ИндНомер
				   |		ПО дт_МестаХраненияНоменклатурыСрезПоследних.Номенклатура = ИндНомер.индкод.Владелец
				   |ГДЕ
				   |	ИндНомер.индкод = &индкод";

	Запрос.УстановитьПараметр("Склад", Склад);
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	Запрос.УстановитьПараметр("индкод", ИндКод);
	Запрос.УстановитьПараметр("ДатаСреза", ТекущаяДата());

	Выборка = Запрос.Выполнить().Выбрать();

	Если выборка.Количество() > 0 Тогда
		Выборка.Следующий();
		Возврат Выборка.стеллаж;
	Иначе
		Возврат Неопределено;
	КонецЕсли;
КонецФункции
// ---------------------------------------------------------------------------------------------------------------------
Функция ЭтапированиеЗаявки() ЭКСПОРТ
		
	Если ЭтапыПродажи = Перечисления.ЭтапыПродажи.Отказ Тогда 
		Возврат Перечисления.ЭтапыПродажи.Отказ;   
	КонецЕсли; 

Если ЗначениеЗаполнено(Продажа) Тогда /// Если Есть продажа то строим запросы к ней
	ОбъектПродажа = Продажа.ПолучитьОбъект(); 
	КолТоваров	= ОбъектПродажа.Таблица.Количество(); 

		Если КолТоваров >  0 Тогда 
			Флаг = ложь; // Если Истина то разрешено сверять место хранения детали и полки менеджера
			Флаг2 = ложь;// Если Истина то разрешено Проверять выдачу или отмену товара
			
			ПроверкаСобрано 	= Ложь; 
			ПроверкаВыдано 		= ложь; 	 
			ПроверкаОформлено 	= Ложь; 
			ПроверкаОтправлено 	= ложь; 
			
			Запрос = Новый Запрос;
			Запрос.Текст =
					"ВЫБРАТЬ
					|	ПродажаЗапчастейТаблица.Товар.Наименование КАК НоменклатураНаименование,
					|	ПродажаЗапчастейТаблица.Ссылка.КтоПродал КАК Менеджер
					|ИЗ
					|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
					|ГДЕ
					|	ПродажаЗапчастейТаблица.Ссылка.ЗаказКлиента = &Ссылка
					|	И (ПродажаЗапчастейТаблица.Партия = ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
					|	ИЛИ ПродажаЗапчастейТаблица.Заменить = ИСТИНА)"; 	
			
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			
			Если РезультатЗапроса.Пустой() Тогда  
				Флаг = истина; 
			КонецЕсли; 
			
			Если Флаг Тогда 
				
				Запрос = Новый Запрос;
				Запрос.Текст =
						"ВЫБРАТЬ
						|	ПродажаЗапчастейТаблица.Партия
						|ПОМЕСТИТЬ ВТ_Партии
						|ИЗ
						|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
						|ГДЕ
						|	ПродажаЗапчастейТаблица.Ссылка.ЗаказКлиента = &Ссылка
						|	И ПродажаЗапчастейТаблица.Партия <> ЗНАЧЕНИЕ(Справочник.ИндКод.ПустаяСсылка)
						|;
						|
						|////////////////////////////////////////////////////////////////////////////////
						|ВЫБРАТЬ
						|	ИндНомер.индкод,
						|	ИндНомер.Стеллаж
						|ИЗ
						|	РегистрСведений.ИндНомер КАК ИндНомер
						|ГДЕ
						|	НЕ ИндНомер.Стеллаж.Наименование  ПОДОБНО ""Korzina"" + ""%""
						|	И ИндНомер.индкод В
						|		(ВЫБРАТЬ
						|			ВТ_Партии.Партия
						|		ИЗ
						|			ВТ_Партии КАК ВТ_Партии)"; 	
				
				Запрос.УстановитьПараметр("Ссылка",Ссылка);
				РезультатЗапроса = Запрос.Выполнить();
				Если РезультатЗапроса.Пустой() Тогда 
					Этап =  Перечисления.ЭтапыПродажи.Собрано;
					ПроверкаСобрано = Истина;
					Флаг2 = Истина;    
				КонецЕсли; 	
			КонецЕсли; 
			
			Запрос = Новый Запрос;
					Запрос.Текст =
						"ВЫБРАТЬ
						|	ПродажаЗапчастейТаблица.Товар.Наименование КАК НоменклатураНаименование,
						|	ПродажаЗапчастейТаблица.Ссылка.КтоПродал КАК Менеджер
						|ИЗ
						|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
						|ГДЕ
						|	ПродажаЗапчастейТаблица.Ссылка.ЗаказКлиента = &Ссылка
						|	И ПродажаЗапчастейТаблица.Отменено = ЛОЖЬ
						|	И ПродажаЗапчастейТаблица.СтатусТовара = ЛОЖЬ"; 
						Запрос.УстановитьПараметр("Ссылка",Ссылка);
						РезультатЗапроса = Запрос.Выполнить();
						
						Если РезультатЗапроса.Пустой() И ПроверкаСобрано Тогда  
							Этап =  Перечисления.ЭтапыПродажи.Выдано;
							ПроверкаВыдано = Истина;
						КонецЕсли; 
			
			Запрос = Новый Запрос;
			Запрос.Текст =
					"ВЫБРАТЬ
					|	ЗаказКлиента.РаспечатанНаряднаДоставку,
					|	ЗаказКлиента.Ссылка,
					|	ЗаказКлиента.Организация.ЮрФизЛицо.Ссылка КАК ОООИПФИЗ
					|ПОМЕСТИТЬ ВТ_Заявка
					|ИЗ
					|	Документ.ЗаказКлиента КАК ЗаказКлиента
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ
					|	ПродажаЗапчастей.НомерУПД КАК НомерУПД,
					|	ПродажаЗапчастей.ТрекНомер КАК ТрекНомер,
					|	ПродажаЗапчастей.Самовывоз КАК Самовывоз,
					|	ВТ_Заявка.РаспечатанНаряднаДоставку КАК РаспечатанНаряднаДоставку,
					|	ВТ_Заявка.ОООИПФИЗ КАК ОООИПФИЗ
					|ИЗ
					|	ВТ_Заявка КАК ВТ_Заявка
					|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
					|		ПО ПродажаЗапчастей.ЗаказКлиента = ВТ_Заявка.Ссылка
					|ГДЕ
					|	ВТ_Заявка.Ссылка = &Ссылка";
			Запрос.УстановитьПараметр("Ссылка",Ссылка);
			РезультатЗапроса = Запрос.Выполнить();
			Если НЕ РезультатЗапроса.Пустой() ТОгда 	
				
				Выборка = РезультатЗапроса.Выбрать(); 
				
				Пока Выборка.Следующий() Цикл 
					
					ООО = Ложь; 
					Если Выборка.ОООИПФИЗ = Перечисления.дт_ТипыКлиентов.ЮрЛицо Тогда 
						ООО = Истина; 
					Иначе 
						ООО = Ложь; 
					КонецЕсли;  
					
					// Оформлнено 
					Если ЗначениеЗаполнено(Выборка.НомерУПД) И  Выборка.Самовывоз И ПроверкаВыдано И ЗначениеЗаполнено(Организация)  Тогда 
						Этап = Перечисления.ЭтапыПродажи.Оформлено;
						ПроверкаОформлено = Истина;
					КонецЕсли ; 
					// Оформлнено 
					Если Выборка.Самовывоз  И ООО = Ложь И ЗначениеЗаполнено(Организация) И ПроверкаВыдано Тогда 
						Этап = Перечисления.ЭтапыПродажи.Оформлено;
						ПроверкаОформлено = Истина; 
					КонецЕсли ; 
					// Оформлнено 	
					Если РаспечатанНаряднаДоставку  И ООО = Ложь И ЗначениеЗаполнено(Организация) И ПроверкаВыдано Тогда 
						Этап = Перечисления.ЭтапыПродажи.Оформлено;
						ПроверкаОформлено = Истина; 
					КонецЕсли ; 
					// Оформлнено 		
					Если ЗначениеЗаполнено(Выборка.НомерУПД) И  РаспечатанНаряднаДоставку И ПроверкаВыдано  Тогда 
						Этап = Перечисления.ЭтапыПродажи.Оформлено;
						ПроверкаОформлено = Истина;
					КонецЕсли ; 
					// Отправлено		
					Если ПроверкаОформлено И (Выборка.Самовывоз)   Тогда 
						Этап = Перечисления.ЭтапыПродажи.Отправлено;
						ПроверкаОтправлено = Истина;
					КонецЕсли ; 
					// Отправлено	
					Если  Выборка.Самовывоз И ПроверкаОформлено Тогда 
						Этап = Перечисления.ЭтапыПродажи.Отправлено;
						ПроверкаОтправлено = Истина; 
					КонецЕсли ; 
					// Отправлено	
					Если  ЗначениеЗаполнено(Выборка.ТрекНомер) И ПроверкаОформлено  Тогда 
						Этап = Перечисления.ЭтапыПродажи.Отправлено;
						ПроверкаОтправлено = Истина;
					КонецЕсли ; 
					//--------------------------------------------------------------------------------------------------
					//Все что ниже это логика отщелкивания работаящаяя на Клиенте
					
					// Выдать
					Если  ЭтапыПродажи = Перечисления.ЭтапыПродажи.Выдать И ПроверкаВыдано = Ложь Тогда  
						Этап = Перечисления.ЭтапыПродажи.Выдать; 	
					КонецЕСли; 
					// Выдать
					Если НЕ ЗначениеЗаполнено(Этап) И ЭтапыПродажи = Перечисления.ЭтапыПродажи.Выдать Тогда 
						Этап = Перечисления.ЭтапыПродажи.Выдать;
					КонецЕСли;
					
					// Собрать 
					Если НЕ ЗначениеЗаполнено(Этап) И ЭтапыПродажи = Перечисления.ЭтапыПродажи.Собрать Тогда 
						Этап = Перечисления.ЭтапыПродажи.Собрать ;
					КонецЕСли; 
					 
					// В Работе
					Если НЕ ЗначениеЗаполнено(Этап) И НЕ ЭтапыПродажи = Перечисления.ЭтапыПродажи.Собрать И НЕ ЭтапыПродажи = Перечисления.ЭтапыПродажи.Выдать Тогда 
						Этап = Перечисления.ЭтапыПродажи.ВРаботе;
					КонецЕСли;
				КонецЦикла; 	
			КонецЕсли; 
		Иначе 
			Этап = Перечисления.ЭтапыПродажи.ВРаботе;
		КонецЕсли; 

Иначе // Если нет продажи работаем с заявкой
	
			ФлагНетПартии = ложь; 			 
			МассивПартий = Новый Массив;			
			Если Товары.Количество() >  0 Тогда  
				Для Каждого Строка ИЗ Товары  Цикл
					Если  Строка.Партия = Справочники.ИндКод.ПустаяСсылка() ИЛИ Строка.Заменить Тогда 
						ФлагНетПартии = Истина; 
					Иначе
						МассивПартий.Добавить(Строка.Партия);   
					КонецЕСли; 
					
				КонецЦикла; 
						
				Если НЕ ФлагНетПартии И МассивПартий.Количество() > 0 Тогда 
					
					Запрос = Новый Запрос;
					Запрос.Текст =
							"ВЫБРАТЬ
							|	ИндНомер.индкод КАК индкод,
							|	ИндНомер.Стеллаж КАК Стеллаж
							|ИЗ
							|	РегистрСведений.ИндНомер КАК ИндНомер
							|ГДЕ
							|	НЕ ИндНомер.Стеллаж.Наименование ПОДОБНО ""Korzina"" + ""%""
							|	И ИндНомер.индкод В(&МасивПартий)"; 	
					
					Запрос.УстановитьПараметр("МасивПартий",МассивПартий);
					РезультатЗапроса = Запрос.Выполнить();
					
					Если РезультатЗапроса.Пустой() Тогда 
						Этап =  Перечисления.ЭтапыПродажи.Собрано; 
					КонецЕсли; 	
					
				КонецЕсли; 
				
					Если НЕ ЗначениеЗаполнено(Этап) И ЭтапыПродажи = Перечисления.ЭтапыПродажи.Собрать Тогда 
						Этап = Перечисления.ЭтапыПродажи.Собрать;
					КонецЕСли; 
					
					Если НЕ ЗначениеЗаполнено(Этап) И ЭтапыПродажи = Перечисления.ЭтапыПродажи.Выдать Тогда 
						Этап = Перечисления.ЭтапыПродажи.Выдать;
					КонецЕСли;
					
					Если НЕ ЗначениеЗаполнено(Этап) И НЕ ЭтапыПродажи = Перечисления.ЭтапыПродажи.Собрать Тогда 
						Этап = Перечисления.ЭтапыПродажи.ВРаботе;  
					КонецЕСли;
			Иначе 
				Этап = Перечисления.ЭтапыПродажи.ВРаботе;		
			КонецЕсли;  		
КонецЕсли; 

Возврат Этап;
 
КонецФункции

Функция ПересчетТЧТоварыНаСервере() 
	ПроцентНалог = ПолучитьНалогОрганизации(Организация); 
	Если ЗначениеЗаполнено(Организация) Тогда 
		Для каждого Строка ИЗ Товары Цикл 
			Если ПроцентНалог > 0 Тогда
				Строка.ЦенаСНДС = Строка.Цена + (Строка.Цена * (ПроцентНалог / 100)); 
				Строка.СуммаНДС	= Строка.Цена * (ПроцентНалог / 100) * Строка.Количество;
				Строка.Сумма 	= Строка.ЦенаСНДС * Строка.Количество;
			Иначе
				Строка.ЦенаСНДС	= 0;  
				Строка.СуммаНДС	= 0;
				Строка.Сумма 	= Строка.Цена * Строка.Количество;
			КонецЕсли; 
		КонецЦикла;
	Иначе 
		Для каждого Строка ИЗ Товары Цикл 	
			Строка.ЦенаСНДС		= 0;  
			Строка.СуммаНДС		= 0;
			Строка.Сумма 		= Строка.Цена * Строка.Количество;	
		КонецЦикла; 
	КонецЕсли;
	
	СуммаДокумента 	=  0; 
	Для Каждого СтрокаТЧ ИЗ Товары Цикл 
		Если СтрокаТЧ.Отменено <> Истина ТОгда 
			СуммаДокумента 	= СуммаДокумента + СтрокаТЧ.Сумма; 	
		КонецЕСли; 	
	КонецЦикла; 
КонецФункции

Функция ПолучитьНалогОрганизации(Организация)
	
	Налог = 0; 
	Если НЕ ЗначениеЗаполнено(Организация) Тогда 
		Возврат Налог; 
	КонецЕсли; 
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	Организация.Налог КАК Налог
	|ИЗ
	|	Справочник.Организация КАК Организация
	|ГДЕ
	|	Организация.Ссылка = &Организация";

	Запрос.УстановитьПараметр("Организация", Организация);

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();

	ВыборкаДетальныеЗаписи.Следующий();
	Налог = Число(ВыборкаДетальныеЗаписи.Налог); 
	Возврат Налог;
КонецФункции

Процедура УвеличитьЦену(Номенклатура, ЦенаДоИзменения, ЦенаПослеИзменения, ПроцентЧисло, ДеньВСек)
	/// Комлев 04/06/24 +++
		Процент  = ЦенаДоИзменения / 100 * ПроцентЧисло;

		НоваяЦена = ?(ЦенаПослеИзменения = 0, ЦенаДоИзменения + Процент, ЦенаПослеИзменения + Процент);

		ДатаУстановки = НачалоДня((ТекущаяДата() + ДеньВСек));
		Ценообразование(Номенклатура, ДатаУстановки, НоваяЦена, Истина);
		ЗаявкаПоменялаЦену = Истина;
	/// Комлев 04/06/24 ---
КонецПроцедуры

Процедура СнизитьЦену(Номенклатура, ЦенаДоИзменения, ЦенаПослеИзменения, ПроцентЧисло, МаксПроцентЧисло, ДеньВСек)
	/// Комлев 04/06/24 +++
	Процент  = ЦенаДоИзменения / 100 * ПроцентЧисло;
	ПроцентМакс = ЦенаДоИзменения / 100 * МаксПроцентЧисло;
						
	НоваяЦена = ?(ЦенаПослеИзменения = 0, ЦенаДоИзменения - Процент, ЦенаПослеИзменения - Процент );
						
	ДатаУстановки = НачалоДня((ТекущаяДата() + ДеньВСек));
						
	Если -(НоваяЦена - ЦенаДоИзменения) >= ПроцентМакс Тогда
		ОтправитьУведомление(ДатаУстановки, Номенклатура, МаксПроцентЧисло );
		Возврат;
	КонецЕсли;
						
	Ценообразование(Номенклатура, ДатаУстановки,  НоваяЦена, Истина);
	ЗаявкаПоменялаЦену = Истина;
	/// Комлев 04/06/24 ---
КонецПроцедуры

Процедура ОтправитьУведомление(ДатаУведомления, Номенклатура, Процент) 
	/// Комлев 04/06/24 +++
	Шишов = Справочники.Пользователи.НайтиПоНаименованию("Шишов Евгений Викторович");
	НапоминаниеПользователю = РегистрыСведений.НапоминанияПользователя.СоздатьМенеджерЗаписи();
	НапоминаниеПользователю.Пользователь = Шишов;
	НапоминаниеПользователю.ВремяСобытия = ДатаУведомления + 20;
	НапоминаниеПользователю.СрокНапоминания = ДатаУведомления + 25;
	НапоминаниеПользователю.Описание = "" + Номенклатура + " " + Номенклатура.Код +  " стоимость снизилась на " +  Процент + "%";
	НапоминаниеПользователю.СпособУстановкиВремениНапоминания = Перечисления.СпособыУстановкиВремениНапоминания.ВУказанноеВремя;
	НапоминаниеПользователю.ИнтервалВремениНапоминания = 120;
	НапоминаниеПользователю.Записать();
	/// Комлев 04/06/24 ---
КонецПроцедуры

Процедура Ценообразование(НоменклатураСсылка, ДатаУстановкиЦены,  НоваяЦена, БылоАвтоИзменение = Истина)
	Попытка
		ДанныеЗаписи = Новый Структура("Номенклатура, ТипЦен",  НоменклатураСсылка, Справочники.ТипыЦен.Фиксированная);
		дт_Ценообразование.УстановитьЦену(ДанныеЗаписи, ДатаУстановкиЦены, НоваяЦена, , БылоАвтоИзменение);
	Исключение
		
	КонецПопытки;
		
КонецПроцедуры
	
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
		
		Если Состояние = Перечисления.дт_СостоянияЗаказовКлиента.Продажа тогда
			ПроверяемыеРеквизиты.Добавить("Товары");
		КонецЕсли;
		
		Если Дата >= НачалоДня(Дата("20230310")) И (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("ТекстовыйМенеджер")) И 
			НЕ (ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("РКК")) ИЛИ 
			ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("Контролёр")))) Тогда
			ПроверяемыеРеквизиты.Добавить("Канал");
		КонецЕсли;
		
	КонецПроцедуры
	
Процедура ПриЗаписи(Отказ)
	
	///+ТатарМА 26.11.2024
	Если ОбменДанными.Загрузка Тогда
			Возврат;
	КонецЕсли;
	
	//Проверка на существующую запись в новом конечном статусе
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПорядокЗаявок.Заявка
		|ИЗ
		|	РегистрСведений.ПорядокЗаявок КАК ПорядокЗаявок
		|ГДЕ
		|	ПорядокЗаявок.Заявка = &Заявка
		|	И ПорядокЗаявок.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Заявка", Ссылка);
	Запрос.УстановитьПараметр("Статус", Состояние);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	Если НЕ РезультатЗапроса.Количество() > 0 Тогда
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ ПЕРВЫЕ 1
			|	ПорядокЗаявок.ПорядковыйНомер КАК ПорядковыйНомер
			|ИЗ
			|	РегистрСведений.ПорядокЗаявок КАК ПорядокЗаявок
			|ГДЕ
			|	ПорядокЗаявок.Статус = &Статус
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПорядковыйНомер УБЫВ";
		
		Запрос.УстановитьПараметр("Статус", Состояние);
		
		РезультатЗапроса = Запрос.Выполнить().Выбрать();
		Если РезультатЗапроса.Количество() > 0 Тогда
			РезультатЗапроса.Следующий();
			ЗаписьВРегистреСведений = РегистрыСведений.ПорядокЗаявок.СоздатьМенеджерЗаписи();
			ЗаписьВРегистреСведений.Заявка = Ссылка;
			ЗаписьВРегистреСведений.Статус = Состояние;
			ЗаписьВРегистреСведений.ПорядковыйНомер = РезультатЗапроса.ПорядковыйНомер + 1;
			ЗаписьВРегистреСведений.Записать();
		Иначе
			ЗаписьВРегистреСведений = РегистрыСведений.ПорядокЗаявок.СоздатьМенеджерЗаписи();
			ЗаписьВРегистреСведений.Заявка = Ссылка;
			ЗаписьВРегистреСведений.Статус = Состояние;
			ЗаписьВРегистреСведений.ПорядковыйНомер = 1;
			ЗаписьВРегистреСведений.Записать();
		КонецЕсли;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ЭтапыПродажи = Перечисления.ЭтапыПродажи.НоваяЗаявка;
	КонецЕсли;
	
КонецПроцедуры
	
#КонецОбласти  


функция ПроверкаПродаж(Заявка)
	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаЗапчастей.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	               |ГДЕ
	               |	ПродажаЗапчастей.ЗаказКлиента = &ЗаказКлиента
	               |	И ПродажаЗапчастей.ЗаказКлиента <> ЗНАЧЕНИЕ(Документ.заказКлиента.ПустаяСсылка)";
	Запрос.УстановитьПараметр("ЗаказКлиента",Заявка);
	Выборка = Запрос.Выполнить().Выбрать();
	Продажа =Неопределено;
	Если выборка.Количество() > 0 тогда
		Выборка.Следующий();
		Продажа = выборка.ссылка;	
	КонецЕсли;
	Возврат продажа;
КонецФункции


	
	#Область СлужебныеПроцедурыИФункции
	
	
	
	#КонецОбласти
	
#КонецЕсли