
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	/// Комлев АА 19/12/24 +++
	СписокПоказателиПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ТипЦен", Справочники.ТипыЦен.НайтиПоКоду("000000004"));
	/// Комлев АА 19/12/24 ---
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокПоказателиПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодОтчета.ДатаНачала);
	СписокПоказателиПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодОтчета.ДатаОкончания);
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ПериодОтчетаПриИзменении(Элемент)
	/// Комлев АА 19/12/24 +++
	СписокПоказателиПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", ПериодОтчета.ДатаНачала);
	СписокПоказателиПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ПериодОтчета.ДатаОкончания);
	/// Комлев АА 19/12/24 ---
КонецПроцедуры

&НаКлиенте
Процедура СписокПоказателиПоМенеджерамВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	/// Комлев АА 19/12/24 +++
	Если Поле = Элементы.СписокПоказателиПоМенеджерамПродажа Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Продажа);
			ОткрытьФорму("Документ.ПродажаЗапчастей.Форма.ФормаДокумента", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
	
	Если Поле = Элементы.СписокПоказателиПоМенеджерамТовар Тогда
		СтандартнаяОбработка = Ложь;
		ТекущиеДанные = Элемент.ТекущиеДанные;
		Если ТекущиеДанные <> Неопределено Тогда
			ПараметрыФормы = Новый Структура("Ключ", ТекущиеДанные.Товар);
			ОткрытьФорму("Справочник.Номенклатура.Форма.ФормаЭлемента", ПараметрыФормы);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры
/// Комлев АА 19/12/24 ---
#КонецОбласти

#Область ОбработчикиКомандФормы

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
