
&НаСервере
Процедура Проект1ПриИзмененииНаСервере()
		
	Если ЗначениеЗаполнено(Проект) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Проект", 
		Проект, // Значение отбора
		ВидСравненияКомпоновкиДанных.Равно,, Истина);
	Иначе
		ДоступныеПроекты = Элементы.Проект1.СписокВыбора.ВыгрузитьЗначения();
		//ДоступныеПроекты.Удалить(0);
		
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
		Список, 
		"Проект", 
		ДоступныеПроекты, // Значение отбора
		ВидСравненияКомпоновкиДанных.ВСписке,, Истина);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура Проект1ПриИзменении(Элемент)
	Проект1ПриИзмененииНаСервере();
КонецПроцедуры
//
&НаСервере
Процедура ЗаполнитьСписок()
ЗапросПроекта = Новый Запрос;
	ЗапросПроекта.Текст = 
	"ВЫБРАТЬ
	|	Проекты.Ссылка КАК Ссылка,
	|	Проекты.Представление КАК Представление
	|ИЗ
	|	Справочник.ПроектыРазвития КАК Проекты
	|ГДЕ
	|	НЕ Проекты.ПометкаУдаления
	|	И НЕ Проекты.Завершен
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	РезультатЗапросаПроекта 	= ЗапросПроекта.Выполнить();
	
	ВыборкаДетальныеЗаписиПроекта = РезультатЗапросаПроекта.Выбрать();
	
	Элементы.Проект1.СписокВыбора.Очистить();
	Элементы.Проект1.СписокВыбора.Добавить(Справочники.ПроектыРазвития.ПустаяСсылка(), "ВСЕ");
	Пока ВыборкаДетальныеЗаписиПроекта.Следующий() Цикл
		Элементы.Проект1.СписокВыбора.Добавить(ВыборкаДетальныеЗаписиПроекта.Ссылка, ВыборкаДетальныеЗаписиПроекта.Представление);
	КонецЦикла;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ЗаполнитьСписок();
КонецПроцедуры
