
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список_ВопросыПоВакансии.Параметры.УстановитьЗначениеПараметра("Вакансия",Объект.ссылка);
КонецПроцедуры


&НаКлиенте
Процедура Печать1(Команда)
ТабДок = Печать(Объект.ссылка);

// создадим коллекцию печатных форм, в которую надо будет добавить нужный нам табличный документ
КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("Печать");
// Добавляем в коллекцию (тип массив) сформированный Табличный документ
КоллекцияПечатныхФорм[0].ТабличныйДокумент = ТабДок;
// если требуется устанавливаем параметры печати
КоллекцияПечатныхФорм[0].Экземпляров=1;
КоллекцияПечатныхФорм[0].СинонимМакета = "Печать";  // используется для формирования имени файла при сохранении из общей формы печати документов
// .. и выводим стандартной процедурой БСП
УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм,Неопределено,ЭтаФорма);

КонецПроцедуры

Функция Печать(Ссылка)
	Табдок= Новый ТабличныйДокумент;
	Макет = Справочники.ВакансииКампании.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВопросыККандидату.Наименование КАК Вопросы,
	|	ВакансииКампании.ДолженЗнать КАК ДолженЗнать,
	|	ВакансииКампании.Наименование КАК Наименование,
	|	ВакансииКампании.Обязанности КАК Обязанности,
	|	ВакансииКампании.Описание КАК Описание,
	|	ВакансииКампании.Оплата КАК Оплата,
	|	ВакансииКампании.Статус КАК Статус,
	|	ВакансииКампании.Требования КАК Требования,
	|	ВакансииКампании.УсловияРаботы КАК УсловияРаботы,
	|	ВакансииКампании.Интервьюеры.(
	|		Сотрудник КАК Сотрудник
	|	) КАК Интервьюеры
	|ИЗ
	|	Справочник.ВакансииКампании КАК ВакансииКампании
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ВопросыККандидату КАК ВопросыККандидату
	|		ПО ВакансииКампании.Ссылка = ВопросыККандидату.Вакансии.Вакансия
	|ГДЕ
	|	ВакансииКампании.Ссылка В(&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ШапкаВопросы = Макет.ПолучитьОбласть("ШапкаВопросы");
	Вопросы = Макет.ПолучитьОбласть("Вопросы");
	Подпись = Макет.ПолучитьОбласть("Подпись");
	ТабДок.Очистить();
	
	Выборка.Следующий();
	
	ТабДок.Вывести(ОбластьЗаголовок);
	
	Шапка.Параметры.Заполнить(Выборка);
	ТабДок.Вывести(Шапка, Выборка.Уровень());
	
	ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	
	ТабДок.Вывести(ШапкаВопросы);
	
	Вопросы.Параметры.Заполнить(Выборка);
	Табдок.Вывести(Вопросы, Выборка.Уровень());
	
	Пока Выборка.Следующий() Цикл
		Вопросы.Параметры.Заполнить(Выборка);
		Табдок.Вывести(Вопросы, Выборка.Уровень());
	КонецЦикла;
	
	ВыборкаИнтервьюеры = Выборка.Интервьюеры.Выбрать();
	Пока ВыборкаИнтервьюеры.Следующий() Цикл
		Подпись.Параметры.Заполнить(ВыборкаИнтервьюеры);
		Табдок.Вывести(Подпись, Выборка.Уровень());	
	КонецЦикла;
	
	Возврат Табдок;
КонецФункции

&НаКлиенте
Процедура ДобавитьВопросы(Команда)
ОписаниеВыбора = Новый ОписаниеОповещения("ОбработатьВыборВопроса",ЭтаФорма);
	//ОткрытьФорму("");
ОткрытьФорму("Справочник.ВопросыККандидату.ФормаВыбора",,,,,,
ОписаниеВыбора,
РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
//	Элементы.СписокЧек.Обновить();

КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборВопроса(РезультатЗакрытия,ДопПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(РезультатЗакрытия) Тогда
		Возврат;
	КонецЕсли;
ЗаписьВакансии(РезультатЗакрытия);
Список_ВопросыПоВакансии.Параметры.УстановитьЗначениеПараметра("Вакансия",Объект.ссылка);
КонецПроцедуры

Процедура ЗаписьВакансии(Результат)
	Отбор = Новый Структура();
	Отбор.Вставить("Вакансия", Объект.Ссылка);
	ОбОбъект = Результат.ссылка.ПолучитьОбъект();
	НайденныеСтроки = ОбОбъект.Вакансии.НайтиСтроки(Отбор);
	Если  НайденныеСтроки.Количество() = 0 тогда
		НоваяСтрока = ОбОбъект.Вакансии.Добавить();
		НоваяСтрока.Вакансия = Объект.Ссылка;
		ОбОбъект.Записать();
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьНовыйВопрос(Команда)
 ПараметрыОткрытия = Новый Структура("Кандидат_Вакансия", объект.Ссылка);
 ФормаВыбора = ПолучитьФорму("Справочник.ВопросыККандидату.Форма.ФормаЭлемента", ПараметрыОткрытия,ЭтаФорма);
 ВыбЭлемент = ФормаВыбора.ОткрытьМодально();
КонецПроцедуры


&НаСервере
Процедура УдалитьВопросНаСервере(ИмяВопроса)
	Отбор = Новый Структура();
	Отбор.Вставить("Вакансия", Объект.Ссылка);
	Попытка
		ОбВопроса = Справочники.ВопросыККандидату.НайтиПоНаименованию(ИмяВопроса).ПолучитьОбъект();
		
		НайденныеСтроки = ОбВопроса.Вакансии.НайтиСтроки(Отбор);
		
		Если  НайденныеСтроки.Количество() > 0 тогда
			Для Каждого мСтрока Из НайденныеСтроки Цикл
				ОбВопроса.Вакансии.Удалить(мСтрока);
				ОбВопроса.Записать();	
			КонецЦикла;
		КонецЕсли;
	Исключение
	КонецПопытки;
	Список_ВопросыПоВакансии.Параметры.УстановитьЗначениеПараметра("Вакансия",Объект.ссылка);	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВопрос(Команда)
	УдалитьВопросНаСервере(Элементы.Список_ВопросыПоВакансии.ТекущиеДанные.Наименование);
КонецПроцедуры

