
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Вставить содержимое обработчика
КонецПроцедуры

&НаСервере
Процедура Расчёт()
	Если Запись.ООклад < Запись.Оклад  тогда
		Запись.НОклад = Запись.Оклад - Запись.ООклад;
	иначе
		//Сообщить("Введите верные данные!");
	КонецЕсли;
	
	Запись.Аванс    = Запись.ООклад   *0.4;
	Запись.Подсчёт  = Запись.ООклад   - запись.Аванс;
	Запись.НАванс   = Запись.ДогАванс - запись.Аванс;
	Запись.НПодсчёт = Запись.НОклад   - запись.НАванс;	
	
	Запись.Оклад   = Запись.ООклад + запись.НОклад;
	
	Если  Запись.НАванс + запись.Аванс > Запись.ДогАванс Тогда
		Сообщить("Недостаточный аванс для оклада");
		Запись.ДогАванс = Запись.НАванс + запись.Аванс;
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ОкладПриИзменении(Элемент)
	Расчёт();
КонецПроцедуры

&НаКлиенте
Процедура ООкладПриИзменении(Элемент)
	Расчёт();
КонецПроцедуры

&НаКлиенте
Процедура ОкладОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	//Расчёт();
КонецПроцедуры

&НаКлиенте
Процедура ДогАвансПриИзменении(Элемент)
	Расчёт();
КонецПроцедуры


