//++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
// ПродажаМодульФормы
//&НаСервереБезКонтекста
Процедура СинхронизоватьВыданСЗаказомКлиента(ЗаказКлиента,Ссылка)
	
	Если НЕ ЗначениеЗаполнено(ЗаказКлиента) тогда 
		Возврат;
	Конецесли; 	

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПродажаЗапчастейТаблица.НомерСтроки,
		|	ПродажаЗапчастейТаблица.Ссылка,
		|	ПродажаЗапчастейТаблица.Товар,
		|	ПродажаЗапчастейТаблица.Количество,
		|	ПродажаЗапчастейТаблица.Цена,
		|	ПродажаЗапчастейТаблица.Скидка,
		|	ПродажаЗапчастейТаблица.Партия,
		|	ПродажаЗапчастейТаблица.машина,
		|	ПродажаЗапчастейТаблица.цена1,
		|	ПродажаЗапчастейТаблица.Комментарий,
		|	ПродажаЗапчастейТаблица.Сумма,
		|	ПродажаЗапчастейТаблица.ПродНак,
		|	ПродажаЗапчастейТаблица.укод,
		|	ПродажаЗапчастейТаблица.Отменено,
		|	ПродажаЗапчастейТаблица.Склад,
		|	ПродажаЗапчастейТаблица.СуммаНДС,
		|	ПродажаЗапчастейТаблица.СтатусТовара,
		|	ПродажаЗапчастейТаблица.ДатаОтгрузкиСоСклада,
		|	ПродажаЗапчастейТаблица.Сборщик,
		|	ПродажаЗапчастейТаблица.ДатаВыдачи,
		|	ПродажаЗапчастейТаблица.ОтветственныйЗаВыдачу,
		|	ПродажаЗапчастейТаблица.Корректировка,
		|	ПродажаЗапчастейТаблица.МестоХранения,
		|	ПродажаЗапчастейТаблица.Заменить
		|ИЗ
		|	Документ.ПродажаЗапчастей.Таблица КАК ПродажаЗапчастейТаблица
		|ГДЕ
		|	ПродажаЗапчастейТаблица.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка",Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если  РезультатЗапроса.Пустой() ТОгда 
		Возврат; 
	КонецЕСли ;
	
	Попытка
	ОбъектЗаказКлиента = ЗаказКлиента.ПолучитьОбъект(); 
	ОбъектЗаказКлиента.Товары.Очистить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = ОбъектЗаказКлиента.Товары.Добавить();
		НоваяСтрока.Номенклатура = Выборка.Товар;
		НоваяСтрока.Партия 		= Выборка.Партия;
		НоваяСтрока.Выдан 		= Выборка.СтатусТовара;
		НоваяСтрока.Количество 	= Выборка.Количество;
		НоваяСтрока.Цена 		= Выборка.Цена;
		НоваяСтрока.Сумма 		= Выборка.Сумма;
		НоваяСтрока.Отменено	= Выборка.Отменено; 
		НоваяСтрока.ОтветственныйЗаВыдачу 	= Выборка.ОтветственныйЗаВыдачу; 
		НоваяСтрока.ДатаВыдачи				= Выборка.ДатаВыдачи;
		НоваяСтрока.Заменить				= Выборка.Заменить; 
	КонецЦикла;
	
	// +++ Этопирование заявки
	Этап = ЭтапированиеЗаявки.ЭтапированиеЗаявки(ОбъектЗаказКлиента); 
	Если ЗначениеЗаполнено(Этап) Тогда 
		ОбъектЗаказКлиента.ЭтапыПродажи = Этап; 
	КонецЕСли;
	// -------------------------------------------------------------------------------------------------
	
	ОбъектЗаказКлиента.Записать();	
	Исключение
		р=1; 
	КонецПопытки; 
КонецПроцедуры
//----------------------------------------------------------------------------------------------------------------------

//ЗааказКлиента МодульФормы ++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++

//&НаСервере
Процедура ОбновитьПродажу()
	Попытка
	Заблокирована = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Продажа, "Заблокирована");
	Если Не Заблокирована Тогда
		ОбъектПродажа = Объект.Продажа.ПолучитьОбъект();
		ОбъектПродажа.Организация = Объект.Организация;
		ОбъектПродажа.Клиент = Объект.Клиент;
		ОбъектПродажа.КтоПродал = Объект.Ответственный;
		ОбъектПродажа.ОжидаемаяДатаВыплаты = ДатаОплаты;
		ОбъектПродажа.Основание = ПредварительныйСчет;
	// Обновить данные доставки
		ОбъектПродажа.ЕстьДоставка = ЕстьДоставка;
		ОбъектПродажа.Самовывоз = Самовывоз;
		ОбъектПродажа.ТранспортнаяКомпания = ТранспортнаяКомпания;
		ОбъектПродажа.ЕстьТрекНомер = ЕстьТрекНомер;
		ОбъектПродажа.ТрекНомер = ТрекНомер;
		ОбъектПродажа.СсылкаНаОтслеживаниеДоставки = СсылкаНаОтслеживаниеДоставки;
		ОбъектПродажа.Вес = Вес;
		ОбъектПродажа.ГородОтправки = ГородОтправки;
		ОбъектПродажа.СтранаПолучения = СтранаПолучения;
		ОбъектПродажа.РегионПолучения = РегионПолучения;
		ОбъектПродажа.ГородПолучения = ГородПолучения;
		ОбъектПродажа.СтоимостьДоставки = СтоимостьДоставки;
		ОбъектПродажа.КоммДост = КоммДост;
		ОбъектПродажа.Водитель = Водитель;
		ОбъектПродажа.СтатусЗаказаВТК = СтатусЗаказаВТК;
		ОбъектПродажа.ДатаПолучения = ДатаПолучения;
		ОбъектПродажа.СтатусДоставки = СтатусДоставки;
		ОбъектПродажа.ИсторияОтслеживанияЗаказа = ИсторияОтслеживанияЗаказа;
		ОбъектПродажа.доставкаКлиент = доставкаКлиент;
		ОбъектПродажа.Частный = Частный;
		ОбъектПродажа.НаименованиеИлиФИО = НаименованиеИлиФИО;
		ОбъектПродажа.Паспорт = Паспорт;
		ОбъектПродажа.Прописка = Прописка;
		ОбъектПродажа.ИНН = ИНН;
		ОбъектПродажа.Телефон = Телефон;
		
		// УПД
		ОбъектПродажа.НомерУПД = НомерУПД;
		ОбъектПродажа.ДатаУПД = ДатаУПД; 
//		Если НомерУПД <> "" Тогда  
//			ОбъектПродажа.Заблокирована = Истина;
//		КонецЕсли;
		ОбъектПродажа.Руководитель = Руководитель;
		ОбъектПродажа.Заблокирована =  Объект.Заблокирована; 
		ОбъектПродажа.ДатаБлокировкиПродажи = ТекущаяДата(); 
		// Удаляем движения ПродажаЗапчастей по регистру накопленияОстатки
		НаборЗаписей=РегистрыНакопления.РегистрНакопления1.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.Регистратор.Установить (Объект.Продажа);
		НаборЗаписей.Прочитать();
		НаборЗаписей.Очистить();
		НаборЗаписей.Записать();   
		// --- 
		ОбъектПродажа.Таблица.Очистить();
		Для Каждого СтрокаТЧЗаявки Из Объект.Товары Цикл
			НоваяСтрока = ОбъектПродажа.Таблица.Добавить();
			НоваяСтрока.Партия = СтрокаТЧЗаявки.Партия;
			НоваяСтрока.Товар = СтрокаТЧЗаявки.Номенклатура;
			Если ЗначениеЗаполнено(СтрокаТЧЗаявки.Партия) Тогда
				Структура = ПолучитьСкладПоПартии(СтрокаТЧЗаявки.Партия);
				НоваяСтрока.Склад = Структура.Склад;
				НоваяСтрока.машина = Структура.Машина;
			Иначе
				НоваяСтрока.Склад = Справочники.Склады.НайтиПоКоду("000000002");
			КонецЕсли;
			НоваяСтрока.МестоХранения = ПолучитьАдрес(СтрокаТЧЗаявки.Номенклатура, НоваяСтрока.Склад,СтрокаТЧЗаявки.Партия);
			НоваяСтрока.Количество = СтрокаТЧЗаявки.Количество;
			НоваяСтрока.Цена = СтрокаТЧЗаявки.Цена;
			НоваяСтрока.СуммаНДС = СтрокаТЧЗаявки.СуммаНДС;
			НоваяСтрока.Сумма = СтрокаТЧЗаявки.Сумма;
			НоваяСтрока.СтатусТовара = СтрокаТЧЗаявки.Выдан;
			НоваяСтрока.Отменено = СтрокаТЧЗаявки.Отменено; 
			НоваяСтрока.ДатаВыдачи = СтрокаТЧЗаявки.ДатаВыдачи; 
			НоваяСтрока.ОтветственныйЗаВыдачу = СтрокаТЧЗаявки.ОтветственныйЗаВыдачу; 
			НоваяСтрока.Заменить = СтрокаТЧЗаявки.Заменить; 
		КонецЦикла;
		ОбъектПродажа.Записать(РежимЗаписиДокумента.Проведение);
	Иначе
		ОбъектПродажа = Объект.Продажа.ПолучитьОбъект();
			// Обновить данные доставки
		ОбъектПродажа.ЕстьДоставка = ЕстьДоставка;
		ОбъектПродажа.Самовывоз = Самовывоз;
		ОбъектПродажа.ТранспортнаяКомпания = ТранспортнаяКомпания;
		ОбъектПродажа.ЕстьТрекНомер = ЕстьТрекНомер;
		ОбъектПродажа.ТрекНомер = ТрекНомер;
		ОбъектПродажа.СсылкаНаОтслеживаниеДоставки = СсылкаНаОтслеживаниеДоставки;
		ОбъектПродажа.Вес = Вес;
		ОбъектПродажа.ГородОтправки = ГородОтправки;
		ОбъектПродажа.СтранаПолучения = СтранаПолучения;
		ОбъектПродажа.РегионПолучения = РегионПолучения;
		ОбъектПродажа.ГородПолучения = ГородПолучения;
		ОбъектПродажа.СтоимостьДоставки = СтоимостьДоставки;
		ОбъектПродажа.КоммДост = КоммДост;
		ОбъектПродажа.Водитель = Водитель;
		ОбъектПродажа.СтатусЗаказаВТК = СтатусЗаказаВТК;
		ОбъектПродажа.ДатаПолучения = ДатаПолучения;
		ОбъектПродажа.СтатусДоставки = СтатусДоставки;
		ОбъектПродажа.ИсторияОтслеживанияЗаказа = ИсторияОтслеживанияЗаказа;
		ОбъектПродажа.доставкаКлиент = доставкаКлиент;
		ОбъектПродажа.Частный = Частный;
		ОбъектПродажа.НаименованиеИлиФИО = НаименованиеИлиФИО;
		ОбъектПродажа.Паспорт = Паспорт;
		ОбъектПродажа.Прописка = Прописка;
		ОбъектПродажа.ИНН = ИНН;
		ОбъектПродажа.Телефон = Телефон;
		ОбъектПродажа.Записать(РежимЗаписиДокумента.Проведение);
	КонецЕсли;
	Исключение
		р=1; 
	КонецПопытки; 
КонецПроцедуры
//----------------------------------------------------------------------------------------------------------------------