
&НаКлиенте
Процедура ФОТПриИзменении(Элемент)
	ФОТПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФОТПриИзмененииНаСервере()
	
	Объект.Зарплата = Объект.ФОТ.ЗПФакт;
	
КонецПроцедуры

&НаКлиенте
Процедура ФиксМесРасходыПриИзменении(Элемент)
	РассчитатьСуммуРасходов();
	Объект.СуммаОбязательныхРасходов = Объект.ФиксМесРасходы.Итог("Сумма");
КонецПроцедуры

&НаКлиенте
Процедура ПеременРасходыПриИзменении(Элемент)
	РассчитатьСуммуРасходов();
	Объект.СуммаПеременныхРасходов = Объект.ПеременРасходы.Итог("Сумма");
КонецПроцедуры

&НаСервере
Процедура РассчитатьСуммуРасходов()
	Объект.СуммаРасхода = Объект.ФиксМесРасходы.Итог("Сумма") + Объект.ПеременРасходы.Итог("Сумма");
КонецПроцедуры