
&НаКлиенте
Процедура Вывод1(Команда)
	
	ТабДокумент = Вывод1Сервер();
	ТабДокумент.Показать();
	
КонецПроцедуры

// <Описание функции>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//
// Возвращаемое значение:
//   <Тип.Вид>   - <описание возвращаемого значения>
//
&НаСервере
Функция Вывод1Сервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	строка = Макет.ПолучитьОбласть("строка");
	таб= ййй();
	Для Каждого стр из таб Цикл
		строка.Параметры.ном = стр.Ссылка;
		строка.Параметры.сумма = стр.Сумма;
		ТабДокумент.Вывести(строка);
	КонецЦикла;
	
	Возврат ТабДокумент;	

КонецФункции // Вывод1Сервер()


&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Документы.Расходы.ПолучитьМакет(название);
КонецФункции

&НаСервере
Функция ййй()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЛичныеРасходы.Ссылка,
	               |	ЛичныеРасходы.ВерсияДанных,
	               |	ЛичныеРасходы.ПометкаУдаления,
	               |	ЛичныеРасходы.Номер КАК Номер,
	               |	ЛичныеРасходы.Дата,
	               |	ЛичныеРасходы.Проведен,
	               |	ЛичныеРасходы.ВидРасхода,
	               |	ЛичныеРасходы.Комментарий,
	               |	ЛичныеРасходы.НомерДокумента,
	               |	ЛичныеРасходы.Сумма
	               |ИЗ
	               |	Документ.ЛичныеРасходы КАК ЛичныеРасходы
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Номер";
				   рез = Запрос.Выполнить();
				   Возврат рез.Выгрузить();
КонецФункции

