#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	АналитикаПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	АналитикаПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Период.ДатаОкончания);
	АналитикаПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
КонецПроцедуры
#КонецОбласти
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	АналитикаПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Период.ДатаНачала);
	АналитикаПоМенеджерам.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Период.ДатаОкончания);
КонецПроцедуры

#КонецОбласти