
&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСуммы();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСуммы()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СУММА(ОтданоСМашиныОстатки.СуммаОстаток) КАК СуммаОстаток
	               |ИЗ
	               |	РегистрНакопления.ОтданоСМашины.Остатки КАК ОтданоСМашиныОстатки
	               |ГДЕ
	               |	ОтданоСМашиныОстатки.Кто = 2";
	Реультат = Запрос.Выполнить();
    Таблица = Реультат.Выгрузить();
	ИтогоДоходов = Таблица.Итог("СуммаОстаток");
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	Статистика.ИтогоСумма
	               |ИЗ
	               |	Документ.Статистика КАК Статистика";
	ИтогоРасходов = Запрос.Выполнить().Выгрузить().Итог("ИтогоСумма");
	НаРуках = ИтогоДоходов - ИтогоРасходов;

	Текст3 = "ВЫБРАТЬ
	|	ДокументСтатистика.Ссылка,
	|	ДокументСтатистика.ВерсияДанных,
	|	ДокументСтатистика.ПометкаУдаления,
	|	ДокументСтатистика.Номер,
	|	ДокументСтатистика.Дата,
	|	ДокументСтатистика.Проведен,
	|	ДокументСтатистика.ИтогоСумма,
	|	ДокументСтатистика.Комментарий,
	|	ДокументСтатистика.ВидРасхода,
	|	ДокументСтатистика.Месяц,
	|	ДокументСтатистика.Год,
	|	ДокументСтатистика.Зарплата,
	|	ДокументСтатистика.Кому,
	|	ДокументСтатистика.Таблица,
	|	ДокументСтатистика.МоментВремени
|	ИЗ
	|	Документ.Статистика КАК ДокументСтатистика";
		 податам = ложь;
	 
	 Если Год >= 2011 ИЛИ  Месяц > 0 Тогда
		 податам = истина;
		 Если Месяц  > 0 И Год < 2011 Тогда
			 Год = Год(ТекущаяДата());
		 КонецЕсли;
		 Если Месяц > 0 Тогда
			Дат1 = Дата(Год,Месяц,1);
			Дат2 = КонецМесяца(Дат1);
		Иначе
		   Дат1 = Дата(Год,1,1);
		   Дат2 = КонецГода(Дат1);
	   КонецЕсли;	   
	 КонецЕсли;
	 Запрос = Новый Запрос;
	 Запрос2 = Новый Запрос;
	 Текст = "ВЫБРАТЬ
	          |	Статистика.ИтогоСумма
	          |ИЗ
	          |	Документ.Статистика КАК Статистика
	          |ГДЕ
	          |	Статистика.Кому = &Кому";
	 Текст2 = "ВЫБРАТЬ
	          |	Статистика.ИтогоСумма
	          |ИЗ
	          |	Документ.Статистика КАК Статистика
	          |ГДЕ
	          |	Статистика.Кому <> &Кому1
	          |	И Статистика.Кому <> &Кому2
	          |	И Статистика.Кому <> &Кому3";
	Запрос.Текст = Текст;
	Запрос2.Текст = Текст2;
	Список.ТекстЗапроса = Текст3;
	Если податам Тогда
		Если Месяц > 0 Тогда		
	    	Текст = Текст + " И Статистика.Месяц = " + Месяц + " И Статистика.Год = &Год";
						Текст3 = Текст3 + " ГДЕ (ДокументСтатистика.Месяц = " + Месяц + " И ДокументСтатистика.Год = &Год) ИЛИ ДокументСтатистика.Дата Между &Дата1 И &Дата2"; 
		Иначе
			Текст = Текст + " И Статистика.Год = &Год";
			Текст3 = Текст3 + " ГДЕ  ДокументСтатистика.Год = &Год";
		КонецЕсли;
		Текст2 = Текст2 + " И Статистика.Дата Между &Дата1 и &Дата2";

		Запрос.Текст = Текст;
		Запрос.УстановитьПараметр("Год",Год);
		Запрос2.Текст = Текст2;
		Запрос2.УстановитьПараметр("Дата1",Дат1);
		Запрос2.УстановитьПараметр("Дата2",Дат2);
		Список.ТекстЗапроса = Текст3;
		Список.Параметры.УстановитьЗначениеПараметра("Год",Год);
		Список.Параметры.УстановитьЗначениеПараметра("Дата1",Дат1);
		Список.Параметры.УстановитьЗначениеПараметра("Дата2",Дат2);
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Кому",Справочники.Пользователи.НайтиПоКоду("000000003"));
	Никита = Запрос.Выполнить().Выгрузить().Итог("ИтогоСумма");
	Запрос.УстановитьПараметр("Кому",Справочники.Пользователи.НайтиПоКоду("000000002"));
	Василий = Запрос.Выполнить().Выгрузить().Итог("ИтогоСумма");
	Запрос.УстановитьПараметр("Кому",Справочники.Пользователи.НайтиПоКоду("000000004"));
	Запрос2.УстановитьПараметр("Кому1",Справочники.Пользователи.НайтиПоКоду("000000004"));
	Запрос2.УстановитьПараметр("Кому2",Справочники.Пользователи.НайтиПоКоду("000000002"));
	Запрос2.УстановитьПараметр("Кому3",Справочники.Пользователи.НайтиПоКоду("000000003"));
	Игорь = Запрос.Выполнить().Выгрузить().Итог("ИтогоСумма");
	Разное = Запрос2.Выполнить().Выгрузить().Итог("ИтогоСумма");

	
	
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	ОбновитьСуммы();
	ЗагрузитьСообщения();
КонецПроцедуры


&НаКлиенте
Процедура ПользовательПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура Месяц1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСуммы();
КонецПроцедуры

&НаКлиенте
Процедура Год1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьСуммы();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьСообщения()
	с = Справочники.Сообщения.НайтиПоКоду("000000001");
	СообщениеВасе = с.Сообщение;
	с = Справочники.Сообщения.НайтиПоКоду("000000002");
	СообщениеНиките = с.Сообщение;
КонецПроцедуры

&НаКлиенте
Процедура ИзменитьВасилию(Команда)
	// Вставить содержимое обработчика.
	с = ИзменитьСообщения("000000001");
	с.ПолучитьФорму().ОткрытьМодально();
	ЗагрузитьСообщения();
КонецПроцедуры


&НаКлиенте
Процедура ИзменитьНиките(Команда)
	// Вставить содержимое обработчика.
	с = ИзменитьСообщения("000000002");
	с.ПолучитьФорму().ОткрытьМодально();
	ЗагрузитьСообщения();
КонецПроцедуры

&НаСервере
Функция ИзменитьСообщения(номер)
	   Возврат  Справочники.Сообщения.НайтиПоКоду(номер);
КонецФункции


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	// Вставить содержимое обработчика.
	ЗагрузитьСообщения();
КонецПроцедуры
   
