

Процедура ВыгрузитьНаСервер() Экспорт
	ИмяФайла = "D:\DropBox_DT\Dropbox\PublicDT\cup.json";
	вывод = новый Структура();
	з = новый запрос;
	з.Текст = "ВЫБРАТЬ
	          |	ПродажаЗапчастей.Дата,
	          |	ПродажаЗапчастей.Номер,
	          |	ПродажаЗапчастей.Комментарий,
	          |	ПродажаЗапчастей.ИтогоРекв,
	          |	ПродажаЗапчастей.КтоПродал,
	          |	ПродажаЗапчастей.Оплачено,
	          |	ПродажаЗапчастей.Проведен,
	          |	ПродажаЗапчастей.Ссылка,
	          |	ПродажаЗапчастей.УжеОплачено
	          |ИЗ
	          |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей";
	продажи = з.Выполнить().Выгрузить();
	вывод.Вставить("продажи",продажи);
	
	з.Текст = "ВЫБРАТЬ
	          |	Счета.Ссылка,
	          |	Счета.Код,
	          |	Счета.Наименование,
	          |	Счета.Комментарий
	          |ИЗ
	          |	Справочник.Счета КАК Счета";
    счета = з.Выполнить().Выгрузить();
	вывод.Вставить("счета",счета);
	
	з.Текст = "ВЫБРАТЬ
	          |	Расходы.Дата,
	          |	Расходы.Номер,
	          |	Расходы.Проведен,
	          |	Расходы.ВидРасхода,
	          |	Расходы.Сумма,
	          |	Расходы.СчетОткудаРасход,
	          |	Расходы.Комментарий,
	          |	Расходы.Ссылка
	          |ИЗ
	          |	Документ.Расходы КАК Расходы";
	расходы = з.Выполнить().Выгрузить();
	вывод.Вставить("расходы",расходы);
	
	з.Текст = "ВЫБРАТЬ
	          |	ВидыРасходов.Ссылка,
	          |	ВидыРасходов.Код,
	          |	ВидыРасходов.Наименование
	          |ИЗ
	          |	Справочник.ВидыРасходов КАК ВидыРасходов";
	видрасхода = з.Выполнить().Выгрузить();
	вывод.Вставить("видрасхода",видрасхода);

	з.Текст = "ВЫБРАТЬ
	          |	Машины.Ссылка,
	          |	Машины.Код,
	          |	Машины.Наименование,
	          |	Машины.ВинКод,
	          |	Машины.Комментарий,
	          |	Машины.Сумма
	          |ИЗ
	          |	Справочник.Машины КАК Машины";
	машины = з.Выполнить().Выгрузить();
	вывод.Вставить("машины",машины);
	
	з.Текст = "ВЫБРАТЬ
	          |	ПриходДенегНаСчет.Ссылка,
	          |	ПриходДенегНаСчет.Номер,
	          |	ПриходДенегНаСчет.Дата,
	          |	ПриходДенегНаСчет.Проведен,
	          |	ПриходДенегНаСчет.Комментарий,
	          |	ПриходДенегНаСчет.ОбщаяСумма,
	          |	ПриходДенегНаСчет.ТабличнаяЧасть1.(
	          |		Ссылка,
	          |		НомерСтроки,
	          |		Документ,
	          |		Счет,
	          |		Сумма
	          |	)
	          |ИЗ
	          |	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет";
	приходнасчетпродажи = з.Выполнить().Выгрузить();
	вывод.Вставить("приходнасчетпродажи",приходнасчетпродажи);
	
	з.Текст = "ВЫБРАТЬ
	          |	ПриходОтКредитов.Ссылка,
	          |	ПриходОтКредитов.Номер,
	          |	ПриходОтКредитов.Дата,
	          |	ПриходОтКредитов.Проведен,
	          |	ПриходОтКредитов.Счет,
	          |	ПриходОтКредитов.Сумма,
	          |	ПриходОтКредитов.КредитВБанке
	          |ИЗ
	          |	Документ.ПриходОтКредитов КАК ПриходОтКредитов";
	приходнасчеткредиты = з.Выполнить().Выгрузить();
	вывод.Вставить("приходнасчеткредиты",приходнасчеткредиты);
	
	з.Текст = "ВЫБРАТЬ
	          |	ВложенияВолжска.Ссылка,
	          |	ВложенияВолжска.Код,
	          |	ВложенияВолжска.Наименование,
	          |	ВложенияВолжска.Сумма,
	          |	ВложенияВолжска.СуммаДолга
	          |ИЗ
	          |	Справочник.ВложенияВолжска КАК ВложенияВолжска";
	КредитВБанке = з.Выполнить().Выгрузить();
	вывод.Вставить("КредитВБанке",КредитВБанке);

	з.Текст = "ВЫБРАТЬ
	          |	ПеремещениеМеждуСчетами.Откуда,
	          |	ПеремещениеМеждуСчетами.Куда,
	          |	ПеремещениеМеждуСчетами.Сумма,
	          |	ПеремещениеМеждуСчетами.Ссылка,
	          |	ПеремещениеМеждуСчетами.Номер,
	          |	ПеремещениеМеждуСчетами.Дата,
	          |	ПеремещениеМеждуСчетами.Проведен
	          |ИЗ
	          |	Документ.ПеремещениеМеждуСчетами КАК ПеремещениеМеждуСчетами";
	переводмеждусчетами = з.Выполнить().Выгрузить();
	вывод.Вставить("переводмеждусчетами",переводмеждусчетами);
	Текст = Новый ЗаписьТекста(ИмяФайла, КодировкаТекста.UTF8);
	//Текст = Новый ЗаписьТекста("D:\cup.json", КодировкаТекста.UTF8);
	док = "<?xml version='1.0' encoding='UTF-8'?><info><items>";
	Текст.Записать(JSONm.дт_ЗаписатьJSON(вывод));
	Текст.Закрыть();
КонецПроцедуры
