
&НаКлиенте
Процедура ВыручкаПриИзменении(Элемент)
	ВыручкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыручкаПриИзмененииНаСервере()
	Константы.ВыручкаПредприятия.Установить(Выручка);
КонецПроцедуры

&НаКлиенте
Процедура Суммировать(Команда)
ПересчётИтогиДокументов();
КонецПроцедуры

Процедура ПересчётИтогиДокументов()
//	Запрос = новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	КадровыйПриказ.Сотрудник КАК Сотрудник,
//	               |	МАКСИМУМ(КадровыйПриказ.Дата) КАК ДатаДоговора
//	               |ПОМЕСТИТЬ ВТ_ДолжностиПериод
//	               |ИЗ
//	               |	Документ.КадровыйПриказ КАК КадровыйПриказ
//	               |ГДЕ
//	               |	(КадровыйПриказ.Отдел.Код = ""000000105""
//	               |			ИЛИ КадровыйПриказ.Отдел.Родитель.Код = ""000000105""
//	               |			ИЛИ КадровыйПриказ.Отдел.Родитель.Родитель.Код = ""000000105""
//	               |			ИЛИ КадровыйПриказ.Отдел.Родитель.Родитель.Родитель.Код = ""000000105"")
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	КадровыйПриказ.Сотрудник
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	КадровыйПриказ.Отдел КАК Отдел,
//	               |	СУММА(КадровыйПриказ.Оклад) КАК Оклад,
//	               |	КОЛИЧЕСТВО(КадровыйПриказ.Сотрудник) КАК Сотрудник
//	               |ПОМЕСТИТЬ ВТ_Оклады
//	               |ИЗ
//	               |	Документ.КадровыйПриказ КАК КадровыйПриказ
//	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_ДолжностиПериод КАК ВТ_ДолжностиПериод
//	               |		ПО КадровыйПриказ.Сотрудник = ВТ_ДолжностиПериод.Сотрудник
//	               |			И (ВТ_ДолжностиПериод.ДатаДоговора = КадровыйПриказ.Дата)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	КадровыйПриказ.Отдел
//	               |;
//	               |
//	               |////////////////////////////////////////////////////////////////////////////////
//	               |ВЫБРАТЬ
//	               |	Подразделения.Ссылка КАК Ссылка,
//	               |	Подразделения.Код КАК Код,
//	               |	Подразделения.Наименование КАК Наименование,
//	               |	Подразделения.ПроценОтВыручки КАК ПроценОтВыручки,
//	               |	ВТ_Оклады.Оклад КАК Оклад,
//	               |	ВТ_Оклады.Сотрудник КАК Сотрудник,
//	               |	ВыручкаПредприятия.Значение * (Подразделения.ПроценОтВыручки / 100) КАК ПремияНаОтдел,
//	               |	ВТ_Оклады.Оклад + ВыручкаПредприятия.Значение * (Подразделения.ПроценОтВыручки / 100) КАК ДоходОтдела
//	               |ИЗ
//	               |	Справочник.Подразделения КАК Подразделения
//	               |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_Оклады КАК ВТ_Оклады
//	               |		ПО (ВТ_Оклады.Отдел = Подразделения.Ссылка),
//	               |	Константа.ВыручкаПредприятия КАК ВыручкаПредприятия
//	               |ГДЕ
//	               |	(Подразделения.Код = ""000000105""
//	               |			ИЛИ Подразделения.Родитель.Код = ""000000105""
//	               |			ИЛИ Подразделения.Родитель.Родитель.Код = ""000000105""
//	               |			ИЛИ Подразделения.Родитель.Родитель.Родитель.Код = ""000000105"")";  
//	Выборка = Запрос.Выполнить().Выбрать();
//	
//	Пока Выборка.Следующий() Цикл
//		ОбъектОтдела = Выборка.Ссылка.ПолучитьОбъект();
//		ОбъектОтдела.доход = Выборка.ДоходОтдела; 
//		ОбъектОтдела.Оклад =  Выборка.Оклад;
//		ОбъектОтдела.Премия = Выборка.ПремияНаОтдел;
//		ОбъектОтдела.КоличествоСотрудников = Выборка.Сотрудник; 
//		ОбъектОтдела.Записать();
//	КонецЦикла;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
				   |	СУММА(Подразделения.Премия) КАК Премия,
				   |	СУММА(Подразделения.Оклад) КАК Оклад,
				   |	СУММА(Подразделения.КоличествоСотрудников) КАК КоличествоСотрудников,
				   |	СУММА(Подразделения.Доход) КАК Доход,
				   |	СРЕДНЕЕ(Подразделения.ПроценОтВыручки) КАК ПроценОтВыручки,
				   |	Подразделения.Ссылка КАК Ссылка
				   |ИЗ
				   |	Справочник.Подразделения КАК Подразделения
				   |ГДЕ
				   |	(Подразделения.Код = ""000000105""
				   |			ИЛИ Подразделения.Родитель.Код = ""000000105""
				   |			ИЛИ Подразделения.Родитель.Родитель.Код = ""000000105""
				   |			ИЛИ Подразделения.Родитель.Родитель.Родитель.Код = ""000000105"")
				   |	И Подразделения.Родитель.Ссылка <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
				   |
				   |СГРУППИРОВАТЬ ПО
				   |	Подразделения.Ссылка";
	//Выборка = Запрос.Выполнить().Выбрать();

	Дерево = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкамСИерархией);
	
	Для Каждого СтрПервогоУровня из Дерево.Строки Цикл
		
		Для Каждого стрВторогоУровня из СтрПервогоУровня.Строки Цикл 

			Для Каждого стрТретьегоУровня из СтрВторогоУровня.Строки Цикл
				
				Для Каждого стрЧетвёртогоУровня из стрТретьегоУровня.Строки Цикл
					
				КонецЦикла;
				
			КонецЦикла;
			
		КонецЦикла;
		
	КонецЦикла;
	
				
	
	
//	Пока Выборка.Следующий() Цикл
//		//Попытка
//		ОбъектОтдела = Выборка.РодительСсылка.ПолучитьОбъект();
//		ОбъектОтдела.доход = Выборка.Доход; 
//		ОбъектОтдела.Оклад =  Выборка.Оклад;
//		ОбъектОтдела.Премия = Выборка.Премия;
//		ОбъектОтдела.КоличествоСотрудников = Выборка.КоличествоСотрудников; 
//		ОбъектОтдела.Записать();
//	//Исключение
//		//КонецПопытки;
//	КонецЦикла;

//	Запрос = новый Запрос;
//	Запрос.Текст = "ВЫБРАТЬ
//	               |	СУММА(Подразделения.Премия) КАК Премия,
//	               |	СУММА(Подразделения.Оклад) КАК Оклад,
//	               |	СУММА(Подразделения.КоличествоСотрудников) КАК КоличествоСотрудников,
//	               |	СУММА(Подразделения.Доход) КАК Доход,
//	               |	СРЕДНЕЕ(Подразделения.ПроценОтВыручки) КАК ПроценОтВыручки,
//	               |	Подразделения.Родитель.Родитель КАК РодительСсылка
//	               |ИЗ
//	               |	Справочник.Подразделения КАК Подразделения
//	               |ГДЕ
//	               |	(Подразделения.Код = ""000000105""
//	               |			ИЛИ Подразделения.Родитель.Код = ""000000105""
//	               |			ИЛИ Подразделения.Родитель.Родитель.Код = ""000000105""
//	               |			ИЛИ Подразделения.Родитель.Родитель.Родитель.Код = ""000000105"")
//	               |	И Подразделения.Родитель.Родитель.Ссылка <> ЗНАЧЕНИЕ(Справочник.Подразделения.ПустаяСсылка)
//	               |
//	               |СГРУППИРОВАТЬ ПО
//	               |	Подразделения.Родитель.Родитель";  
//	Выборка = Запрос.Выполнить().Выбрать();
//
//	
//	Пока Выборка.Следующий() Цикл
//		//Попытка
//		ОбъектОтдела = Выборка.РодительСсылка.ПолучитьОбъект();
//		ОбъектОтдела.доход = Выборка.Доход; 
//		ОбъектОтдела.Оклад =  Выборка.Оклад;
//		ОбъектОтдела.Премия = Выборка.Премия;
//		ОбъектОтдела.КоличествоСотрудников = Выборка.КоличествоСотрудников; 
//		ОбъектОтдела.Записать();
//	//Исключение
//		//КонецПопытки;
//	КонецЦикла;

	

	//Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    //Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    //КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    //МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    //ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    //ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    //ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    //Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	//Доход =   Формат(Результат.Итог("Доход"),"ЧДЦ=0; ЧН=-");
	//Премия =  Формат(Результат.Итог("Премия"),"ЧДЦ=0; ЧН=-");
	//Оклады =  Формат(Результат.Итог("Оклад"),"ЧДЦ=0; ЧН=-");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Выручка = Константы.ВыручкаПредприятия.Получить();
КонецПроцедуры

