
&НаКлиенте
Процедура ВыручкаПриИзменении(Элемент)
	ВыручкаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыручкаПриИзмененииНаСервере()
	Константы.ВыручкаПредприятия.Установить(Выручка);
КонецПроцедуры

&НаКлиенте
Процедура Суммировать(Команда)
ПересчётИтогиДокументов();
КонецПроцедуры

Процедура ПересчётИтогиДокументов()

	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
    Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
    КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
    МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
    ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
    ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
    ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
    Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	Доход =   Формат(Результат.Итог("ДоходОтдела"),"ЧДЦ=0; ЧН=-");
	Премия =  Формат(Результат.Итог("ПремияНаОтдел"),"ЧДЦ=0; ЧН=-");
	Оклады =  Формат(Результат.Итог("Оклад"),"ЧДЦ=0; ЧН=-");
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Выручка = Константы.ВыручкаПредприятия.Получить();
КонецПроцедуры

