


#Область ПрограммныйИнтерфейс

Функция ПараметрыЗаполненияВременнойТаблицыТоваров() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПересчитыватьВВалютуРегл", Ложь);
	СтруктураПараметров.Вставить("ВключаяНомераГТД", Ложь);
	СтруктураПараметров.Вставить("ВключаяДоКорректировки", Ложь);
	СтруктураПараметров.Вставить("АктуализироватьРасчеты", Истина);
	СтруктураПараметров.Вставить("ВключатьУслуги", Истина);
	СтруктураПараметров.Вставить("ВключатьТоварыНаКомиссии", Истина);
	
	Возврат СтруктураПараметров;
	
КонецФункции

Процедура СброситьФлагПерезвонилиУКлиента() Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПродажаЗапчастей.Клиент КАК Клиент
	|Поместить КлиентыПолучившиеЗаказ
	|ИЗ
	|	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	|ГДЕ
	|	(((ПродажаЗапчастей.ЕстьДоставка
	|	И ПродажаЗапчастей.ДатаПолучения < &ДатаВПрошлом)
	|	ИЛИ (ПродажаЗапчастей.Самовывоз
	|	И ПродажаЗапчастей.ДатаОтгрузкиСоСклада < &ДатаВПрошлом))
	|	И ПродажаЗапчастей.Клиент.ПерезвонилиПослеДоставки = ИСТИНА)
	|СГРУППИРОВАТЬ ПО
	|	ПродажаЗапчастей.Клиент";
	ДатаВПрошлом  = НачалоДня(ТекущаяДата() - (24 * 60 * 60) * 10);
	Запрос.УстановитьПараметр("ДатаВПрошлом", ДатаВПрошлом);
	Результат = Запрос.Выполнить();
	Если Не Результат.Пустой() Тогда
		Выборка = Результат.Выбрать();
		Пока Выборка.Следующий() Цикл
			КлиентОбъект = Выборка.Клиент.ПолучитьОбъект();
			КлиентОбъект.ПерезвонилиПослеДоставки = Ложь;
			КлиентОбъект.Записать();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры



#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти