
&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата1",Период.ДатаНачала);
	Список.Параметры.УстановитьЗначениеПараметра("Дата2",Период.ДатаОкончания); 
	
	Дата11 = Период.ДатаНачала; 
	Дата22 = Период.ДатаОкончания; 
	
	ЗаписатьКонстантуПериод(Дата11,Дата22) ; 
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ЗаписатьКонстантуПериод(Дата11,Дата22) 
	
	Константы.ПериодСписокЦентРасходаДата1.Установить(Дата11);
	Константы.ПериодСписокЦентРасходаДата2.Установить(Дата22);

КонецФункции

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Дата1 =	ПолучитьКонстантуДата1();
	Дата2 = ПолучитьКонстантуДата2();
	
	Если Дата1 < Дата(2011,1,1) ИЛИ Дата2 < Дата(2011,1,1) ТОГДА 
		
		Дата1 = НачалоМесяца (ТекущаяДата());  
		Дата2 = КонецМесяца (ТекущаяДата()); 
	
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Данные за текущий месяц";
		Сообщение.Сообщить();
	
	КонецЕСли; 
	
	Список.Параметры.УстановитьЗначениеПараметра("Дата1",Дата1);
	Список.Параметры.УстановитьЗначениеПараметра("Дата2",Дата2); 

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьКонстантуДата1();
	
	Дата1 = Константы.ПериодСписокЦентРасходаДата1.Получить(); 
	Возврат Дата1; 

КонецФункции

&НаСервереБезКонтекста
Функция ПолучитьКонстантуДата2();
	
	Дата2 = Константы.ПериодСписокЦентРасходаДата2.Получить(); 
	Возврат Дата2; 

КонецФункции