Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
    	Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ПланРасходы) и ЗначениеЗаполнено(Ссылка) И ЗначениеЗаполнено(ДатаПлан) Тогда 
		
		МенеджерЗаписи = РегистрыСведений.ПланРасходовОтдел.СоздатьМенеджерЗаписи();
	
		МенеджерЗаписи.Отдел	= Ссылка;
		МенеджерЗаписи.Сумма	= ПланРасходы; 
		МенеджерЗаписи.Период	= ДатаПланМесяцпеределатьВДату(); 
		
		МенеджерЗаписи.Записать();
	
	Иначе
		 Отказ = Истина; 	
	КонецЕсли; 
КонецПроцедуры

Функция ДатаПланМесяцпеределатьВДату () 
	
	Год = НачалоГода(ТекущаяДатаСеанса()); 
	Дата = ДобавитьМесяц(Год,ДатаПлан); 
	Дата = ДобавитьМесяц(Дата,-1); 
	
Возврат Дата; 	
КонецФункции 