Функция СтатистикаПоЗаявкамGET(Запрос)
	Ответ = Новый HTTPСервисОтвет(200);
	Попытка
		Запрос = Новый Запрос;
		Запрос.Текст =
		"ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КоличествоЗаявокДень,
		|	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаДокументаДень
		|ПОМЕСТИТЬ День
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ТекДата, ДЕНЬ) И КОНЕЦПЕРИОДА(&ТекДата, ДЕНЬ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КоличествоЗаявокНеделя,
		|	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаДокументаНеделя
		|ПОМЕСТИТЬ Неделя
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ТекДата, НЕДЕЛЯ) И КОНЕЦПЕРИОДА(&ТекДата, НЕДЕЛЯ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	КОЛИЧЕСТВО(РАЗЛИЧНЫЕ ЗаказКлиента.Ссылка) КАК КоличествоЗаявокМесяц,
		|	СУММА(ЗаказКлиента.СуммаДокумента) КАК СуммаДокументаМесяц
		|ПОМЕСТИТЬ Месяц
		|ИЗ
		|	Документ.ЗаказКлиента КАК ЗаказКлиента
		|ГДЕ
		|	ЗаказКлиента.Дата МЕЖДУ НАЧАЛОПЕРИОДА(&ТекДата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ТекДата, МЕСЯЦ)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(День.КоличествоЗаявокДень, 0) КАК КоличествоЗаявокДень,
		|	ЕСТЬNULL(День.СуммаДокументаДень, 0) КАК СуммаДокументаДень,
		|	ЕСТЬNULL(Неделя.КоличествоЗаявокНеделя, 0) КАК КоличествоЗаявокНеделя,
		|	ЕСТЬNULL(Неделя.СуммаДокументаНеделя, 0) КАК СуммаДокументаНеделя,
		|	ЕСТЬNULL(Месяц.КоличествоЗаявокМесяц, 0) КАК КоличествоЗаявокМесяц,
		|	ЕСТЬNULL(Месяц.СуммаДокументаМесяц, 0) КАК СуммаДокументаМесяц
		|ИЗ
		|	День КАК День,
		|	Неделя КАК Неделя,
		|	Месяц КАК Месяц";

		Запрос.УстановитьПараметр("ТекДата", ТекущаяДата());

		РезультатЗапроса = Запрос.Выполнить();

		Выборка = РезультатЗапроса.Выбрать();
		СтруктураОтвета = Новый Структура;
		Пока Выборка.Следующий() Цикл
			СтруктураОтвета.Вставить("count_day", (Выборка.КоличествоЗаявокДень));
			СтруктураОтвета.Вставить("sum_day", (Выборка.СуммаДокументаДень));

			СтруктураОтвета.Вставить("count_week", (Выборка.КоличествоЗаявокНеделя));
			СтруктураОтвета.Вставить("sum_week", (Выборка.СуммаДокументаНеделя));

			СтруктураОтвета.Вставить("count_month", (Выборка.КоличествоЗаявокМесяц));
			СтруктураОтвета.Вставить("sum_month", (Выборка.СуммаДокументаМесяц));
		КонецЦикла;
	Исключение
		Инфо = ИнформацияОбОшибке();
		Ответ = Новый HTTPСервисОтвет(500);
		Ответ.УстановитьТелоИзСтроки("" + Инфо.Описание);
		Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
		Возврат Ответ;
	КонецПопытки;
	Запись = Новый ЗаписьJSON;
	Запись.УстановитьСтроку();
	ЗаписатьJSON(Запись, СтруктураОтвета);
	Данные = Запись.Закрыть();
	Ответ.УстановитьТелоИзСтроки(Данные);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	Возврат Ответ;
КонецФункции

Функция ПолучитьПланМенеджеровПоЗаявкамGET(Запрос)
	
//	Тело = Запрос.ПолучитьТелоКакстроку();
//	ЧтениеJSON = Новый ЧтениеJSON;
//	ЧтениеJSON.УстановитьСтроку(Тело);
//	Массив  = ПрочитатьJSON(ЧтениеJSON);
	
//	ДатаПериод = Массив.data;
	
//	НаборЗаписей = РегистрыСведений.ПланМенеджеровПоЗаявкам.СоздатьНаборЗаписей();
//	НаборЗаписей.Отбор.Период.Установить(ДатаПериод);
//	НаборЗаписей.Отбор.Период.СрезПоследнихУстановить(ТекущаяДата());	
//	НаборЗаписей.Прочитать();
	
	ТаблицаЦен = РегистрыСведений.ПланМенеджеровПоЗаявкам.СрезПоследних(ТекущаяДата());
	СтруктураОтвет = Новый Структура(); 
	
	Для каждого Запись из ТаблицаЦен Цикл
		СтруктураОтвет.Вставить("day_plan",Запись.ПланНаДень);;
		СтруктураОтвет.Вставить("week_plan",Запись.ПланНаНеделю);
		СтруктураОтвет.Вставить("month_plan",Запись.ПланНаМесяц);    
	    СтруктураОтвет.Вставить("data",Запись.Период);      
	КонецЦикла;
	
	
	
//	СтруктураОтвет = Новый Структура(); 
//	
//	Для каждого Запись из НаборЗаписей Цикл
//		СтруктураОтвет.Вставить("day_plan",Запись.ПланНаДень);;
//		СтруктураОтвет.Вставить("week_plan",Запись.ПланНаНеделю);
//		СтруктураОтвет.Вставить("month_plan",Запись.ПланНаМесяц);    
//	    СтруктураОтвет.Вставить("data",Запись.Период);      
//	КонецЦикла;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, СтруктураОтвет);
	СтрокаДляОтвета = ЗаписьJSON.Закрыть();
	Ответ = Новый HTTPСервисОтвет(200);
	Ответ.Заголовки.Вставить("Content-type", "application/json;  charset=utf-8");
	Ответ.УстановитьТелоИзСтроки(СтрокаДляОтвета, КодировкаТекста.UTF8,ИспользованиеByteOrderMark.НеИспользовать);

	Возврат Ответ;	
КонецФункции

Функция ОпубликоватьПланМенеджеровПоЗаявкамPostManagerPlan(Запрос)
	
	Тело = Запрос.ПолучитьТелоКакстроку();
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(Тело);
	Массив  = ПрочитатьJSON(ЧтениеJSON);

	ПланНаДень 		= Массив.day_plan;
	ПланНаНеделю	= Массив.week_plan;
	ПланНаМесяц 	= Массив.month_plan;
	//ДатаПериод	= Массив.data; 
	
	МенеджерЗаписи = РегистрыСведений.ПланМенеджеровПоЗаявкам.СоздатьМенеджерЗаписи();
	
	МенеджерЗаписи.ПланНаДень 	= ПланНаДень;
	МенеджерЗаписи.ПланНаНеделю = ПланНаНеделю;
	МенеджерЗаписи.ПланНаМесяц	= ПланНаМесяц;
	//МенеджерЗаписи.Период		= ДатаПериод; 
	МенеджерЗаписи.Период		= НачалоДня(ТекущаяДата() + 86400); 
	
	МенеджерЗаписи.Записать();

	Ответ = Новый HTTPСервисОтвет(204);
	Ответ.Заголовки.Вставить("Content-Type", "application/json; charset=utf-8");
	Возврат Ответ;
КонецФункции


























