
&НаСервере
Процедура ПриОткрытииНаСервере()
	
	Каналы = Новый СписокЗначений();
	Каналы.Добавить(Справочники.ИсточникиОбращений.НайтиПоКоду("000000001"));
	Каналы.Добавить(Справочники.ИсточникиОбращений.НайтиПоКоду("000000073")); 
	Каналы.Добавить(Справочники.ИсточникиОбращений.НайтиПоКоду("000000074"));
	Каналы.Добавить(Справочники.ИсточникиОбращений.НайтиПоКоду("000000076"));
	Каналы.Добавить(Справочники.ИсточникиОбращений.НайтиПоКоду("000000078"));
	
	
	Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.Элементы.Найти("Каналы").Значение = Каналы; 
	
	
	
	
	КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры
