
&НаКлиенте
Процедура Печать(Команда)

	ТабДокумент = ПечатьСервер();
	ТабДокумент.Показать();

	
КонецПроцедуры

&НаСервере
Функция ПечатьСервер()

	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.АвтоМасштаб = Истина;
	Макет       =   ПолучитьМакет("Макет");
	ОбластьМакета = Макет.ПолучитьОбласть("Шапка");
	ОбластьМакета.Параметры.ИтогСумма = ""+ИтогоРасходов()+"р.";
	ТабДокумент.Вывести(ОбластьМакета);
	
	Строка = Макет.ПолучитьОбласть("Строка");
	
	Таблица1 = ПолучитьТаблицу();
	
	Для Каждого строка1 Из Таблица1 Цикл
		Строка.Параметры.Дата = строка1.Период;
		Строка.Параметры.Тип = строка1.ВидРасхода;
		Строка.Параметры.Комментарий = строка1.Комментарий;
		Строка.Параметры.НомДок = строка1.ДокНо;
		Строка.Параметры.Сумма = строка1.Сумма;
		ТабДокумент.Вывести(Строка);
	КонецЦикла;
	
	Возврат ТабДокумент;

КонецФункции // ПечатьСервер()

&НаСервере
Функция ПолучитьМакет(название)
	Возврат  Отчеты.РасходыДетальный.ПолучитьМакет(название);
КонецФункции

&НаСервере
Функция ПолучитьТаблицу()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	Расходы.ВидРасхода,
	               |	Расходы.Комментарий,
	               |	Расходы.ДокНо,
	               |	Расходы.Сумма,
	               |	Расходы.Период
	               |ИЗ
	               |	РегистрНакопления.Расходы КАК Расходы";
	Реультат = Запрос.Выполнить();
    Возврат Реультат.Выгрузить();
КонецФункции

Функция ИтогоРасходов()
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	| СУММА(РасходыОстатки.СуммаОстаток) КАК СуммаОстаток
	| ИЗ
	| РегистрНакопления.Расходы.Остатки КАК РасходыОстатки";
	Реультат = Запрос.Выполнить();
    Таблица = Реультат.Выгрузить();
	Возврат Таблица.Итог("СуммаОстаток");
КонецФункции;

