
&НаКлиенте
Процедура СписокПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	Всего = 0;
	Нам = 0;
	Марат = 0;
	спис = Табл();
	//Для Каждого стр из спис Цикл
	//	Всего = Всего + стр.Сумма;
	//	Нам = Нам + стр.Нам;
	//	Марат = Марат + стр.Марату;
	//КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Всего = 0;
	Нам = 0;
	Марату = 0;
	Год = Год(ТекущаяДата());
	Месяц = Месяц(ТекущаяДата());
	спис = Табл();
	//Для Каждого стр из спис Цикл
	//	Всего = Всего + стр.Сумма;
	//	Нам = Нам + стр.Нам;
	//	Марату = Марату + стр.Марату;
	//КонецЦикла;
	
    
КонецПроцедуры

&НаСервере
Функция Табл()
	податам = ложь;
	 Если Год >= 2011 ИЛИ  Месяц > 0 Тогда
		 податам = истина;
		 Если Месяц  > 0 И Год < 2011 Тогда
			 Год = Год(ТекущаяДата());
		 КонецЕсли;
		 Если Месяц > 0 Тогда
			Дат1 = Дата(Год,Месяц,1);
			Дат2 = КонецМесяца(Дат1);
		Иначе
		   Дат1 = Дата(Год,1,1);
		   Дат2 = КонецГода(Дат1);
	   КонецЕсли
	   
	 КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВыводДенегИзРазборки.Сумма,
	               |	ВыводДенегИзРазборки.Нам,
				   |	ВыводДенегИзРазборки.Artem,
	               |	ВыводДенегИзРазборки.Марату
	               |ИЗ
	               |	Документ.ВыводДенегИзРазборки КАК ВыводДенегИзРазборки";
				   
	Если податам Тогда
		Текст = Запрос.Текст;
		Текст = Текст + " ГДЕ ВыводДенегИзРазборки.Дата >= &Дата1 И ВыводДенегИзРазборки.Дата < &Дата2";
		Запрос.Текст = Текст;
		Запрос.УстановитьПараметр("Дата1",Дат1);
		Запрос.УстановитьПараметр("Дата2",Дат2);
		Текст = "ВЫБРАТЬ
		        |	ВыводДенегИзРазборки.Ссылка,
		        |	ВыводДенегИзРазборки.ВерсияДанных,
		        |	ВыводДенегИзРазборки.ПометкаУдаления,
		        |	ВыводДенегИзРазборки.Номер,
		        |	ВыводДенегИзРазборки.Дата,
		        |	ВыводДенегИзРазборки.Проведен,
		        |	ВыводДенегИзРазборки.Машина,
		        |	ВыводДенегИзРазборки.Кому,
		        |	ВыводДенегИзРазборки.Сумма,
		        |	ВыводДенегИзРазборки.Нам,
		        |	ВыводДенегИзРазборки.Марату,
		        |	ВыводДенегИзРазборки.Artem,
		        |	ВыводДенегИзРазборки.ИтогоОткатов,
		        |	ВыводДенегИзРазборки.Кто,
		        |	ВыводДенегИзРазборки.МаратуНаличкой
		        |ИЗ
		        |	Документ.ВыводДенегИзРазборки КАК ВыводДенегИзРазборки
		        |ГДЕ
		        |	ВыводДенегИзРазборки.Дата >= &Дата1
		        |	И ВыводДенегИзРазборки.Дата < &Дата2";
		Список.ТекстЗапроса = Текст;
		Список.Параметры.УстановитьЗначениеПараметра("Дата1",Дат1);
		Список.Параметры.УстановитьЗначениеПараметра("Дата2",Дат2);
	Иначе
		Текст = "ВЫБРАТЬ
		        |	ВыводДенегИзРазборки.Ссылка,
		        |	ВыводДенегИзРазборки.ВерсияДанных,
		        |	ВыводДенегИзРазборки.ПометкаУдаления,
		        |	ВыводДенегИзРазборки.Номер,
		        |	ВыводДенегИзРазборки.Дата,
		        |	ВыводДенегИзРазборки.Проведен,
		        |	ВыводДенегИзРазборки.Машина,
		        |	ВыводДенегИзРазборки.Кому,
		        |	ВыводДенегИзРазборки.Сумма,
		        |	ВыводДенегИзРазборки.Нам,
		        |	ВыводДенегИзРазборки.Марату,
		        |	ВыводДенегИзРазборки.Artem,
		        |	ВыводДенегИзРазборки.ИтогоОткатов,
		        |	ВыводДенегИзРазборки.Кто,
		        |	ВыводДенегИзРазборки.МаратуНаличкой
		        |ИЗ
		        |	Документ.ВыводДенегИзРазборки КАК ВыводДенегИзРазборки";
		Список.ТекстЗапроса = Текст;
		Запрос.Текст = Текст;
	КонецЕсли;
  rez = Запрос.Выполнить().Выгрузить();
  Марату = rez.Итог("Марату");
  Нам = rez.Итог("Нам");
  Артему = rez.Итог("Artem");
  Всего = Марату + Артему + Нам;
  // Возврат Запрос.Выполнить().Выгрузить();
  Возврат 0;
КонецФункции
			   

&НаКлиенте
Процедура Месяц1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	 ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура Год1ПриИзменении(Элемент)
	// Вставить содержимое обработчика.
	ОбновитьИтоги();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьИтоги()
   Всего = 0;
	Нам = 0;
	Марат = 0;
	Артему = 0;
	спис = Табл();
КонецПроцедуры


