
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТИПЗНЧ(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказНаряд")  Тогда
		
		ЗаказНаряд = ДанныеЗаполнения;  
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказНарядДефектовочныйЛист.Номенклатура КАК Товар,
			|	ЗаказНарядДефектовочныйЛист.Количество КАК Количество,
			|	ЗаказНарядДефектовочныйЛист.Цена КАК ЦенаВЗаказНаряде,
			|	ЗаказНарядДефектовочныйЛист.Комментарий КАК Комментарий
			|ИЗ
			|	Документ.ЗаказНаряд.ДефектовочныйЛист КАК ЗаказНарядДефектовочныйЛист
			|ГДЕ
			|	ЗаказНарядДефектовочныйЛист.Ссылка = &СсылкаЗакНар
			|	И ЗаказНарядДефектовочныйЛист.Остаток = ""Нет на складе""";
		
		Запрос.УстановитьПараметр("СсылкаЗакНар",ЗаказНаряд);
		РезультатЗапроса = Запрос.Выполнить().Выгрузить();
		ЗакупленныйТовар.Загрузить(РезультатЗапроса);
		
		Для каждого Строка ИЗ ЗакупленныйТовар Цикл 
			Строка.Сумма = Строка.ЦенаВЗаказНаряде * Строка.Количество; 
			СуммаДокумента = СуммаДокумента	+ (Строка.ЦенаВЗаказНаряде * Строка.Количество);
		КонецЦикла;
			
	КонецЕСли; 
	КонецПроцедуры






















