

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если ТИПЗНЧ(ДанныеЗаполнения) = ТИП("") Тогда 
		
		Запрос = Новый Запрос;
		Запрос.Текст =
			"ВЫБРАТЬ
			|	ЗаказНарядДефектовочныйЛист.Ссылка,
			|	ЗаказНарядДефектовочныйЛист.Номенклатура,
			|	ЗаказНарядДефектовочныйЛист.Состояние,
			|	ЗаказНарядДефектовочныйЛист.Партия,
			|	ЗаказНарядДефектовочныйЛист.Количество,
			|	ЗаказНарядДефектовочныйЛист.Остаток,
			|	ЗаказНарядДефектовочныйЛист.Цена,
			|	ЗаказНарядДефектовочныйЛист.Комментарий
			|ИЗ
			|	Документ.ЗаказНаряд.ДефектовочныйЛист КАК ЗаказНарядДефектовочныйЛист";
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			// Вставить обработку выборки ВыборкаДетальныеЗаписи
		КонецЦикла;
		
	

	КонецЕСли; 


КонецПроцедуры
