
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Реквизит1.ТипДиаграммы = ТипДиаграммы.Гистограмма;
	сер1 = Реквизит1.УстановитьСерию("222");
	сер2 = Реквизит1.УстановитьСерию("333"); 
	Т1 = Реквизит1.УстановитьТочку("Январь");
	Т2 = Реквизит1.УстановитьТочку("Февраль");
	Т3 = Реквизит1.УстановитьТочку("Март");
	Т4 = Реквизит1.УстановитьТочку("Апрель");
	Т5 = Реквизит1.УстановитьТочку("Май");
	Т6 = Реквизит1.УстановитьТочку("Июнь");
	Т7 = Реквизит1.УстановитьТочку("Июль");
	Т8 = Реквизит1.УстановитьТочку("Август");
	Т9 = Реквизит1.УстановитьТочку("Сентябрь");
	Т10 = Реквизит1.УстановитьТочку("Октябрь");
	Т11 = Реквизит1.УстановитьТочку("Ноябрь");
	Т12 = Реквизит1.УстановитьТочку("Декабрь");
	Текст = "ВЫБРАТЬ
	        |	ПродажаЗапчастей.ИтогоРекв
	        |ИЗ
	        |	Документ.ПродажаЗапчастей КАК ПродажаЗапчастей
	        |ГДЕ
	        |	ПродажаЗапчастей.Дата МЕЖДУ &Дата1 И &Дата2
	        |	И ПродажаЗапчастей.Оплачено = ИСТИНА";
	Запрос = Новый Запрос;
	Запрос.Текст = Текст;
	Расход = Новый Запрос;
	Расход.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	Расходы.Сумма
	               |ИЗ
	               |	Документ.Расходы КАК Расходы
	               |ГДЕ
	               |	Расходы.Дата МЕЖДУ &Дата1 И &Дата2";
	//===============================================================
	Дат1 = Дата("20120101000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Январь = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
	Январь = Январь - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20120201000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Февраль = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Февраль = Февраль - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20120301000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Март = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Март = Март - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20120401000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Апрель = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
	Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Апрель = Апрель - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20120501000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Май = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Май = Май - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20120601000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Июнь = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Июнь = Июнь - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20120701000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Июль = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Июль = Июль - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20120801000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Август = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Август = Август - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20120901000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Сентябрь = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Сентябрь = Сентябрь - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20121001000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Октябрь = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Октябрь = Октябрь - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20121101000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Ноябрь = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
	Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Ноябрь = Ноябрь - Расход.Выполнить().Выгрузить().Итог("Сумма");
	//===============================================================
	Дат1 = Дата("20121201000000");
	Дат2 = КонецМесяца(Дат1);
	Запрос.УстановитьПараметр("Дата1",Дат1);
	Запрос.УстановитьПараметр("Дата2",Дат2);
	Декабрь = Запрос.Выполнить().Выгрузить().Итог("ИтогоРекв");
    Расход.УстановитьПараметр("Дата1",Дат1);
	Расход.УстановитьПараметр("Дата2",Дат2);
	Декабрь = Декабрь - Расход.Выполнить().Выгрузить().Итог("Сумма");
	

	Реквизит1.УстановитьЗначение(Т1,сер1,Январь);
	Реквизит1.УстановитьЗначение(Т2,сер1,Февраль);
	Реквизит1.УстановитьЗначение(Т3,сер1,Март);
	Реквизит1.УстановитьЗначение(Т4,сер1,Апрель);
	Реквизит1.УстановитьЗначение(Т5,сер1,Май);
	Реквизит1.УстановитьЗначение(Т6,сер1,Июнь);
	Реквизит1.УстановитьЗначение(Т7,сер1,Июль);
	Реквизит1.УстановитьЗначение(Т8,сер1,Август);
	Реквизит1.УстановитьЗначение(Т9,сер1,Сентябрь);
	Реквизит1.УстановитьЗначение(Т10,сер1,Октябрь);
	Реквизит1.УстановитьЗначение(Т11,сер1,Ноябрь);
	Реквизит1.УстановитьЗначение(Т12,сер1,Декабрь);
	Реквизит1.ОтображатьЛегенду = Ложь;
КонецПроцедуры
