
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр РегистрНакопления1 Приход
	Движения.РегистрНакопления1.Записывать = Истина;
	
	Если Направление Тогда
		Для Каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Период = Дата;
			Движение.Склад  = ТекСтрокаНоменклатураСписок.Склад;
			Движение.Товар  = ТекСтрокаНоменклатураСписок.Номенклатураспис;
			Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
			Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
			Движение.Колво  = ТекСтрокаНоменклатураСписок.Количество; 
			
			об = РегистрыСведений.ИндНомер.СоздатьМенеджерЗаписи();
			об.индкод = ТекСтрокаНоменклатураСписок.Партия;
			об.Прочитать();	
			Если Не об.Выбран() И Не ПустаяСтрока(ТекСтрокаНоменклатураСписок.Партия)  Тогда
				
				об.Код = ТекСтрокаНоменклатураСписок.Партия;
				об.индкод = ТекСтрокаНоменклатураСписок.Партия; 
				
				об.Записать();
			КонецЕсли;
			
		КонецЦикла;
		//Если Полная Тогда
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = Склад;
			Движение.Товар = Номенклатура;
			Движение.машина = Машина;
			Движение.индкод = Инкод;
			Движение.Колво = 1;
		//КонецЕсли;
	Иначе
		// регистр РегистрНакопления1 Расход
		///+ГомзМА 03.02.2023 (Задача 000002611 от 27.01.2023)
		//Если Состояние = Перечисления.СостояниеКомплектовки.ВРаботе ИЛИ 
		//	Состояние = Перечисления.СостояниеКомплектовки.Выполнено Тогда
		//	
		//	Движение = Движения.РегистрНакопления1.Добавить();
		//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//	Движение.Период = Дата;
		//	Движение.Склад = Справочники.Склады.НайтиПоКоду("000000017");
		//	Движение.Товар = Номенклатура;
		//	Движение.машина = Машина;
		//	Движение.индкод = Инкод;
		//	Движение.Колво = 1; 
		//	
		//		об = РегистрыСведений.ИндНомер.СоздатьМенеджерЗаписи();
		//	об.индкод =Инкод;
		//	об.Прочитать();	
		//	Если Не об.Выбран() И Не ПустаяСтрока(Инкод)  Тогда
		
		//	об.Код = Инкод;
		//	об.индкод = Инкод;
		//	об.Записать();
		//	КонецЕсли;
		
		//	Для каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
		//		Движение = Движения.РегистрНакопления1.Добавить();
		//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		//		Движение.Период = Дата;
		//		Движение.Склад = ТекСтрокаНоменклатураСписок.Склад;
		//		Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
		//		Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
		//		Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
		//		Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
		//	КонецЦикла; 
		//	Для каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
		//		Движение = Движения.РегистрНакопления1.Добавить();
		//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		//		Движение.Период = Дата;
		//		Движение.Склад = Справочники.Склады.НайтиПоКоду("000000017");
		//		Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
		//		Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
		//		Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
		//		Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
		//	КонецЦикла; 
		//ИначеЕсли Состояние = Перечисления.СостояниеКомплектовки.Разнесено Тогда
		Движение = Движения.РегистрНакопления1.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Склад = Склад;
		Движение.Товар = Номенклатура;
		Движение.машина = Машина;
		Движение.индкод = Инкод;
		Движение.Колво = 1;  
		
		об = РегистрыСведений.ИндНомер.СоздатьМенеджерЗаписи();
		об.индкод =Инкод;
		об.Прочитать();	
		Если Не об.Выбран() И Не ПустаяСтрока(Инкод)  Тогда
			
			об.Код = Инкод;
			об.индкод = Инкод; 
			об.Состояние = Перечисления.Состояние.Восстановленная;  
			//об.Стеллаж = Перечисления.Состояние.Восстановленная;
			об.Записать();
		КонецЕсли;
		
		Для каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
			Движение = Движения.РегистрНакопления1.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Склад = ТекСтрокаНоменклатураСписок.Склад;
			Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
			Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
			Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
			Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
		КонецЦикла;
	КонецЕсли;
	//КонецЕсли;
	///-ГомзМА 03.02.2023 (Задача 000002611 от 27.01.2023)
	//	
	//	Для Каждого ТекСтрокаНоменклатураСписок Из НоменклатураСписок Цикл
	//		Движение = Движения.РегистрНакопления1.Добавить();
	//		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
	//		Движение.Период = Дата;
	//		Движение.Склад = ТекСтрокаНоменклатураСписок.Склад;
	//		Движение.Товар = ТекСтрокаНоменклатураСписок.Номенклатураспис;
	//		Движение.машина = ТекСтрокаНоменклатураСписок.Автомобиль;
	//		Движение.индкод = ТекСтрокаНоменклатураСписок.Партия;
	//		Движение.Колво = ТекСтрокаНоменклатураСписок.Количество;
	//	КонецЦикла;
	//	Движение = Движения.РегистрНакопления1.Добавить();
	//	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	//	Движение.Период = Дата;
	//	Движение.Склад = Склад;
	//	Движение.Товар = Номенклатура;
	//	Движение.машина = Машина;
	//	Движение.индкод = Инкод;
	//	Движение.Колво = 1;
	//КонецЕсли;
	
	Движения.Записать();
	
	Отказ = РегистрыНакопления.РегистрНакопления1.ЕстьОтрицательныеОстатки(Ссылка, Дата, Склад);
	
	///+ГомзМА 23.03.2023
	ЗаписьВРегистреСведений 		= РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
	ЗаписьВРегистреСведений.Машина  = Машина;
	ЗаписьВРегистреСведений.Товар 	= Номенклатура;
	ЗаписьВРегистреСведений.индкод 	= Инкод;
	ЗаписьВРегистреСведений.Прочитать();
	
	Если (Не ЗаписьВРегистреСведений.Выбран()) И (Не ПустаяСтрока(Комментарий)) Тогда
		ЗаписьВРегистреСведений.Комментарий = Комментарий;
		ЗаписьВРегистреСведений.Машина 		= Машина;
		ЗаписьВРегистреСведений.Товар 		= Номенклатура;
		ЗаписьВРегистреСведений.индкод 		= Инкод;
		
		ЗаписьВРегистреСведений.Записать();
	Иначе
		ЗаписьВРегистреСведений.Комментарий = Комментарий;
		ЗаписьВРегистреСведений.Записать(Истина);
	КонецЕсли;
	
	// Получим таблицу партий
	ТаблицаТовары = НоменклатураСписок.Выгрузить();
	
	Для Каждого ТекСтрокаТаблица Из ТаблицаТовары Цикл
		индкод = ТекСтрокаТаблица.Партия;
		ЗаписьВРегистреСведений 		= РегистрыСведений.Комментарии.СоздатьМенеджерЗаписи();
		ЗаписьВРегистреСведений.Машина  = ТекСтрокаТаблица.Автомобиль;
		ЗаписьВРегистреСведений.Товар 	= ТекСтрокаТаблица.Номенклатураспис;
		ЗаписьВРегистреСведений.индкод  = индкод;
		ЗаписьВРегистреСведений.Прочитать();
		Если (Не ЗаписьВРегистреСведений.Выбран()) И (Не ПустаяСтрока(ТекСтрокаТаблица.Комментарий)) Тогда
			ЗаписьВРегистреСведений.Комментарий = ТекСтрокаТаблица.Комментарий;
			ЗаписьВРегистреСведений.Машина 		= ТекСтрокаТаблица.Автомобиль;
			ЗаписьВРегистреСведений.Товар 		= ТекСтрокаТаблица.Номенклатураспис;
			ЗаписьВРегистреСведений.индкод 		= индкод;
			
			ЗаписьВРегистреСведений.Записать();
		Иначе
			ЗаписьВРегистреСведений.Комментарий = ТекСтрокаТаблица.Комментарий;
			ЗаписьВРегистреСведений.Записать(Истина);
		КонецЕсли;
	КонецЦикла;
	///-ГомзМА 23.03.2023
	
КонецПроцедуры




