#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ПараметрКоманды);
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ПараметрКоманды);
	ТабДок = СформироватьТабДок(ОбъектыПечати, МассивСсылок);
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыТабДокумента = СтруктураПараметровТабДок(ТабДок);
	ТабДок.Записать("C:\ФайлыУПД\test.xls", ТипФайлаТабличногоДокумента.XLS);
	//Сериализовать(ПараметрКоманды);
	
	Сообщить("Файл скачан");
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция СформироватьТабДок(Знач ОбъектПечати, МассивСсылок)
	ПараметрыПечати = Новый Структура;
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивСсылок);
	ТабДок = Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуУПД(СтруктураТипов, ОбъектПечати, ПараметрыПечати);
	Возврат ТабДок;
	
КонецФункции

&НаСервере
Процедура Сериализовать(Значение)
	Фабрика = Новый ФабрикаXDTO;
	Сериализатор = Новый СериализаторXDTO(Фабрика);
	ЗаписьXML = Новый ЗаписьXML;
	ЗаписьXML.ОткрытьФайл("C:\ФайлыУПД\test.xml");
	Сериализатор.ЗаписатьXML(ЗаписьXML, Значение);
	ЗаписьXML.Закрыть();
КонецПроцедуры


Функция СтруктураПараметровТабДок(ТабДок)
	Параметры = Новый Структура;
	
	ВесьТабДокВСтроку = ЗначениеВСтрокуВнутр(ТабДок);
	Счетчик = 0; 
	КоличествоСтрок = СтрЧислоСтрок(ВесьТабДокВСтроку);  
	МассивСтрок = Новый Массив; 
	Пока Счетчик < КоличествоСтрок Цикл 
		Счетчик  = Счетчик + 1;
		ОчереднаяСтрока = СтрПолучитьСтроку(ВесьТабДокВСтроку, Счетчик);
		Если  СтрНачинаетсяС(ОчереднаяСтрока, "{""#""") Тогда 
			МассивИзСтроки = СтрРазделить(ОчереднаяСтрока, Символ(34));
			Если МассивИзСтроки.Количество() = 5 Тогда
				МассивСтрок.Добавить(МассивИзСтроки[3]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	//{"#","Универсальный передаточный документ"} 
	Возврат МассивСтрок;		 
	//Пока й < Кво Цикл
	//	й = й+1; 
	//	СтрТхт = СтрПолучитьСтроку(Тхт,й);
	//	Лев4 = Лев(СокрЛП(СтрТхт),4);
	//	Если (Лев4 = "{16,") или (Лев4 = "{24,") Тогда // 16 = расшифровки нет, 24 = есть
	//		Сч1 =1;
	//		Сч2 =0; НовыйТекст = СтрТхт;
	//		Пока й<Кво Цикл
	//			й = й+1; СтрТхт = СтрПолучитьСтроку(Тхт,й);
	//			Сч1 = Сч1+СтрЧислоВхождений(СтрТхт,"{");
	//			Сч2 = Сч2+СтрЧислоВхождений(СтрТхт,"}");
	//			НовыйТекст = НовыйТекст + СтрТхт;
	//			Если Сч1 <= Сч2 Тогда
	//				Прервать;
	//			КонецЕсли;
	//		КонецЦикла;                    
	//		//ЯЗЫК ИСКЛЮЧИТЕЛЬНО И ТОЛЬКО ПУСТОЙ!!! ТАКОЕ НЕ ДОПУСТИМО:  ",{1,1,{""ru"","""
	//		СтрНачало=  ",{1,1,{"""",""";
	//		СтрКонец = """}},0},";
	//		ДлНачало = СтрДлина(СтрНачало);            
	//		Поз1=СтрНайти(НовыйТекст,СтрНачало);
	//		Поз2=СтрНайти(НовыйТекст,СтрКонец);
	//		Если 0 < Поз1 И Поз1+ДлНачало<Поз2 Тогда
	//			Поз1 = Поз1+ДлНачало;
	//			ИмяПараметра = Сред(НовыйТекст,Поз1,Поз2-Поз1);
	//			// ПараметрыМакетаТабличногоДокумента => Структура
	//			Параметры.Вставить(ИмяПараметра,ТабДок.Параметры[ИмяПараметра]);
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЦикла; 
	
	//Возврат Параметры;
КонецФункции

#КонецОбласти