#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	ОбъектыПечати = Новый СписокЗначений;
	ОбъектыПечати.Добавить(ПараметрКоманды);
	МассивСсылок = Новый Массив;
	МассивСсылок.Добавить(ПараметрКоманды);
	ТабДок = СформироватьТабДок(ОбъектыПечати, МассивСсылок);
	Если ТабДок = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ПараметрыТабДокумента = СтруктураПараметровТабДок(ТабДок);
	//ТабДок.Записать("C:\ФайлыУПД\test.xls", ТипФайлаТабличногоДокумента.XLS);
	//Сериализовать(ПараметрКоманды);

	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	//Диалог.Фильтр = "XML (*.XML)|*.XML|";
	Если Диалог.Выбрать() Тогда
		ИмяФайла = Диалог.ПолноеИмяФайла;

		СформитроватьФайл(ИмяФайла);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура СформитроватьФайл(ИмяФайла)

	ЗаписьXML = Новый ЗаписьXML;

	ЗаписьXML.ОткрытьФайл(ИмяФайла);

	ЗаписьXML.ЗаписатьОбъявлениеXML();

	ЗаписьXML.ЗаписатьНачалоЭлемента("Файл"); //Файл 
		ЗаписьXML.ЗаписатьАтрибут("ИдФайл", "ON_NSCHFDOPPR_2HE-Rec_2HE-Sen_20200101_12345");
		ЗаписьXML.ЗаписатьАтрибут("ВерсПрог", "hedo");
		ЗаписьXML.ЗаписатьАтрибут("ВерсФорм", "5.01");
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвУчДокОбор ");  //СвУчДокОбор
		ЗаписьXML.ЗаписатьАтрибут("ИдОтпр", "2HE-Sen");
		ЗаписьXML.ЗаписатьАтрибут("ИдПол", "2HE-Rec");
		ЗаписьXML.ЗаписатьАтрибут("ИдЭДО", "2HE");
		ЗаписьXML.ЗаписатьНачалоЭлемента("СвОЭДОтпр  ");  //СвОЭДОтпр 
		ЗаписьXML.ЗаписатьАтрибут("НаимОрг", "Наименование ЮЛ Оператора");
		ЗаписьXML.ЗаписатьАтрибут("ИННЮЛ", "7235259798");
		ЗаписьXML.ЗаписатьАтрибут("ИдЭДО", "2HE");
		ЗаписьXML.ЗаписатьКонецЭлемента(); //СвОЭДОтпр />
		ЗаписьXML.ЗаписатьКонецЭлемента(); //СвУчДокОбор />

	ЗаписьXML.ЗаписатьКонецЭлемента(); //Файл /> 
	ЗаписьXML.Закрыть();
КонецПроцедуры

&НаСервере
Функция СформироватьТабДок(Знач ОбъектПечати, МассивСсылок)
	ПараметрыПечати = Новый Структура;
	СтруктураТипов = ОбщегоНазначенияУТ.СоответствиеМассивовПоТипамОбъектов(МассивСсылок);
	ТабДок = Обработки.ПечатьОбщихФорм.СформироватьПечатнуюФормуУПД(СтруктураТипов, ОбъектПечати, ПараметрыПечати);
	Возврат ТабДок;

КонецФункции
Функция СтруктураПараметровТабДок(ТабДок)
	ВесьТабДокВСтроку = ЗначениеВСтрокуВнутр(ТабДок);
	Счетчик = 0;
	КоличествоСтрок = СтрЧислоСтрок(ВесьТабДокВСтроку);
	МассивСтрок = Новый Массив;
	Пока Счетчик < КоличествоСтрок Цикл
		Счетчик  = Счетчик + 1;
		ОчереднаяСтрока = СтрПолучитьСтроку(ВесьТабДокВСтроку, Счетчик);
		Если СтрНачинаетсяС(ОчереднаяСтрока, "{""#""") Тогда
			МассивИзСтроки = СтрРазделить(ОчереднаяСтрока, Символ(34));
			Если МассивИзСтроки.Количество() = 5 Тогда
				МассивСтрок.Добавить(МассивИзСтроки[3]);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	Возврат МассивСтрок;
КонецФункции

#КонецОбласти