#Область ОбработчикиСобытий
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды) 
	//Комлев АА 11/12/24 +++ 
	Если Не дт_ОбщегоНазначенияВызовСервераПовтИсп.НомерУПДЗаполнен(ПараметрКоманды) Тогда
		Сообщить("Номер УПД не заполнен.");
		Возврат;
	КонецЕсли;

	ДиалогВыбораФайла = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);  // выбор каталога
	ДиалогВыбораФайла.Заголовок = "Выберите каталог!";
	ДиалогВыбораФайла.ПолноеИмяФайла = ДиалогВыбораФайла.Каталог;
	Если ДиалогВыбораФайла.Выбрать() Тогда
		Каталог = ДиалогВыбораФайла.Каталог;
		Адрес =  дт_ОбщегоНазначенияВызовСервераПовтИсп.СоздатьXMLФайл(Каталог, ПараметрКоманды, "ПродажаЗапчастей");
		ДвоичныеДанные  =  ПолучитьИзВременногоХранилища(Адрес); 
//		УдалитьИзВременногоХранилища(Адрес);
		ДвоичныеДанные.Записать(Каталог + "/" + дт_ОбщегоНазначенияВызовСервераПовтИсп.СформироватьНазваниеФайла(
			ПараметрКоманды, "Продажа") + ".xml");		
	КонецЕсли;
	Сообщить("Файл сохранен.");
	//Комлев АА 11/12/24 ---	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
#КонецОбласти