
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//ДатаОтчета =  ТекущаяДата();
	//ПараметрКомпоновки = Новый ПараметрКомпоновкиДанных("Автомобиль");
	//Авто = Отчет.КомпоновщикНастроек.Настройки.ПараметрыДанных.НайтиЗначениеПараметра(ПараметрКомпоновки);
	//Авто.Значение = Справочники.Машины.НайтиПоРеквизиту("КодМашины",Параметры.Автомобиль);
	//авто.Использование = Истина;
	//Авто2 = Отчет.КомпоновщикНастроек.Настройки.Отбор.ИдентификаторПользовательскойНастройки;
	//Если ЗначениеЗаполнено(Авто.ИдентификаторПользовательскойНастройки) Тогда
	//	
	//	ПользовательскийПараметр = Отчет.КомпоновщикНастроек.ПользовательскиеНастройки.Элементы.Найти(
	//	Авто.ИдентификаторПользовательскойНастройки);
	//	Если ТипЗнч(ПользовательскийПараметр) = Тип("ЗначениеПараметраНастроекКомпоновкиДанных") Тогда
	//		ПользовательскийПараметр.Значение = Авто.Значение;
	//	КонецЕсли;
	//КонецЕсли;
	
КонецПроцедуры
