
&НаСервере 
Процедура ОбновитьВремяРешенияПроблемыГарантийногоСлучая() Экспорт

	///ГомзМА 10.07.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФиксацияГарантийногоСлучая.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ФиксацияГарантийногоСлучая КАК ФиксацияГарантийногоСлучая
		|ГДЕ
		|	ФиксацияГарантийногоСлучая.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыГарантийногоСлучая.ВРаботе)";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Пока РезультатЗапроса.Следующий() Цикл
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВремяРешенияПроблемы = (НачалоДня(ТекущаяДата()) - НачалоДня(ДокОбъект.ДатаОбращенияКлиента)) / 86400 + 1;
		ДокОбъект.Записать();
	КонецЦикла;
	///-ГомзМА 10.07.2023
	

КонецПроцедуры
