
Процедура ОбновитьВремяРешенияПроблемыГарантийногоСлучая() Экспорт

	///ГомзМА 10.07.2023
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ФиксацияГарантийногоСлучая.Ссылка КАК Ссылка
		|ИЗ
		|	Документ.ФиксацияГарантийногоСлучая КАК ФиксацияГарантийногоСлучая
		|ГДЕ
		|	ФиксацияГарантийногоСлучая.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыГарантийногоСлучая.ВРаботе)";
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();

	Пока РезультатЗапроса.Следующий() Цикл
		ДокОбъект = РезультатЗапроса.Ссылка.ПолучитьОбъект();
		ДокОбъект.ВремяРешенияПроблемы = (НачалоДня(ТекущаяДата()) - НачалоДня(ДокОбъект.ДатаОбращенияКлиента)) / 86400 + 1;
		ДокОбъект.Записать();
	КонецЦикла;
	///-ГомзМА 10.07.2023
	

КонецПроцедуры

Функция ПолучитьРазницуДат(ДатаНачало, ДатаКонец) Экспорт
	
	///+ТатарМА 30.09.2024
	// Рассчитаем разницу между датами
	РазницаЛет = Год(ДатаКонец) - Год(ДатаНачало);
	РазницаМесяцев = Месяц(ДатаКонец) - Месяц(ДатаНачало);
	РазницаДней = День(ДатаКонец) - День(ДатаНачало);

	// Если дни отрицательные, компенсируем за счет месяцев
	Если РазницаДней < 0 Тогда
		РазницаМесяцев = РазницаМесяцев - 1;
		ДатаПредыдущегоМесяца = ДобавитьМесяц(ДатаКонец, -1);
		КоличествоДнейВПредыдущемМесяце = День(КонецМесяца(ДатаПредыдущегоМесяца));
		РазницаДней = КоличествоДнейВПредыдущемМесяце + РазницаДней;
	КонецЕсли;

	// Если месяцы отрицательные, компенсируем за счет лет
	Если РазницаМесяцев < 0 Тогда
		РазницаЛет = РазницаЛет - 1;
		РазницаМесяцев = РазницаМесяцев + 12;
	КонецЕсли;

	// Если месяцы одинаковы (разница по месяцам = 0), считаем только дни
	Если РазницаЛет = 0 И РазницаМесяцев = 0 Тогда
		РазницаДней = День(ДатаКонец) - День(ДатаНачало);
		РазницаМесяцев = 0;
	КонецЕсли;

	// Формируем строку для переменной ПериодПоиска
	ПериодПоиска = "";

	// Добавляем в строку только ненулевые значения
	Если РазницаЛет > 0 Тогда
		ПериодПоиска = ПериодПоиска + Строка(РазницаЛет) + ?(РазницаЛет < 5, " г", " л");
	КонецЕсли;

	Если РазницаМесяцев > 0 Тогда
		Если ПериодПоиска <> "" Тогда
			ПериодПоиска = ПериодПоиска + ", ";
		КонецЕсли;
		ПериодПоиска = ПериодПоиска + Строка(РазницаМесяцев) + " мес";
	КонецЕсли;

	Если РазницаДней > 0 Тогда
		Если ПериодПоиска <> "" Тогда
			ПериодПоиска = ПериодПоиска + ", ";
		КонецЕсли;
		ПериодПоиска = ПериодПоиска + Строка(РазницаДней) + " дн";
	КонецЕсли;

	// Если ни один показатель не добавлен, выводим сообщение о нулевом периоде
	Если ПериодПоиска = "" Тогда
		ПериодПоиска = "0 дн";
	КонецЕсли;
	
	Возврат ПериодПоиска;
	///-ТатарМА 30.09.2024
	
КонецФункции