
&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ГомзМА 19.10.2023
	ТекДанные = Элементы.Список.ТекущиеДанные;
	Если ТекДанные <> Неопределено Тогда
		Если Поле = Элементы.Покупатель Тогда
			СсылкаДляОткрытия = ТекДанные.Покупатель;
			ПараметрыФормы = Новый Структура("Ключ", СсылкаДляОткрытия);
			
			ФормаДокумента = ПолучитьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы);
			ФормаДокумента.Открыть();
		ИначеЕсли Поле = Элементы.Рекомендатель Тогда
			СсылкаДляОткрытия = ТекДанные.Рекомендатель;
			ПараметрыФормы = Новый Структура("Ключ", СсылкаДляОткрытия);
			
			ФормаДокумента = ПолучитьФорму("Справочник.Клиенты.ФормаОбъекта", ПараметрыФормы);
			ФормаДокумента.Открыть();
		КонецЕсли;
	КонецЕсли;
	///+ГомзМА 19.10.2023
	
КонецПроцедуры

