
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПодвал();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПодвал()
	
	Схема = Элементы.АналитикаЦен.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.АналитикаЦен.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаЦенНачисления.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	ЭтотОбъект.ЭтаФорма.Элементы.АналитикаЦенНачисления.ТекстПодвала =  Формат(Результат.Итог("Начисления"),"ЧДЦ=2; ЧН=-;");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьПодвал(Команда)
	
	ЗаполнитьПодвал();
	
КонецПроцедуры

