#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

	ОбновитьДобавленныеКолонки(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	ОбновитьДобавленныеКолонки(ЭтаФорма);
	
КонецПроцедуры



#КонецОбласти








#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПериодНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка  = ложь;
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Значение", Объект.Период);
	ПараметрыОткрытия.Вставить("РежимВыбораПериода", "Месяц");
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПериодНачалоВыбораНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", , ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПериодНачалоВыбораНачалоВыбораЗавершение(РезультатЗакрытия, ДополнительныеПараметры) Экспорт
	
	Если РезультатЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ВыбранноеЗначение =  РезультатЗакрытия;
	Если Объект.Период <> ВыбранноеЗначение Тогда
		Объект.Период = ВыбранноеЗначение;
	КонецЕсли;
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_Сотрудники


&НаКлиенте
Процедура СотрудникиПриНачалеРедактирования(Элемент, НоваяСтрока, Копирование)
	
	Если НоваяСтрока И Не Копирование Тогда
		
		Элементы.Сотрудники.ТекущиеДанные.Дата = МаксимальнаяДата();
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	Если Элементы.Сотрудники.ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Элементы.Сотрудники.ТекущиеДанные.ИзмененоВручную = Истина;
	ОбновитьДобавленныеКолонкиСтроки(Элементы.Сотрудники.ТекущиеДанные);
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыОткрытия = Новый Структура();
	ПараметрыОткрытия.Вставить("Значение", Объект.Период);
	ПараметрыОткрытия.Вставить("РежимВыбораПериода", "Месяц");
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ПериодНачалоВыбораНачалоВыбораЗавершение", ЭтотОбъект);
	
	ОткрытьФорму("ОбщаяФорма.ВыборПериода", , ЭтаФорма, ЭтаФорма.УникальныйИдентификатор,,,ОповещениеОЗакрытии, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры


// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДобавленныеКолонки(Форма)
	
	Объект = Форма.Объект;
	
	Для каждого СтрокаТаблицы Из Объект.Сотрудники Цикл
		ОбновитьДобавленныеКолонкиСтроки(СтрокаТаблицы);
	КонецЦикла;

КонецПроцедуры




&НаКлиентеНаСервереБезКонтекста
Процедура ОбновитьДобавленныеКолонкиСтроки(СтрокаТаблицы)
	СтрокаТаблицы.ИзмененоВручнуюИндекс = ?(СтрокаТаблицы.ИзмененоВручную, 0, 1);	
КонецПроцедуры

&НаКлиенте
Функция МаксимальнаяДата()
	
	Результат = Объект.Период;

	Для каждого СтрокаТаблицы Из Объект.Сотрудники Цикл
	
		Результат = Макс(Результат, СтрокаТаблицы.Дата);
	
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции // МаксимальнаяДата()




#КонецОбласти