
&НаКлиенте
Процедура ТМЦНаименованиеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыФормы = Новый Структура("РежимВыбора",Истина);
	ОткрытьФорму("Справочник.ТМЦВорктрак.Форма.ФормаВыбораДополнительная",ПараметрыФормы, ЭтаФорма,, ЭтаФорма.Окно); 
	

КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Объект.ссылка) тогда 
			СписокПоступлениеДС.Параметры.УстановитьЗначениеПараметра("СсылкаСделка",Объект.Ссылка);
			Объект.СуммаДокументаАренда = ПодсчетСуммыСписокПоступлениеДС();  
//	Иначе 	СписокПоступлениеДС.Параметры.УстановитьЗначениеПараметра("СсылкаСделка",Неопределено); 
	КонецЕсли;
	
	Если Объект.ТМЦ.Количество()<>0 Тогда 
		Элементы.СуммаПродажиТМЦ.Видимость = Истина; 
	Иначе 
		Элементы.СуммаПродажиТМЦ.Видимость = ложь; 
	КонецЕсли; 

	СкрытьИлиПоказатьСумму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("СправочникСсылка.ТМЦВорктрак") Тогда
	
		ИмяТабличнойЧасти = "ТМЦ";	
		Элементы[ИмяТабличнойЧасти].ТекущиеДанные.Наименование = ВыбранноеЗначение;
	
	КонецЕСли; 


КонецПроцедуры




&Насервере
Процедура СкрытьИлиПоказатьСумму()
	Если Объект.ВидДохода = Перечисления.ВидыПрочихДоходов.АрендаИмущества ИЛИ  Объект.ВидДохода = Перечисления.ВидыПрочихДоходов.АрендаТМЦ Тогда 
		элементы.СуммаПродажиТМЦ.Видимость 		= Ложь; 
		Элементы.СуммаДокументаАренда.видимость = Истина;
		Элементы.СуммаПлатежа.Видимость 		= Истина; 
		Элементы.ТМЦИмущество.Видимость 		= Истина;
		Элементы.Клиент.Видимость 				= Истина;
		Элементы.СотрудникКлиент.Видимость 		= Ложь; 
		Элементы.Сделка.Видимость 				= Ложь; 
		Элементы.ДатаНачалаДоговора.Видимость 	= ложь; 
		Элементы.ДатаОкончанияДоговора.Видимость = ложь;
		Элементы.ПериодПлатежа.Видимость 		= ложь; 
		Элементы.ТипОплаты.Видимость			= Ложь;  
	иначеЕсли Объект.ВидДохода = Перечисления.ВидыПрочихДоходов.ВнутренняяПродажа Тогда
		элементы.СуммаПродажиТМЦ.Видимость 		= Истина;  
		Элементы.СуммаДокументаАренда.видимость = Ложь; 
		Элементы.СуммаПлатежа.Видимость 		= Ложь; 
		Элементы.ТМЦИмущество.Видимость 		= ложь;
		Элементы.Клиент.Видимость 				= Ложь;
		Элементы.СотрудникКлиент.Видимость 		= Истина; 
		Элементы.Сделка.Видимость 				= Ложь;
		Элементы.ДатаНачалаДоговора.Видимость 	= ложь; 
		Элементы.ДатаОкончанияДоговора.Видимость = ложь;
		Элементы.ПериодПлатежа.Видимость 		= ложь; 
		Элементы.ТипОплаты.Видимость			= Истина; 
	КонецЕсли;
	
	Если Объект.ВидДохода = Перечисления.ВидыПрочихДоходов.ВозвратОтПоставщика Тогда
		элементы.СуммаПродажиТМЦ.Видимость 		= Ложь; 
		Элементы.СуммаДокументаАренда.видимость = Ложь;
		Элементы.СуммаПлатежа.Видимость 		= Истина; 
		Элементы.ТМЦИмущество.Видимость 		= Ложь;
		Элементы.Клиент.Видимость 				= Истина;
		Элементы.СотрудникКлиент.Видимость 		= Ложь;  
		Элементы.Сделка.Видимость 				= Истина;
		Элементы.ТипОплаты.Видимость			= ложь;  
	КонецЕсли;
	
	
КонецПроцедуры

&НаКлиенте
Процедура ТипОплатыПриИзменении(Элемент)
	
	
	Если ТипОплатыПриИзмененииНаСервере() Тогда 
		Элементы.Счет.Видимость = Ложь; 
	Иначе 
		Элементы.Счет.Видимость = истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ТипОплатыПриИзмененииНаСервере()
	
	Если объект.ТипОплаты = Перечисления.ТипОплатыПрочиеДоходы.ИзЗарплаты Тогда 
		Возврат Истина; 
	Иначе 
		Возврат Ложь; 
	КонецЕсли;
	
КонецФункции 


&НаКлиенте
Процедура ТМЦСтоимостьПриИзменении(Элемент)
	РассчётСуммыТМЦ();
КонецПроцедуры

&НаКлиенте
Процедура ТМЦКоличествоПриИзменении(Элемент)
	РассчётСуммыТМЦ();
КонецПроцедуры

&НаКлиенте
Процедура РассчётСуммыТМЦ()
	СтрокаТабличнойЧасти = Элементы.ТМЦ.ТекущиеДанные;
	СтрокаТабличнойЧасти.Сумма = СтрокаТабличнойЧасти.Количество * СтрокаТабличнойЧасти.Стоимость;
КонецПроцедуры


&НаКлиенте
Процедура ТМЦПриАктивизацииСтроки(Элемент)
	Если Объект.ТМЦ.Количество()<>0 Тогда 
		ТекДанные = Элементы.ТМЦ.ТекущиеДанные; 
		СписокИндНомер.Параметры.УстановитьЗначениеПараметра("Владелец",ТекДанные.Наименование);	
		Иначе
		СписокИндНомер.Параметры.УстановитьЗначениеПараметра("Владелец", Неопределено);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидДоходаПриИзменении(Элемент)
	СкрытьИлиПоказатьСумму(); 
КонецПроцедуры



&НаКлиенте
Процедура ТМЦИнвентарныйНомерПриИзменении(Элемент)
ТекДанные = Элементы.ТМЦ.ТекущиеДанные; 
Структура = ТМЦИнвентарныйНомерПриИзмененииНаСервере(ТекДанные.ИнвентарныйНомер);
ТекДанные.Стоимость = Структура.Стоимость; 
ТекДанные.Код = Структура.Код;  
КонецПроцедуры



&НаСервере
Функция ТМЦИнвентарныйНомерПриИзмененииНаСервере(Наименование)
Запрос = Новый Запрос;
Запрос.Текст =
	"ВЫБРАТЬ
	|	ИнвентарныеНомера.Стоимость,
	|	ИнвентарныеНомера.Код
	|ИЗ
	|	Справочник.ИнвентарныеНомера КАК ИнвентарныеНомера
	|ГДЕ
	|	ИнвентарныеНомера.Наименование = &Наименование";

Запрос.УстановитьПараметр("Наименование", Наименование);

РезультатЗапроса = Запрос.Выполнить();

ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
Структура = Новый Структура; 
Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	Структура.Вставить("Стоимость",ВыборкаДетальныеЗаписи.Стоимость );
	Структура.Вставить("Код",ВыборкаДетальныеЗаписи.Код );
КонецЦикла;
Возврат Структура; 
КонецФункции
&НаКлиенте

Процедура ТМЦПриИзменении(Элемент)
	Элементы.СуммаПродажиТМЦ.Видимость = Ложь; 
	Если Объект.ТМЦ.Количество()>0 Тогда 
		Элементы.СуммаПродажиТМЦ.Видимость = Истина; 
		Объект.СуммаПродажиТМЦ = 0; 
		Для каждого Строка Из Объект.ТМЦ Цикл 
			Объект.СуммаПродажиТМЦ = Объект.СуммаПродажиТМЦ + Строка.Сумма;
		КонецЦикла; 
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТМЦНаименованиеПриИзменении(Элемент)
		Если Объект.ТМЦ.Количество()>0 Тогда 
		ТекДанные = Элементы.ТМЦ.ТекущиеДанные; 
		СписокИндНомер.Параметры.УстановитьЗначениеПараметра("Владелец",ТекДанные.Наименование);
		Иначе
		СписокИндНомер.Параметры.УстановитьЗначениеПараметра("Владелец", Неопределено);	
	КонецЕсли;
КонецПроцедуры
// Подсчет суммы динамического списка с пиходоми денег на счет 
Функция ПодсчетСуммыСписокПоступлениеДС() 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ПриходДенегНаСчет.СуммаДокумента КАК СуммаДокумента
		|ИЗ
		|	Документ.ПриходДенегНаСчет КАК ПриходДенегНаСчет
		|ГДЕ
		|	ПриходДенегНаСчет.Сделка = &СсылкаСделка";
	
	Запрос.УстановитьПараметр("СсылкаСделка", Объект.Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	Сумма = 0; 
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Сумма= Сумма +  ВыборкаДетальныеЗаписи.СуммаДокумента; 
	КонецЦикла;
	
	Возврат Сумма;
КонецФункции


Процедура УдалитьНепроверяемыеРеквизитыИзМассива(МассивРеквизитов, МассивНепроверяемыхРеквизитов) Экспорт

  Для Каждого ЭлементМассива Из МассивНепроверяемыхРеквизитов Цикл
 
    ПорядковыйНомер = МассивРеквизитов.Найти(ЭлементМассива);
    Если ПорядковыйНомер <> Неопределено Тогда
      МассивРеквизитов.Удалить(ПорядковыйНомер);
    КонецЕсли;
 
  КонецЦикла;
 
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	  НепроверяемыеРеквизиты = Новый Массив();

  // Проверка значения реквизита на соответствие некоторым требованиям
  Если НЕ ЗначениеЗаполнено(Объект.ТипОплаты) Тогда
    Сообщение = Новый СообщениеПользователю();
    Сообщение.Текст = НСтр("ru = 'Тип оплаты не задан.'");
    Сообщение.Сообщить();
    Отказ = Истина; 
    НепроверяемыеРеквизиты.Добавить("ТипОплаты"); 
  КонецЕсли;
  
  УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, НепроверяемыеРеквизиты);
КонецПроцедуры



