
#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ОстаткиБалансИзменение" Тогда
		Элементы.Список.Обновить();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Если Пользователи.РолиДоступны("КассаМосква") И НЕ Пользователи.РолиДоступны("ПолныеПрава") тогда
	//	Список.Параметры.УстановитьЗначениеПараметра("Подразделение",Справочники.Подразделения.НайтиПоКоду("000000029"));
	//КонецЕсли;
	
		// ++МазинЕС 10-07-2024 
	
		
	Пользователь =ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	СсылкаПодьзователь = Справочники.Сотрудники.НайтиПоНаименованию(Пользователь); 
		Если СсылкаПодьзователь.Код ="000000006" Тогда 
		ТекстЗапроса =  "ВЫБРАТЬ
	|СправочникСчета.Ссылка КАК Ссылка,
	|СправочникСчета.ПометкаУдаления КАК ПометкаУдаления,
	|СправочникСчета.Код КАК Код,
	|СправочникСчета.Наименование КАК Наименование,
	|СправочникСчета.Комментарий КАК Комментарий,
	|СправочникСчета.Валюта КАК Валюта,
	|СправочникСчета.Подразделение КАК Подразделение,
	|БалансОстатки.БалансОстаток КАК СуммаОстаток,
	|СправочникСчета.ОтражатьВБУ КАК ОтражатьВБУ,
	|СправочникСчета.Владелец КАК Владелец,
	|СправочникСчета.ОтветственныйПоСчету
	|{ГДЕ
	|	
	|	 (СправочникСчета.Владелец = &Владелец)}
	|ИЗ
	|	Справочник.Счета КАК СправочникСчета
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Баланс.Остатки КАК БалансОстатки
	|		ПО (БалансОстатки.Измерение1 = СправочникСчета.Ссылка)"; 
		Список.ТекстЗапроса = ТекстЗапроса;
		Список.Параметры.УстановитьЗначениеПараметра("Владелец",Справочники.Организация.НайтиПоКоду("000000014"));
		КонецЕсли; 
// --МазинЕС 10-07-2024
	
	///+ГомзМА 05.02.2024
	Если Пользователи.ТекущийПользователь().Подразделение = Справочники.Подразделения.НайтиПоКоду("000000060") И НЕ Пользователи.РолиДоступны("ПолныеПрава") Тогда //Филиал Екатеринбург - Действующий
		Список.Параметры.УстановитьЗначениеПараметра("Подразделение",Справочники.Подразделения.НайтиПоКоду("000000060")); //Филиал Екатеринбург - Действующий
	ИначеЕсли Пользователи.ТекущийПользователь().Подразделение = Справочники.Подразделения.НайтиПоКоду("000000029") И НЕ Пользователи.РолиДоступны("ПолныеПрава") И НЕ СсылкаПодьзователь.Код ="000000006"   Тогда //Филиал Москва - Действующий
		Список.Параметры.УстановитьЗначениеПараметра("Подразделение",Справочники.Подразделения.НайтиПоКоду("000000029")); //Филиал Москва - Действующий
	КонецЕсли;
	///-ГомзМА 05.02.2024
	
 	

КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы



#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти