//
//  https://nov-soft.ru
//

#Область ПрограммныйИнтерфейс

Процедура УдалитьЭлемент(Ссылка, Отказ = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(Ссылка) Тогда
		Возврат
	КонецЕсли;
	
	НачатьТранзакцию(РежимУправленияБлокировкойДанных.Управляемый);
	Попытка
	
		СпрОбъект = Ссылка.ПолучитьОбъект();
		ЗаблокироватьДанныеДляРедактирования(Ссылка);
	    СпрОбъект.ПометкаУдаления = Истина;
		СпрОбъект.Записать();
		
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Не удалось пометить на удаление %1. %2",
				СпрОбъект,
				ОписаниеОшибки()),
			,
			,
			,
			Отказ
		);
			
	КонецПопытки;

	Если Не Отказ Тогда
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти