#Область ПрограммныйИнтерфейс

Функция ПараметрыЗаполненияВременнойТаблицыТоваров() Экспорт
	
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ПересчитыватьВВалютуРегл", Ложь);
	СтруктураПараметров.Вставить("ВключаяНомераГТД", Ложь);
	СтруктураПараметров.Вставить("ВключаяДоКорректировки", Ложь);
	СтруктураПараметров.Вставить("АктуализироватьРасчеты", Истина);
	СтруктураПараметров.Вставить("ВключатьУслуги", Истина);
	СтруктураПараметров.Вставить("ВключатьТоварыНаКомиссии", Истина);
	
	Возврат СтруктураПараметров;
	
КонецФункции


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти