
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьПодвалПроданныеДетали();
	
КонецПроцедуры 

&НаКлиенте
Процедура ПроданныеДеталиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ТатарМА 19.09.2024
	ТекСтрока = Элементы.ПроданныеДетали.ТекущиеДанные;
	Если Поле = Элементы.ПроданныеДеталиЗаказНарядНаВосстановление Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.ЗаказНарядНаВосстановление;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Документ.Рас_Комплектовка.Форма.ФормаДокумента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	ИначеЕсли Поле = Элементы.ПроданныеДеталиПродажа Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Продажа;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		 = ПолучитьФорму("Документ.ПродажаЗапчастей.Форма.ФормаДокумента", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///-ТатарМА 19.09.2024

КонецПроцедуры

&НаКлиенте
Процедура ПериодПродажиПриИзменении(Элемент)
	ПериодПродажиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПериодПродажиПриИзмененииНаСервере()
	
	///+ТатарМА 19.09.2024
	Если ПериодПродажи.ДатаНачала = '00010101' Тогда
		ПроданныеДетали.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 	'00010101');
		ПроданныеДетали.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", 	'25001231');
	Иначе
		ПроданныеДетали.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 	ПериодПродажи.ДатаНачала);
		ПроданныеДетали.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", 	ПериодПродажи.ДатаОкончания);
	КонецЕсли;
	
	ЗаполнитьПодвалПроданныеДетали();
	///-ТатарМА 19.09.1024
	
КонецПроцедуры



&НаКлиенте
Процедура СписокПриАктивизацииСтроки1(Элемент)

КонецПроцедуры





&НаКлиенте
Процедура РаботыПоПроданнымДеталямВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	///+ГомзМА 15.08.2023
	ТекСтрока = Элементы.РаботыПоПроданнымДеталям.ТекущиеДанные;
	Если Поле = Элементы.РаботыПоПроданнымДеталямДокумент Тогда
		
		СсылкаДляОткрытия    = ТекСтрока.Документ;
		ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
		
		ФормаДокумента 		= ПолучитьФорму("Документ.Рас_Комплектовка.ФормаОбъекта", ПараметрыФормы);
		ФормаДокумента.Открыть();
	КонецЕсли;
	///+ГомзМА 15.08.2023
	
КонецПроцедуры

Процедура ЗаполнитьПодвалПроданныеДетали()
	
	///+ТатарМА 19.09.2024
	Схема = Элементы.ПроданныеДетали.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.ПроданныеДетали.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.ПроданныеДеталиРекомендованаяЦена.ГоризонтальноеПоложениеВПодвале 	= ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.ПроданныеДеталиСуммаПродажи.ГоризонтальноеПоложениеВПодвале      	= ГоризонтальноеПоложениеЭлемента.Право;
	
	ЭтотОбъект.ЭтаФорма.Элементы.ПроданныеДеталиРекомендованаяЦена.ТекстПодвала = Формат(Результат.Итог("РекомендованаяЦена"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.ПроданныеДеталиСуммаПродажи.ТекстПодвала      	= Формат(Результат.Итог("СуммаПродажи"),"ЧДЦ=0; ЧН=-"); 
	///-ТатарМА 19.09.2024
	
КонецПроцедуры