
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	///+ГомзМА 06.10.2023
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", 		'20231001');
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", 	ТекущаяДатаСеанса());
	
	ЗаполнитьПодвал();
	УстановитьВидимостьИДоступностьЭлементов();
	///+ГомзМА 06.10.2023
	
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьПодвал()

	///+ГомзМА 06.10.2023
	Если НЕ ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("РедактированиеДоставкиВПродаже")) Тогда
		Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
		Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
		КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
		МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
		ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
		ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
		ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
		Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
		
		ЭтотОбъект.ЭтаФорма.Элементы.СуммаДокумента.ГоризонтальноеПоложениеВПодвале 	= ГоризонтальноеПоложениеЭлемента.Право;
		ЭтотОбъект.ЭтаФорма.Элементы.Оплачено.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
		ЭтотОбъект.ЭтаФорма.Элементы.Начислено.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
		ЭтотОбъект.ЭтаФорма.Элементы.Выдано.ГоризонтальноеПоложениеВПодвале 			= ГоризонтальноеПоложениеЭлемента.Право;
		ЭтотОбъект.ЭтаФорма.Элементы.СуммаБезНДС.ГоризонтальноеПоложениеВПодвале 		= ГоризонтальноеПоложениеЭлемента.Право;
		ЭтотОбъект.ЭтаФорма.Элементы.НДС.ГоризонтальноеПоложениеВПодвале 				= ГоризонтальноеПоложениеЭлемента.Право;
		
		ЭтотОбъект.ЭтаФорма.Элементы.СуммаДокумента.ТекстПодвала 	= Формат(Результат.Итог("СуммаДокумента"),"ЧДЦ=0; ЧН=-");
		ЭтотОбъект.ЭтаФорма.Элементы.Оплачено.ТекстПодвала 			= Формат(Результат.Итог("Оплачено"),"ЧДЦ=0; ЧН=-");
		ЭтотОбъект.ЭтаФорма.Элементы.Начислено.ТекстПодвала 		= Формат(Результат.Итог("Начислено"),"ЧДЦ=0; ЧН=-");
		ЭтотОбъект.ЭтаФорма.Элементы.Выдано.ТекстПодвала 			= Формат(Результат.Итог("Выдано"),"ЧДЦ=0; ЧН=-");
		ЭтотОбъект.ЭтаФорма.Элементы.СуммаБезНДС.ТекстПодвала 		= Формат(Результат.Итог("СуммаБезНДС"),"ЧДЦ=0; ЧН=-");
		ЭтотОбъект.ЭтаФорма.Элементы.НДС.ТекстПодвала 				= Формат(Результат.Итог("НДС"),"ЧДЦ=0; ЧН=-");
	КонецЕсли;
	///-ГомзМА 06.10.2023

КонецПроцедуры


&НаСервере
Процедура УстановитьВидимостьИДоступностьЭлементов()

	///+ГомзМА 06.10.2023
	Если ПользователиИнформационнойБазы.ТекущийПользователь().Роли.Содержит(Метаданные.Роли.Найти("РедактированиеДоставкиВПродаже")) Тогда
		Элементы.СуммаДокумента.Видимость 	= Ложь;
		Элементы.Оплачено.Видимость 		= Ложь;
		Элементы.Начислено.Видимость 		= Ложь;
		Элементы.СуммаБезНДС.Видимость 		= Ложь;
		Элементы.НДС.Видимость 				= Ложь;
	КонецЕсли;
	///-ГомзМА 06.10.2023
	

КонецПроцедуры

&НаКлиенте
Процедура Обновить(Команда)
	
	///+ГомзМА 11.10.2023
	ЗаполнитьПодвал();
	///-ГомзМА 11.10.2023
	
КонецПроцедуры
