#Область ОбработчикиСобытийФормы
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СписокУчетТовараПоКладовщикам.Параметры.УстановитьЗначениеПараметра("Дата", ДатаОтчета);
	РассчитатьИтогиСписокУчетТовараПоКладовщикам();
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДатаОтчетаПриИзменении(Элемент)
	СписокУчетТовараПоКладовщикам.Параметры.УстановитьЗначениеПараметра("Дата", ДатаОтчета);
	РассчитатьИтогиСписокУчетТовараПоКладовщикам();
КонецПроцедуры
#КонецОбласти

&НаСервере
Процедура РассчитатьИтогиСписокУчетТовараПоКладовщикам() 
	// Комлев АА 08/11/24 +++
	СКД = Элементы.СписокУчетТовараПоКладовщикам.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	НастройкиКД = Элементы.СписокУчетТовараПоКладовщикам.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикКД = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКД = КомпоновщикКД.Выполнить(СКД, НастройкиКД, , , Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКД = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКД.Инициализировать(МакетКД);
	ПроцессорВыводаКД = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	РезультатКД_ТЗ = ПроцессорВыводаКД.Вывести(ПроцессорКД);

	Элементы.СписокУчетТовараПоКладовщикамКоличествоДень.ТекстПодвала =  "" + РезультатКД_ТЗ.Итог("КоличествоДень")
		+ " шт.";
	Элементы.СписокУчетТовараПоКладовщикамКоличествоДень.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	Элементы.СписокУчетТовараПоКладовщикамКоличествоНеделя.ТекстПодвала =  "" + РезультатКД_ТЗ.Итог("КоличествоНеделя")
		+ " шт.";
	Элементы.СписокУчетТовараПоКладовщикамКоличествоНеделя.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	Элементы.СписокУчетТовараПоКладовщикамКоличествоМесяц.ТекстПодвала =   "" + РезультатКД_ТЗ.Итог("КоличествоМесяц")
		+ " шт.";
	Элементы.СписокУчетТовараПоКладовщикамКоличествоМесяц.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	Элементы.СписокУчетТовараПоКладовщикамКоличествоКвартал.ТекстПодвала =   "" + РезультатКД_ТЗ.Итог(
		"КоличествоКвартал") + " шт.";
	Элементы.СписокУчетТовараПоКладовщикамКоличествоКвартал.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	

	Элементы.СписокУчетТовараПоКладовщикамСуммаДень.ТекстПодвала =  "" + РезультатКД_ТЗ.Итог("СуммаДень") + " руб.";
	Элементы.СписокУчетТовараПоКладовщикамСуммаДень.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.СписокУчетТовараПоКладовщикамСуммаНеделя.ТекстПодвала =   "" + РезультатКД_ТЗ.Итог("СуммаНеделя") + " руб.";
	Элементы.СписокУчетТовараПоКладовщикамСуммаНеделя.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.СписокУчетТовараПоКладовщикамСуммаМесяц.ТекстПодвала =  "" + РезультатКД_ТЗ.Итог("СуммаМесяц") + " руб.";
	Элементы.СписокУчетТовараПоКладовщикамСуммаМесяц.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	Элементы.СписокУчетТовараПоКладовщикамСуммаКвартал.ТекстПодвала =   "" + РезультатКД_ТЗ.Итог("СуммаКвартал") + " руб.";
	Элементы.СписокУчетТовараПоКладовщикамСуммаКвартал.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;		
// Комлев АА 08/11/24 ---
КонецПроцедуры