&НаКлиенте
Процедура СписокОтделовПриАктивизацииСтроки(Элемент)
		Если Элементы.СписокОтделов.ТекущиеДанные <> Неопределено Тогда
		
			ТекДанные = Элементы.СписокОтделов.ТекущиеДанные; 
			Список3.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.Отдел);

		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список3.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	ЗаполнитьПодвалы();
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписки(Команда)
	ОбновитьСпискиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСпискиНаСервере()
	
	Элементы.Список3.Обновить();
	Элементы.СписокОтделов.Обновить();
	ЗаполнитьПодвалы();
	 
КонецПроцедуры


&НаКлиенте
Процедура СписокОтделовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
		СсылкаНаОбъект = Элементы.СписокОтделов.ТекущиеДанные.Отдел;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект); 
		ОткрытьФорму("Справочник.ВидыРасходов_3.ФормаОбъекта", ПараметрыФормы)	
		
	

КонецПроцедуры

&НаКлиенте
Процедура Список3Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СсылкаНаОбъект = Элементы.Список3.ТекущиеДанные.Влияние;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект); 
		ОткрытьФорму("Справочник.ВлиянияРасходы.Форма.ФормаЭлемента", ПараметрыФормы)	
КонецПроцедуры


Процедура ЗаполнитьПодвалы()
	ЗаполнитьПодвалСписокОтделов();
	ЗаполнитьПодвалСписок3();	
	ЗаполнитьПодвалСписок();
КонецПроцедуры

Процедура ЗаполнитьПодвалСписокОтделов()
	
	Схема = Элементы.СписокОтделов.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.СписокОтделов.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокОтделовПлан.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.СписокОтделовКоличество.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокОтделовПлан.ТекстПодвала =  Формат(Результат.Итог("План"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.СписокОтделовКоличество.ТекстПодвала =  Формат(Результат.Итог("Количество"),"ЧДЦ=0; ЧН=-");

КонецПроцедуры

Процедура ЗаполнитьПодвалСписок3()
	
	Схема = Элементы.Список3.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список3.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.Список3План.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	ЭтотОбъект.ЭтаФорма.Элементы.Список3План.ТекстПодвала =  Формат(Результат.Итог("План"),"ЧДЦ=0; ЧН=-");

КонецПроцедуры

Процедура ЗаполнитьПодвалСписок()
	
	Схема = Элементы.Список.ПолучитьИсполняемуюСхемуКомпоновкиДанных();
	Настройки = Элементы.Список.ПолучитьИсполняемыеНастройкиКомпоновкиДанных();
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(Схема, Настройки,,,Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	Результат = ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокПлан.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	ЭтотОбъект.ЭтаФорма.Элементы.КолОтделов.ГоризонтальноеПоложениеВПодвале = ГоризонтальноеПоложениеЭлемента.Право;
	
	
	ЭтотОбъект.ЭтаФорма.Элементы.СписокПлан.ТекстПодвала =  Формат(Результат.Итог("План"),"ЧДЦ=0; ЧН=-");
	ЭтотОбъект.ЭтаФорма.Элементы.КолОтделов.ТекстПодвала =  Формат(Результат.Итог("КолОтделов"),"ЧДЦ=0; ЧН=-");

КонецПроцедуры
