&НаКлиенте
Процедура СписокПриАктивизацииСтроки1(Элемент)
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		
		ТекДанные = Элементы.Список.ТекущиеДанные; 
		Список3.Параметры.УстановитьЗначениеПараметра("Влияние",ТекДанные.Наиенование );

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Список3Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)

		СсылкаНаОбъект = Элементы.Список3.ТекущиеДанные.Отдел;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект); 
		ОткрытьФорму("Справочник.ВидыРасходов_3.ФормаОбъекта", ПараметрыФормы)	

КонецПроцедуры
