

&НаКлиенте
Процедура СписокОтделовПриАктивизацииСтроки(Элемент)
	Если Элементы.СписокОтделов.ТекущиеДанные <> Неопределено Тогда
		
			ТекДанные = Элементы.СписокОтделов.ТекущиеДанные; 
			Список3.Параметры.УстановитьЗначениеПараметра("Ссылка",ТекДанные.Отдел);

		КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	Список3.Параметры.УстановитьЗначениеПараметра("Ссылка",Неопределено);
	
КонецПроцедуры

&НаКлиенте
Процедура СписокОтделовВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
		СсылкаНаОбъект = Элементы.СписокОтделов.ТекущиеДанные.Отдел;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект); 
		ОткрытьФорму("Справочник.ВидыРасходов_3.ФормаОбъекта", ПараметрыФормы)	
	

КонецПроцедуры

&НаКлиенте
Процедура Список3Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
		СсылкаНаОбъект = Элементы.Список3.ТекущиеДанные.Влияние;
		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект); 
		ОткрытьФорму("Справочник.ВлиянияРасходы.Форма.ФормаЭлемента", ПараметрыФормы)	
КонецПроцедуры

//&НаКлиенте
//Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
//		
//		СсылкаНаОбъект = Элементы.Список.ТекущиеДанные.Наиенование;
//		ПараметрыФормы = Новый Структура("Ключ", СсылкаНаОбъект); 
//		ОткрытьФорму("Справочник.ВлиянияРасходы.Форма.ФормаЭлемента", ПараметрыФормы)	
//		
//КонецПроцедуры


