
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	ВидОперации =ПредопределенноеЗначение("Перечисление.ВидыОперацийЗаявокНаСборку.СборкаСоСклада"); 
	ПараметрыФормы = Новый Структура("Отбор", Новый Структура("ВидОперации", ВидОперации));
	ПараметрыФормы.Вставить("Заголовок", "Сборки со склада");
	ОткрытьФорму("Документ.ЗаявкаНаСборку.ФормаСписка", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ВидОперации, ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);

КонецПроцедуры