
#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РекомендованаяЦенаПриИзменении(Элемент)
	Объект.ДатаИзмененияЦены = ТекущаяДата();
КонецПроцедуры

#КонецОбласти


&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

	
	
	// Запишем цену
	ДанныеЗаписи = Новый Структура("Номенклатура,ТипЦен", ТекущийОбъект.Ссылка, ТипЦены);
	дт_Ценообразование.УстановитьЦену(ДанныеЗаписи, ТекущаяДата(), ТекущийОбъект.РекомендованаяЦена, Ложь, Ложь);
	
	ИмяПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().ПолноеИмя;
	Объект.КтоСоздал = дт_ОбщегоНазначенияВызовСервераПовтИсп.ПолучитьПользователяПоИмени(ИмяПользователя);
	
КонецПроцедуры

	