#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Дата", Объект.Дата);
	Параметры.Свойство("Сотрудник", Объект.Сотрудник);
	Параметры.Свойство("ЗапрещатьЗакрытиеБезДанных", ЗапрещатьЗакрытиеБезДанных);
	
	
	Если Не ЗначениеЗаполнено(Объект.Дата) Тогда
		Объект.Дата = ТекущаяДата();
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Объект.Сотрудник = дт_Сотрудники.СотрудникПоПользователю(Пользователи.ТекущийПользователь());
	КонецЕсли;
	
	ОбновитьПоказатели();
	
	
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	ОбновитьПоказатели();
КонецПроцедуры

&НаКлиенте
Процедура ДатаРегулирование(Элемент, Направление, СтандартнаяОбработка)
	//Объект.Дата = Объект.Дата + Направление * 86400;
	ОбновитьПоказатели();
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИзменения(Команда)
	Отказ = Ложь;
	ЗаписатьИзмененияНаСервере(Отказ);
	Если Не Отказ Тогда
		Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаписатьИзмененияНаСервере(Отказ = Ложь)
	
	Набор = РегистрыСведений.ЗначенияПоказателейСотрудников.СоздатьНаборЗаписей();
	Набор.Отбор.Сотрудник.Установить(Объект.Сотрудник, Истина);
	//Набор.Отбор.Период.Установить(Объект.Дата, Истина);
	
	Для каждого СтрокаПоказатель Из Объект.Показатели Цикл
		Запись = Набор.Добавить();
		Запись.Период = Объект.Дата;
		Запись.Сотрудник = Объект.Сотрудник;
		Запись.Показатель = СтрокаПоказатель.Показатель;
		Запись.Значение = СтрокаПоказатель.ЗначениеФакт; 
	КонецЦикла;
	
	Попытка
		Набор.Записать();
	Исключение
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
			СтрШаблон("Не удалось записать показатели. %1",
				ОписаниеОшибки()),
			,
			,
			,
			Отказ
		);
		
	КонецПопытки;
		

КонецПроцедуры




&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	Если ЗавершениеРаботы Тогда
		Возврат
	КонецЕсли;
	
	Если ЗапрещатьЗакрытиеБезДанных 
		И Не ПоказателиЗаполнены() Тогда
		СтандартнаяОбработка = Ложь;
		Отказ = Истина;
		ПоказатьПредупреждение(, "Заполните колнку Факт");
		Возврат	
	КонецЕсли;
	
	ЗаписатьИзмененияНаСервере();
	
КонецПроцедуры



&НаКлиенте
Процедура СотрудникПриИзменении(Элемент)
	ОбновитьПоказатели();
КонецПроцедуры




#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьПоказатели()
	
	Объект.Показатели.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	СотрудникиПоказатели.Ссылка КАК Сотрудник,
		|	СотрудникиПоказатели.Показатель
		|ПОМЕСТИТЬ втПоказатели
		|ИЗ
		|	Справочник.Сотрудники.Показатели КАК СотрудникиПоказатели
		|ГДЕ
		|	СотрудникиПоказатели.Ссылка = &Сотрудник
		|;
		|
		|
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	втПоказатели.Показатель КАК Показатель,
		|	ЗначенияПоказателейСотрудниковПланСрезПоследних.Значение КАК ЗначениеПлан,
		|	ЗначенияПоказателейСотрудников.Значение КАК ЗначениеФакт
		|ИЗ
		|	втПоказатели КАК втПоказатели
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейСотрудников КАК ЗначенияПоказателейСотрудников
		|		ПО втПоказатели.Показатель = ЗначенияПоказателейСотрудников.Показатель
		|		И втПоказатели.Сотрудник = ЗначенияПоказателейСотрудников.Сотрудник
		|		И ЗначенияПоказателейСотрудников.Период = &Дата
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияПоказателейСотрудниковПлан.СрезПоследних(&Дата, Сотрудник = &Сотрудник) КАК
		|			ЗначенияПоказателейСотрудниковПланСрезПоследних
		|		ПО ЗначенияПоказателейСотрудниковПланСрезПоследних.Показатель = втПоказатели.Показатель
		|УПОРЯДОЧИТЬ ПО
		|	Показатель
		|АВТОУПОРЯДОЧИВАНИЕ";
	
	Запрос.УстановитьПараметр("Сотрудник", Объект.Сотрудник);
	Запрос.УстановитьПараметр("Дата", Объект.Дата);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Объект.Показатели.Загрузить(РезультатЗапроса.Выгрузить());
	
КонецПроцедуры

Функция ПоказателиЗаполнены()
	
	Для каждого СтрокаПоказатели Из Объект.Показатели Цикл
		
		Если ЗначениеЗаполнено(СтрокаПоказатели.ЗначениеФакт) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
КонецФункции

#КонецОбласти




