&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
КонецПроцедуры

&НаКлиенте
Процедура ЗарплатаПриИзменении(Элемент)
	Если Объект.Зарплата Тогда
		Элементы.Работник.Видимость = ИСТИНА;
		Элементы.Год.Видимость = ИСТИНА;
		Элементы.Месяц.Видимость = ИСТИНА;
	Иначе
		Элементы.Работник.Видимость = ЛОЖЬ;
		Элементы.Год.Видимость = ЛОЖЬ;
		Элементы.Месяц.Видимость = ЛОЖЬ;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// Вставить содержимое обработчика.
	Если Объект.Зарплата Тогда
		Элементы.Работник.Видимость = ИСТИНА;
		Элементы.Год.Видимость = ИСТИНА;
		Элементы.Месяц.Видимость = ИСТИНА;
	Иначе
		Элементы.Работник.Видимость = ЛОЖЬ;
		Элементы.Год.Видимость = ЛОЖЬ;
		Элементы.Месяц.Видимость = ЛОЖЬ;
	КонецЕсли;
КонецПроцедуры

