
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -3)));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ТекущаяДатаСеанса());
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокументаУпрощенная");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	СсылкаДляОткрытия    = ТекСтрока.Ссылка;
	ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокументаУпрощенная", ПараметрыФормы);
КонецПроцедуры
