
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ФильтрЭтапСделки = 0;
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -3)));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", КонецДня(ТекущаяДатаСеанса()));
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФильтрЭтапСделкиПриИзменении(Элемент)
	ФильтрЭтапСделкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФильтрЭтапСделкиПриИзмененииНаСервере()
	Если ФильтрЭтапСделки = 1 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.НоваяЗаявка, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 2 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.ВРаботе, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 3 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Сборка, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 4 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Собрано, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 5 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Контроль, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 6 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Оформление, ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	ИначеЕсли ФильтрЭтапСделки = 7 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Оформлено, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 8 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Упаковка, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 9 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Упаковано, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 10 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Доставка, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 11 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Отправлено, ВидСравненияКомпоновкиДанных.Равно, Истина);
			
	ИначеЕсли ФильтрЭтапСделки = 12 Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
			Перечисления.ЭтапыПродажи.Завершено, ВидСравненияКомпоновкиДанных.Равно, Истина);
	
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ЭтапыПродажи");
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокументаУпрощенная");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	СсылкаДляОткрытия    = ТекСтрока.Ссылка;
	ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокументаУпрощенная", ПараметрыФормы);
КонецПроцедуры
