 &НаКлиенте
Перем Кэш;
#Область ОбработчикиСобытийФормы

// При создании на сервере.
// 
// Параметры:
//  Отказ - Булево - Отказ
//  СтандартнаяОбработка - Булево - Стандартная обработка
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ФильтрЭтапСделки = 0;
	Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -3)));
	Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДобавитьМесяц(ТекущаяДатаСеанса(), 1 ));
	
	
//	СписокАкция.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)));
//	СписокАкция.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДобавитьМесяц(ТекущаяДатаСеанса(), 1 ));
	
	СписокАкция.Параметры.УстановитьЗначениеПараметра("ДатаНачала", Дата(1,1,1,0,0,0));
	СписокАкция.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", Дата(1,1,1,0,0,0));
	
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСоздать.Видимость = ЛОЖЬ;
	Элементы.ФормаКоманднаяПанель.ПодчиненныеЭлементы.ФормаСкопировать.Видимость = ЛОЖЬ;
	
КонецПроцедуры

&НаСервере
Функция ОбновитьДинСписок()
	
	Если НЕ ФильтрЭтапСделки = 1010 Тогда
		Элементы.Список.Видимость 		= Истина; 
		Элементы.СписокАкция.Видимость 	= Ложь; 
		Список.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -3)));
		Список.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДобавитьМесяц(ТекущаяДатаСеанса(), 1 ));
		
	Иначе
		Элементы.Список.Видимость 		= Ложь; 
		Элементы.СписокАкция.Видимость 	= Истина; 
		СписокАкция.Параметры.УстановитьЗначениеПараметра("ДатаНачала", НачалоДня(ДобавитьМесяц(ТекущаяДатаСеанса(), -1)) - 100500);
		СписокАкция.Параметры.УстановитьЗначениеПараметра("ДатаОкончания", ДобавитьМесяц(ТекущаяДатаСеанса(), 1 ) + 100500);
	КонецЕсли;
КонецФункции
#КонецОбласти


#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ФильтрЭтапСделкиПриИзменении(Элемент)
	ФильтрЭтапСделкиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ФильтрЭтапСделкиПриИзмененииНаСервере()
	Если ФильтрЭтапСделки = 1 Тогда
		
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.НоваяЗаявка, ВидСравненияКомпоновкиДанных.Равно, Истина);
		
	ИначеЕсли ФильтрЭтапСделки = 0 Тогда
		ОбновитьДинСписок();
		
	ИначеЕсли ФильтрЭтапСделки = 2 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.ВРаботе, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 3 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Собрать, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 4 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Собрано, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 5 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Контроль, ВидСравненияКомпоновкиДанных.Равно, Истина);
 
	ИначеЕсли ФильтрЭтапСделки = 6 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Оформление, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 7 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Оформлено, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 8 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Упаковка, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 9 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Упаковано, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 10 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Доставка, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 11 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Отправлено, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 12 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Завершено, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 13 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Отказ, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 14 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Выдать, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 15 Тогда
		ОбновитьДинСписок();
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(Список, "ЭтапыПродажи",
		Перечисления.ЭтапыПродажи.Выдано, ВидСравненияКомпоновкиДанных.Равно, Истина);

	ИначеЕсли ФильтрЭтапСделки = 1010 Тогда
		ОбновитьДинСписок();
	Иначе
		ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(Список, "ЭтапыПродажи");

	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СписокАкцияВыбор1(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.СписокАкция.ТекущиеДанные;
	СсылкаДляОткрытия    = ТекСтрока.Ссылка1;
	ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокументаУпрощенная", ПараметрыФормы);
КонецПроцедуры

#КонецОбласти
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура СоздатьЗаявку(Команда)
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокументаУпрощенная");
КонецПроцедуры

#КонецОбласти

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	СсылкаДляОткрытия    = ТекСтрока.Ссылка;
	ПараметрыФормы       = Новый Структура("Ключ", СсылкаДляОткрытия);
	ОткрытьФорму("Документ.ЗаказКлиента.Форма.ФормаДокументаУпрощенная", ПараметрыФормы);
КонецПроцедуры

&НаКлиенте
Процедура СписокДашборд1Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Элементы.СписокДашборд1.ТекущиеДанные = Неопределено Тогда
		Возврат
	КонецЕсли;
	
	Если Кэш = Неопределено Тогда
		Кэш = Новый Структура();
		Кэш.Вставить("ФайлыЗвонков", Новый Соответствие());
	КонецЕсли;
	
	СсылкаНаФайл = Элементы.СписокДашборд1.ТекущиеДанные.URL;
	СсылкаНаФайлЛокальная = Кэш.ФайлыЗвонков.Получить(СсылкаНаФайл);
	
	Если СсылкаНаФайлЛокальная = Неопределено Тогда
		
		СсылкаНаФайлЛокальная = дт_МоиЗвонкиКлиент.ПолучитьФайлЗаписи(СсылкаНаФайл);
		Если СсылкаНаФайлЛокальная = Неопределено Тогда
			Возврат
		КонецЕсли;
		
		Кэш.ФайлыЗвонков.Вставить(СсылкаНаФайл, СсылкаНаФайлЛокальная);
		
	КонецЕсли;
	дт_МоиЗвонкиКлиент.ПрослушатьФайл(СсылкаНаФайлЛокальная);
КонецПроцедуры


&НаКлиенте
Процедура СписокПриАктивизацииСтроки(Элемент)
	
	Если Элементы.Список.ТекущиеДанные <> Неопределено Тогда
		ТекДанные = Элементы.список.ТекущиеДанные;
		ОбновитьОтборПартий(ТекДанные);
	КонецЕсли;


КонецПроцедуры

&НаСервере
Процедура ОбновитьОтборПартий(ТекДанные)
	
    СписокДашборд1.Параметры.УстановитьЗначениеПараметра("СсылкаНаЗаявку",ТекДанные.ссылка);
	Товары.Параметры.УстановитьЗначениеПараметра("СсылкаНаЗаявку",ТекДанные.ссылка);
	
КонецПроцедуры


