
&НаКлиенте
Процедура ЗабралиВТК(Команда)
	ЗаказТовараСсылка = ЭтаФорма.Элементы.СписокЗабрать.ТекущиеДанные.ЗаказЗапчастей; 
	ЗабралиВТКНаСервере(ЗаказТовараСсылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗабралиВТКНаСервере(ЗаказТовараСсылка)
	ОбъектЗаказЗапчастей = ЗаказТовараСсылка.ПолучитьОбъект(); 
	ОбъектЗаказЗапчастей.ЗабралиВТК = Истина; 
	ОбъектЗаказЗапчастей.ДатаЗабралиВТК = ТекущаяДатаСеанса(); 
	
	ТекстЛога =  "----------------------------------------------------" + Символы.ПС + ТекущаяДатаСеанса() 
	+ Символы.ПС + Пользователи.ТекущийПользователь() + Символы.ПС +" Установил галку ""Забрали в ТК"" "+  Символы.ПС;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЗакупкаТовара.Логи
		|ИЗ
		|	Документ.ЗакупкаТовара КАК ЗакупкаТовара
		|ГДЕ
		|	ЗакупкаТовара.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ЗаказТовараСсылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТекстЛога = Выборка.логи + ТекстЛога; 
	КонецЕсли; 
	
	ОбъектЗаказЗапчастей.Логи = ТекстЛога; 
	ОбъектЗаказЗапчастей.Записать(); 
КонецПроцедуры
