
&НаКлиенте
Процедура ЗабралиВТК(Команда)
	ЗаказТовараСсылка = ЭтаФорма.Элементы.ЗабратьЗапчасти.ТекущиеДанные.ЗаказЗапчастей; 
	ЗабралиВТКНаСервере(ЗаказТовараСсылка);
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗабралиВТКНаСервере(ЗаказТовараСсылка)
	ОбъектЗаказЗапчастей = ЗаказТовараСсылка.ПолучитьОбъект(); 
	ОбъектЗаказЗапчастей.ЗабралиВТК = Истина; 
	ОбъектЗаказЗапчастей.ДатаЗабралиВТК = ТекущаяДатаСеанса(); 
	
	ТекстЛога =  "----------------------------------------------------" + Символы.ПС + ТекущаяДатаСеанса() 
	+ Символы.ПС + Пользователи.ТекущийПользователь() + Символы.ПС +" Установил галку ""Забрали в ТК"" "+ + Символы.ПС ;
	
	ОбъектЗаказЗапчастей.Лог = ТекстЛога; 
	ОбъектЗаказЗапчастей.Записать(); 
КонецПроцедуры
