Процедура ПоискАртикулаНаНовомСайте(Артикул) Экспорт
	/// Комлев 21/05/24 +++
	Артикул = СтрЗаменить(Артикул," " , "" );     
	Ссылка = "https://wt10.ru/home?text="+ Артикул;
	ЗапуститьПриложение(Ссылка);
	/// Комлев 21/05/24 ---
КонецПроцедуры



Процедура ОткрытьДетальНаСайте(ИндКод) Экспорт

	///+ГомзМА 20.12.2023
	Ссылка = "https://10.wt10.ru/product/" + ИндКод;
	ЗапуститьПриложение(Ссылка);
	///-ГомзМА 20.12.2023

КонецПроцедуры

Процедура ПоискКодаНаСтаромСайте(Код) Экспорт
	Код = СокрЛП(Код);     
 	Ссылка = "https://worktruck.ru/search?keywords="+Формат("00"+Код,"ЧЦ=8; ЧГ=0");
	ЗапуститьПриложение(ссылка);
КонецПроцедуры

Процедура ОткрытьДетальНаСайтеСписком(Артикул) Экспорт
	/// Комлев 22/05/24 +++
	
	Ссылка = "https://10.wt10.ru/catalog?text=" + Артикул + "&page=1";
	ЗапуститьПриложение(Ссылка);
	/// Комлев 22/05/24 +++
КонецПроцедуры

Процедура ОткрытьДетальНаСайтеWT10(ИндКод) Экспорт
	/// Мазин 22/05/24 +++
	
	Ссылка = "https://wt10.ru/product-details/" + ИндКод;
	ЗапуститьПриложение(Ссылка);
	/// Мазин 22/05/24 +++
КонецПроцедуры

Процедура ОткрытьЗаявкуНаСайтеWT10(НомерЗаявки) Экспорт
	/// Мазин 22/05/24 +++
	
	Ссылка = "https://wt10.ru/application-details/" + НомерЗаявки;
	
	ЗапуститьПриложение(Ссылка);
	/// Мазин 22/05/24 +++
КонецПроцедуры

Процедура ОткрытьКарточкуТовараНаСайтеWT10(Код) Экспорт
	/// Мазин 22/05/24 +++
	
	Ссылка = "https://wt10.ru/card-product-details/" + Код;
	ЗапуститьПриложение(Ссылка);
	/// Мазин 22/05/24 +++
КонецПроцедуры

Процедура ОткрытьДетальНаСайтеZapchasti10(ИндКод) Экспорт
	Ссылка =  "https://zapchasti10.ru/product/" + ИндКод;
	ЗапуститьПриложение(Ссылка);
КонецПроцедуры