
&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)

Родитель = Объект.Родитель;
Пока НЕ Родитель = Справочники.ФОТ.ПустаяСсылка() Цикл
	
	
	РодительОбъект = Родитель.ПолучитьОбъект();

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ФОТ.ЗПФакт), 0) КАК ЗПФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.ОкладФакт), 0) КАК ОкладФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияФакт), 0) КАК МотивацияФакт,
		|	ЕСТЬNULL(СУММА(ФОТ.СредняяЗППлан), 0) КАК СредняяЗППлан,
		|	ЕСТЬNULL(СУММА(ФОТ.ОкладПлан), 0) КАК ОкладПлан,
		|	ЕСТЬNULL(СУММА(ФОТ.МотивацияПлан), 0) КАК МотивацияПлан,
		|	ЕСТЬNULL(СУММА(ФОТ.НижнийУровеньЗП), 0) КАК НижнийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.СреднийУровеньЗП), 0) КАК СреднийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.ВерхнийУровеньЗП), 0) КАК ВерхнийУровеньЗП,
		|	ЕСТЬNULL(СУММА(ФОТ.КоличествоСотрудников), 0) КАК КоличествоСотрудников
		|ИЗ
		|	Справочник.ФОТ КАК ФОТ
		|ГДЕ
		|	ФОТ.Родитель = &Родитель";
	
	Запрос.УстановитьПараметр("Родитель", Родитель);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	РезультатЗапроса.Следующий();
	
	РодительОбъект.ЗПФакт = РезультатЗапроса.ЗПФакт;
	РодительОбъект.ОкладФакт = РезультатЗапроса.ОкладФакт;
	РодительОбъект.МотивацияФакт = РезультатЗапроса.МотивацияФакт;
	РодительОбъект.СредняяЗППлан = РезультатЗапроса.СредняяЗППлан;
	РодительОбъект.ОкладПлан = РезультатЗапроса.ОкладПлан;
	РодительОбъект.МотивацияПлан = РезультатЗапроса.МотивацияПлан;
	РодительОбъект.НижнийУровеньЗП = РезультатЗапроса.НижнийУровеньЗП;
	РодительОбъект.СреднийУровеньЗП = РезультатЗапроса.СреднийУровеньЗП;
	РодительОбъект.ВерхнийУровеньЗП = РезультатЗапроса.ВерхнийУровеньЗП;
	РодительОбъект.КоличествоСотрудников = РезультатЗапроса.КоличествоСотрудников;
	
	Родитель = РодительОбъект.Родитель;
	
	РодительОбъект.Записать();
	
КонецЦикла
	
КонецПроцедуры

&НаКлиенте
Процедура НазначениеФОТПриИзменении(Элемент)
	НазначениеФОТПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура НазначениеФОТПриИзмененииНаСервере()
	
Если Объект.НазначениеФОТ = Перечисления.НазначенияФОТ.ВакантноеМесто или Объект.НазначениеФОТ = Перечисления.НазначенияФОТ.ШтатныйСотрудник  Тогда
	Элементы.Сотрудник.Видимость = Истина;
Иначе
	Элементы.Сотрудник.Видимость = Ложь;
КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
Если Объект.НазначениеФОТ = Перечисления.НазначенияФОТ.ВакантноеМесто Тогда
	Элементы.Сотрудник.Видимость = Истина;
Иначе
	Элементы.Сотрудник.Видимость = Ложь;
КонецЕсли;
КонецПроцедуры


