
Процедура Печать(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.ПремииМенеджерамПоПродажам.ПолучитьМакет("Печать");
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ПремииМенеджерамПоПродажам.Дата,
	|	ПремииМенеджерамПоПродажам.ПродажиПремии.(
	|		НомерСтроки,
	|		Сотрудник,
	|		СуммаПродаж,
	|		Премия
	|	)
	|ИЗ
	|	Документ.ПремииМенеджерамПоПродажам КАК ПремииМенеджерамПоПродажам
	|ГДЕ
	|	ПремииМенеджерамПоПродажам.Ссылка В (&Ссылка)";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок			= Макет.ПолучитьОбласть("Заголовок");
	ОбластьПродажиПремииШапка 	= Макет.ПолучитьОбласть("ПродажиПремииШапка");
	ОбластьПродажиПремии 		= Макет.ПолучитьОбласть("ПродажиПремии");
	ОбластьПодпись 				= Макет.ПолучитьОбласть("Подпись");
	ТабДок.Очистить();

	ВставлятьРазделительСтраниц = Ложь;
	Пока Выборка.Следующий() Цикл
		Если ВставлятьРазделительСтраниц Тогда
			ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;

		ТекстЗаголовка = "Премии менеджеров за " + ПолучитьМесяцВСтроку(Выборка.Дата) + " " + 
			СтрЗаменить(Год(Выборка.Дата), Символы.НПП, "");
		ОбластьЗаголовок.Параметры.Заголовок = ТекстЗаголовка;
		ТабДок.Вывести(ОбластьЗаголовок);

		ТабДок.Вывести(ОбластьПродажиПремииШапка);
		ВыборкаПродажиПремии = Выборка.ПродажиПремии.Выбрать();
		Пока ВыборкаПродажиПремии.Следующий() Цикл
			ОбластьПродажиПремии.Параметры.Заполнить(ВыборкаПродажиПремии);
			ТабДок.Вывести(ОбластьПродажиПремии, ВыборкаПродажиПремии.Уровень());
		КонецЦикла;

		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
	ТабДок.Вывести(ОбластьПодпись);

КонецПроцедуры

Функция ПолучитьМесяцВСтроку(перДата)
	
	Месяца = Новый Соответствие;
	Месяца.Вставить(1, "январь");
	Месяца.Вставить(2, "февраль");
	Месяца.Вставить(3, "март");
	Месяца.Вставить(4, "апрель");
	Месяца.Вставить(5, "май");
	Месяца.Вставить(6, "июнь");
	Месяца.Вставить(7, "июль");
	Месяца.Вставить(8, "август");
	Месяца.Вставить(9, "сентябрь");
	Месяца.Вставить(10, "октябрь");
	Месяца.Вставить(11, "ноябрь");
	Месяца.Вставить(12, "декабрь");

	Возврат Месяца.Получить(Месяц(перДата));
	
КонецФункции
