#Область ЗаказНаряд_Работы

Процедура РаботаПриИзменении(ДанныеСтроки, ЗаполнитьНормуВремени = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(ДанныеСтроки.Работа) Тогда
		Возврат
	КонецЕсли;
	
	Цены = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеСтроки.Работа, Новый Структура("ВремяВыполнения,Нормочас", "ВремяВыполнения", "КатегорияРабот.Нормочас"));
	Если ЗаполнитьНормуВремени Тогда
		ДанныеСтроки.Нормочас = Цены.ВремяВыполнения;
	КонецЕсли;
		
	ДанныеСтроки.Цена = Цены.Нормочас;

	ЕстьТипНаценки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ДанныеСтроки, "ТипНаценки");
	
	Если ЕстьТипНаценки Тогда
		ДанныеСтроки.Цена = ДанныеСтроки.Цена * (1 + ПолучитьПроцентНаценки(ДанныеСтроки.ТипНаценки));
	КонецЕсли;


	
	Если Не ЗначениеЗаполнено(ДанныеСтроки.Количество) Тогда
		ДанныеСтроки.Количество = 1;	
	КонецЕсли;
	
	
КонецПроцедуры // РаботаПриИзмененииСервер()

Функция ПолучитьСтавкуПоРаботам(Дата = Неопределено) Экспорт
	
	Возврат дт_Автосервис.ПолучитьСтавкуПоРаботам(Дата);
	
КонецФункции

Функция ПолучитьПроцентНаценки(ТипНаценки) Экспорт
	
	Результат = 0;
	
	Если Не ЗначениеЗаполнено(ТипНаценки) Тогда
		Возврат Результат;
	КонецЕсли;
	
	Результат = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ТипНаценки, "ПроцентНаценки");
	
	Результат = Результат / 100;
	
	Возврат Результат;
		
КонецФункции
	
#КонецОбласти