

#Область ЗаказНаряд_ТабличныеЧасти


Процедура ОбработкаИзмененияСтроки(Объект, ИмяТабличнойЧасти, ТекДанные, Поле = Неопределено) Экспорт

	//ТекДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	ЕстьСумма = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекДанные, "Сумма");
	
	Если Не ЕстьСумма Тогда
		Возврат
	КонецЕсли;
	
	Коэф = ?(ИмяТабличнойЧасти = "Работы" ИЛИ ИмяТабличнойЧасти = "РаботыСписок", ТекДанные.Нормочас, 1);
	ЕстьУчетВремени = ИмяТабличнойЧасти = "Работы";
	ЕстьТипНаценки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ТипНаценки")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекДанные, "СуммаНалог");
	ЕстьСуммаАгентских = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекДанные, "СуммаАгентские");
	
	НаценкаПроцент = 0;
	Если ЕстьТипНаценки Тогда
		НаценкаПроцент = дт_АвтосервисВызовСервера.ПолучитьПроцентНаценки(Объект.ТипНаценки);	
	КонецЕсли;	
	
	Если Поле = Неопределено ИЛИ Поле = "Количество" Тогда

		ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Количество * Коэф;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
		
		Если ЕстьУчетВремени Тогда
			ТекДанные.ВремяПлан = ТекДанные.Количество * Коэф;
		КонецЕсли;
 
		
	ИначеЕсли Поле = "Сумма" Тогда
		Если ТекДанные.Количество <> 0 Тогда
			ТекДанные.Цена = ТекДанные.Сумма / Коэф / ТекДанные.Количество;
		КонецЕсли;
		ТекДанные.СкидкаСумма = ТекДанные.Сумма * ТекДанные.СкидкаПроцент / 100;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
	ИначеЕсли Поле = "СкидкаПроцент" Тогда
		ТекДанные.СкидкаСумма = ТекДанные.Сумма * ТекДанные.СкидкаПроцент / 100;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
	ИначеЕсли Поле = "СкидкаСумма" Тогда
		ТекДанные.СкидкаПроцент = ТекДанные.СкидкаСумма * 100 / ТекДанные.Сумма;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
	ИначеЕсли Поле = "СуммаВсего" Тогда
		
		Если ЕстьУчетВремени Тогда
			// для работ пересчитывем норму времени, а не скидку
			ТекДанные.Сумма = ТекДанные.СуммаВсего - ТекДанные.СкидкаСумма;
			Если ТекДанные.Цена * ТекДанные.Количество <> 0 Тогда
				ТекДанные.Нормочас = ТекДанные.Сумма / (ТекДанные.Цена * ТекДанные.Количество);
			КонецЕсли;
		Иначе	
			ТекДанные.СкидкаСумма = ТекДанные.Сумма - ТекДанные.СуммаВсего;
			ТекДанные.СкидкаПроцент = ТекДанные.СкидкаСумма * 100 / ТекДанные.Сумма;
		КонецЕсли;
		
	ИначеЕсли Поле = "Нормочас" Тогда
		ТекДанные.Сумма = ТекДанные.Цена * ТекДанные.Нормочас * ТекДанные.Количество;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
	КонецЕсли;
	
	
	Если ЕстьСуммаАгентских И Поле <> "СуммаАгентские" Тогда
		ТекДанные.СуммаАгентские = ТекДанные.СуммаВсего * Объект.ПроцентАгентских / 100;
	КонецЕсли;
	
	Если ЕстьТипНаценки И Поле <> "СуммаНалог" Тогда 
		ТекДанные.СуммаНалог = ТекДанные.СуммаВсего - Окр(ТекДанные.СуммаВсего / (1 + НаценкаПроцент), 2);  
	КонецЕсли;
	
	///Добавлено условие для документа Рас_Комплектовка (ГомзМА 15.08.2023)
	Если ИмяТабличнойЧасти <> "РаботыСписок" Тогда
		Объект.СуммаДокумента = Объект.Работы.Итог("СуммаВсего") + Объект.Товары.Итог("СуммаВсего");
	КонецЕсли;
		


КонецПроцедуры // ОбработкаИзмененияСтроки()

//++Мазин (Если цена со скидкой или наценкой)
Процедура ОбработкаИзмененияСтрокиСкидкаНаценка(Объект, ИмяТабличнойЧасти, ТекДанные, Поле = Неопределено) Экспорт

	//ТекДанные = Элементы[ИмяТабличнойЧасти].ТекущиеДанные;
	
	ЕстьСумма = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекДанные, "Сумма");
	
	Если Не ЕстьСумма Тогда
		Возврат
	КонецЕсли;
	
	Коэф = ?(ИмяТабличнойЧасти = "Работы" ИЛИ ИмяТабличнойЧасти = "РаботыСписок", ТекДанные.Нормочас, 1);
	ЕстьУчетВремени = ИмяТабличнойЧасти = "Работы";
	ЕстьТипНаценки = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Объект, "ТипНаценки")
		И ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекДанные, "СуммаНалог");
	ЕстьСуммаАгентских = ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(ТекДанные, "СуммаАгентские");
	
	НаценкаПроцент = 0;
	Если ЕстьТипНаценки Тогда
		НаценкаПроцент = дт_АвтосервисВызовСервера.ПолучитьПроцентНаценки(Объект.ТипНаценки);	
	КонецЕсли;	
	
	Если Поле = Неопределено ИЛИ Поле = "Количество" Тогда

		ТекДанные.Сумма = ТекДанные.ЦенаСоСкидкойНаценкой * ТекДанные.Количество * Коэф;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
		
		Если ЕстьУчетВремени Тогда
			ТекДанные.ВремяПлан = ТекДанные.Количество * Коэф;
		КонецЕсли;
 
		
	ИначеЕсли Поле = "Сумма" Тогда
		Если ТекДанные.Количество <> 0 Тогда
			ТекДанные.ЦенаСоСкидкойНаценкой = ТекДанные.Сумма / Коэф / ТекДанные.Количество;
		КонецЕсли;
		ТекДанные.СкидкаСумма = ТекДанные.Сумма * ТекДанные.СкидкаПроцент / 100;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
	ИначеЕсли Поле = "СкидкаПроцент" Тогда
		ТекДанные.СкидкаСумма = ТекДанные.Сумма * ТекДанные.СкидкаПроцент / 100;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
	ИначеЕсли Поле = "СкидкаСумма" Тогда
		ТекДанные.СкидкаПроцент = ТекДанные.СкидкаСумма * 100 / ТекДанные.Сумма;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
	ИначеЕсли Поле = "СуммаВсего" Тогда
		
		Если ЕстьУчетВремени Тогда
			// для работ пересчитывем норму времени, а не скидку
			ТекДанные.Сумма = ТекДанные.СуммаВсего - ТекДанные.СкидкаСумма;
			Если ТекДанные.ЦенаСоСкидкойНаценкой * ТекДанные.Количество <> 0 Тогда
				ТекДанные.Нормочас = ТекДанные.Сумма / (ТекДанные.ЦенаСоСкидкойНаценкой * ТекДанные.Количество);
			КонецЕсли;
		Иначе	
			ТекДанные.СкидкаСумма = ТекДанные.Сумма - ТекДанные.СуммаВсего;
			ТекДанные.СкидкаПроцент = ТекДанные.СкидкаСумма * 100 / ТекДанные.Сумма;
		КонецЕсли;
		
	ИначеЕсли Поле = "Нормочас" Тогда
		ТекДанные.Сумма = ТекДанные.ЦенаСоСкидкойНаценкой * ТекДанные.Нормочас * ТекДанные.Количество;
		ТекДанные.СуммаВсего = ТекДанные.Сумма - ТекДанные.СкидкаСумма;
	КонецЕсли;
	
	
	Если ЕстьСуммаАгентских И Поле <> "СуммаАгентские" Тогда
		ТекДанные.СуммаАгентские = ТекДанные.СуммаВсего * Объект.ПроцентАгентских / 100;
	КонецЕсли;
	
	Если ЕстьТипНаценки И Поле <> "СуммаНалог" Тогда 
		ТекДанные.СуммаНалог = ТекДанные.СуммаВсего - Окр(ТекДанные.СуммаВсего / (1 + НаценкаПроцент), 2);  
	КонецЕсли;
	
	///Добавлено условие для документа Рас_Комплектовка (ГомзМА 15.08.2023)
	Если ИмяТабличнойЧасти <> "РаботыСписок" Тогда
		Объект.СуммаДокумента = Объект.Работы.Итог("СуммаВсего") + Объект.Товары.Итог("СуммаВсего");
	КонецЕсли;
КонецПроцедуры
//--Мазин 

	
#КонецОбласти
