#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура УстановкаПараметровСеанса(ИменаПараметровСеанса)

	// СтандартныеПодсистемы
	СтандартныеПодсистемыСервер.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// Конец СтандартныеПодсистемы
	
	// ++ obrv 11.08.20
	дт_ПраваДоступа.УстановкаПараметровСеанса(ИменаПараметровСеанса);
	// -- obrv 11.08.20
	
	
	//ТехнологияСервиса.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
	// Конец ТехнологияСервиса 
	
	//++ Локализация
   	// Маг1С
	//Маг1ССервер.ВыполнитьДействияПриУстановкеПараметровСеанса(ИменаПараметровСеанса);
КонецПроцедуры  






#КонецОбласти

#КонецЕсли