

#Область ОбработчикиСобытийФормы
// <Описание процедуры>
//
// Параметры:
//  <Параметр1>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//  <Параметр2>  - <Тип.Вид> - <описание параметра>
//                 <продолжение описания параметра>
//

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры


&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	ОтветственноеХранение = ЗначениеЗаполнено(Объект.Контрагент);
	
КонецПроцедуры



#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВиртуальныйПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры

&НаКлиенте
Процедура ОтветственноеХранениеПриИзменении(Элемент)
	
	УправлениеФормой(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТипСкладаПриИзменении(Элемент)
	УправлениеФормой(ЭтаФорма);
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ИмяТаблицы



#КонецОбласти

#Область ОбработчикиКомандФормы



#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиентеНаСервереБезКонтекста
Процедура УправлениеФормой(Форма)
	
	Элементы = Форма.Элементы;
	Объект = Форма.Объект;
	
	ЭтоВиртуальныйСклад = Объект.ТипСклада = ПредопределенноеЗначение("Перечисление.дт_ТипыСкладов.Виртуальный");
	ЭтоТранзитнаяЗона = Объект.ТипСклада = ПредопределенноеЗначение("Перечисление.дт_ТипыСкладов.ТранзитнаяЗона");
	
	Элементы.Контрагент.Видимость = Форма.ОтветственноеХранение;
	Элементы.ГруппаСвойстваСклада.Видимость = НЕ ЭтоВиртуальныйСклад И НЕ ЭтоТранзитнаяЗона;
	

КонецПроцедуры
 // УправлениеФормой()



#КонецОбласти