
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не Пользователи.РолиДоступны("ПолныеПрава") Тогда 
		ТекстЗапроса = Список.ТекстЗапроса;
		ТекстЗапроса = ТекстЗапроса + Символы.ПС + "ГДЕ" + Символы.ПС + "Обязанности.Кураторы.Сотрудник = &Сотрудник";
		Список.ТекстЗапроса = ТекстЗапроса;
		Список.Параметры.УстановитьЗначениеПараметра("Сотрудник",Справочники.Сотрудники.НайтиПоРеквизиту("Пользователь",Пользователи.ТекущийПользователь()));
	КонецЕсли;
	
КонецПроцедуры
