
&НаКлиенте
Процедура ОткрытьДетальНаСайте(Команда)
	// Комлев АА 08/12/24 +++
	ИндКод = Элементы.СписокДеталейНоменклатуры.ТекущиеДанные.индкод;
	ОбщДействия.ОткрытьДетальНаСайтеWT10(ИндКод);
	// Комлев АА 08/12/24 ---
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Комлев АА 08/12/24 +++
	ДатаМесяцНазад = ДобавитьМесяц(ТекущаяДата(), -1 );
	СписокПроверенногоТовара.Параметры.УстановитьЗначениеПараметра("ДатаМесяцНазад", ДатаМесяцНазад);
	УсловноеОФормлениеСписокПроверенныхТоваров();
	// Комлев АА 08/12/24 ---
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверенногоТовараПриАктивизацииСтроки(Элемент)
	// Комлев АА 08/12/24 +++
	ТекДанные = Элементы.СписокПроверенногоТовара.ТекущаяСтрока;
	ДатаМесяцНазад = ДобавитьМесяц(ТекущаяДата(), -1 );
	СписокДеталейНоменклатуры.Параметры.УстановитьЗначениеПараметра("Товар", ТекДанные);
	СписокДеталейНоменклатуры.Параметры.УстановитьЗначениеПараметра("ДатаМесяцНазад", ДатаМесяцНазад);
	СписокДеталейНоменклатуры.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());
	// Комлев АА 08/12/24 ---
КонецПроцедуры

Процедура УсловноеОФормлениеСписокПроверенныхТоваров() 
	/// Комлев АА 09/12/24 ++++
	ЭлементОформления = СписокПроверенногоТовара.УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КоличествоФото");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Меньше;
	ЭлементОтбора.ПравоеЗначение = Новый ПолеКомпоновкиДанных("Количество");
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноКрасноФиолетовый);
	ЭлементОформления.Использование = Истина;
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("КоличествоФото");
	ПолеОформления.Использование = Истина;
	
	ЭлементОформления = СписокДеталейНоменклатуры.УсловноеОформление.Элементы.Добавить();
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ЕстьФото");
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ЭлементОтбора.ПравоеЗначение = Ложь;
	ЭлементОтбора.Использование = Истина;
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.БледноКрасноФиолетовый);
	ЭлементОформления.Использование = Истина;
	ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("ЕстьФото");
	ПолеОформления.Использование = Истина;

	
	/// Комлев АА 09/12/24 ---
КонецПроцедуры

