
&НаКлиенте
Процедура ОткрытьДетальНаСайте(Команда)
	ИндКод = Элементы.СписокДеталейНоменклатуры.ТекущиеДанные.индкод;
	ОбщДействия.ОткрытьДетальНаСайтеWT10(ИндКод);
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДатаМесяцНазад = ДобавитьМесяц(ТекущаяДата(), -1 );
	СписокПроверенногоТовара.Параметры.УстановитьЗначениеПараметра("ДатаМесяцНазад", ДатаМесяцНазад);
КонецПроцедуры

&НаКлиенте
Процедура СписокПроверенногоТовараПриАктивизацииСтроки(Элемент)
	ТекДанные = Элементы.СписокПроверенногоТовара.ТекущаяСтрока;
	ДатаМесяцНазад = ДобавитьМесяц(ТекущаяДата(), -1 );
	СписокДеталейНоменклатуры.Параметры.УстановитьЗначениеПараметра("Товар", ТекДанные);
	СписокДеталейНоменклатуры.Параметры.УстановитьЗначениеПараметра("ДатаМесяцНазад", ДатаМесяцНазад);
КонецПроцедуры

