#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс


Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат
	КонецЕсли;
	
	МассивНепроверяемыхРеквизитов = Новый Массив();
		
	Если ЭтотОбъект.ЮрФизЛицо <> ПредопределенноеЗначение("Перечисление.дт_ТипыКлиентов.ЮрЛицо") Тогда
		МассивНепроверяемыхРеквизитов.Добавить("ИНН");
	КонецЕсли;
		
	ОбщегоНазначения.УдалитьНепроверяемыеРеквизитыИзМассива(ПроверяемыеРеквизиты, МассивНепроверяемыхРеквизитов);

КонецПроцедуры



Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если Не ЗначениеЗаполнено(ЮрФизЛицо) Тогда
		ЮрФизЛицо = ПредопределенноеЗначение("Перечисление.дт_ТипыКлиентов.ЮрЛицо");
	КонецЕсли;
КонецПроцедуры


#КонецОбласти

#Область ОбработчикиСобытий



#КонецОбласти

#Область СлужебныеПроцедурыИФункции



#КонецОбласти

#КонецЕсли